[
  {
    "url": "http://www.thekitchykitchen.com/?recipes=/white-chocolate-matcha-latte/#_a5y_p=4557246",
    "markdown": "Failed to convert"
  },
  {
    "url": "http://coupleeatsfood.com/chewy-white-chocolate-matcha-cookie/",
    "markdown": "# Chewy White Chocolate Matcha Cookie - Couple Eats Food\nWe're back again with another Matcha recipe since we've been really into it and our brownies were such a success! One of our favourite sweet treats are cookies and we used to make them a lot when we were back in University. We would make a batch of 6 gigantic chocolate chip cookies and eat them all in one sitting. Ah... How we miss those uni days!\n\n![](http://coupleeatsfood.com/wp-content/uploads/2017/08/Chewy-White-Chocolate-Matcha-Cookie.jpg)\n\nDon't these cookies look amazing with that glass of (almond) milk?! They were seriously the most amazing chewy cookies - kind of crispy on the outside, but tender on the inside. These cookies look flatter than what we're usually used to, and it's probably because we didn't use any baking powder (We're no expert, so please let us know if it's because of something else) but we really them. Sometimes when cookies are too big, they feel like cakes, which is not bad, but it's not what we prefer.\n\n![](http://coupleeatsfood.com/wp-content/uploads/2017/08/Chewy-White-Chocolate-Matcha-Cookie-2.jpg)\n\nYou can definitely switch the white chocolate chips for some nuts or dried fruits if you prefer a healthier option, but we personally love matcha and white chocolate together.\n\n![](http://coupleeatsfood.com/wp-content/uploads/2017/08/Chewy-White-Chocolate-Matcha-Cookie-3.jpg)\n\nIf you want a tip for the perfect cookies, do not underestimate the art of cooling. When waiting for the cookies to be ready, patience really is a virtue. However, if you do not wait for the cookies to cool down, you won't even be able to hold them because they will be too tender. Let us remind you that these cookies are very flat and tend to be more fragile. If you truly want to get the best possible results and enjoy them, please follow our instructions thoroughly. Happy eating !\n\nCheck out our White Chocolate Matcha Brownie [here](https://coupleeatsfood.com/white-chocolate-matcha-green-tea-brownies-recipe/).\n\n![A stack of chewy white chocolate matcha cookie on a wooden plate.](https://coupleeatsfood.com/wp-content/uploads/2022/04/chewy-white-chocolate-matcha-cookie-16-300x300.jpg)\n\n*   1 cup all-purpose flour\n*   3/4 tbsp matcha powder\n*   1/4 tsp baking soda\n*   1/2 cup brown sugar\n*   3/8 cup butter melted\n*   1/4 cup granulated sugar\n*   1/2 tbsp vanilla extract\n*   1 egg\n*   3/4 cup white chocolate chip\n\n*   Preheat oven to 325 degrees and line parchment paper on baking sheet. \n    \n*   In a large mixing bowl, sift the flour, matcha powder, and baking soda, and mix together. In another bowl, combine the brown sugar, granulated sugar, egg and butter together using a whisk until creamy. \n    \n*   Mix the dry ingredient into the wet ingredient until the cookie dough is all blended. When everything is all mixed together, add the white chocolate chip into the mixture. \n    \n*   Drop dough by rounded tablespoons onto baking sheet, making sure they are 2-3 inch apart. Bake the cookies for 10-12 minutes, or until edges are lightly browned. Cool cookies for about 5 minutes and transfer to a rack to cool completely. \n    \n\nReader Interactions\n-------------------"
  },
  {
    "url": "http://www.bourbonandhoney.com/vanilla-coconut-matcha-latte/",
    "markdown": "# Vanilla Coconut Matcha Latte | Bourbon and Honey\nDecember 15, 2015\n\n_A seriously simple and delicious recipe for a Vanilla Coconut Matcha Latte, the perfect dairy free, gluten-free and vegan mid-morning pick-me-up._\n\n![Vanilla Coconut Matcha Latte | BourbonandHoney.com](https://www.bourbonandhoney.com/wp-content/uploads/2015/12/Vanilla-Coconut-Matcha-Latte-BourbonandHoney.com-1.jpg)\n\nI’m a coffee lover through and through. My morning is not complete without a mug of black coffee the size of a big gulp. It’s not just the caffeine that I’m craving, it’s the morning ritual of a warm comforting mug to wrap my hands around and sip in silence before the day really gets rolling.\n\nI recently went to Korea and Japan on vacation (I promise once I finally go through all the photos, I will share them with you!) and gained a new appreciation for tea, specifically matcha. For one, it’s delicious. But, it’s also super versatile! The dry powder makes it easy to add into cakes, cookies, ice cream, cocktails, you name it!\n\n![Vanilla Coconut Matcha Latte | BourbonandHoney.com ](https://www.bourbonandhoney.com/wp-content/uploads/2015/12/Vanilla-Coconut-Matcha-Latte-BourbonandHoney.com-2.jpg)\n\nMy favorite way to enjoy it though is to keep it simple with a coconut milk latte in the morning (please don’t tell my French Press that I’m cheating on it!), especially on the weekends. It’s faster than brewing a cup of coffee and the smooth, nutty flavor is almost like dessert in a mug.\n\nI tend to not add any sweetener since the coconut milk is naturally sweet but feel free to add in some coconut sugar, honey or sweetener of choice.\n\n![Vanilla Coconut Matcha Latte | BourbonandHoney.com ](https://www.bourbonandhoney.com/wp-content/uploads/2015/12/Vanilla-Coconut-Matcha-Latte-BourbonandHoney.com-4.jpg)\n\nYou guys, check this out! I created a video for you, to show you just how quickly you can whisk up this tasty latte!\n\n[Print](https://www.bourbonandhoney.com/vanilla-coconut-matcha-latte/print/9751/)\n\n![Vanilla Coconut Matcha Latte | BourbonandHoney.com](https://www.bourbonandhoney.com/wp-content/uploads/2015/12/Vanilla-Coconut-Matcha-Latte-BourbonandHoney.com-2-150x150.jpg)\n\nA simple and delicious recipe for a Coconut Matcha Latte, the perfect mid-morning pick-me-up.\n\n*   **Prep Time:** 5 mins\n*   **Total Time:** 5 minutes\n*   **Yield:** 1 Latte 1x\n\n*   1 teaspoon matcha powder\n*   1/4 cup hot water\n*   3/4 cup full fat coconut milk or non-dairy milk (almond or rice)\n*   1/2 vanilla bean, split, seeds scraped (or dash of vanilla extract)\n*   1/2 teaspoon sweetener, if desired (like coconut sugar, honey or brown sugar)\n\n1.  Spoon the matcha powder into the bottom of a mug, set aside.\n2.  In a small saucepan, heat the water just to a simmer (about 170°F). Pour the hot water into the mug and whisk well until the matcha powder is fully dissolved.\n3.  In the same saucepan, heat the coconut milk and seeds from the vanilla bean until it just begins to simmer. Remove from heat and pour into the mug, add sweetener, if desired and whisk to blend. Enjoy!\n\n### Nutrition\n\n*   **Serving Size:** 1 Serving\n*   **Calories:** 123\n*   **Sugar:** 0g\n*   **Sodium:** 188mg\n*   **Fat:** 10g\n*   **Saturated Fat:** 9g\n*   **Unsaturated Fat:** 0g\n*   **Carbohydrates:** 3g\n*   **Fiber:** 1g\n*   **Protein:** 3g\n*   **Cholesterol:** 0mg\n\nOr, try my [Coconut Banana Matcha Smoothie](https://www.bourbonandhoney.com/coconut-banana-matcha-smoothie/)…\n\n![Coconut Banana Matcha Smoothie | BourbonandHoney.com -- Energizing, slightly sweet and totally delicious, this Coconut Banana Matcha Smoothie is a great on-the-go breakfast.](https://www.bourbonandhoney.com/wp-content/uploads/2016/01/Coconut-Banana-Matcha-Smoothie-BourbonandHoney.com-2.jpg)\n\nOr maybe my [Mango, Banana and Grapefruit Smoothie](https://www.bourbonandhoney.com/mango-banana-grapefruit-smoothie/)…\n\n![Mango, Banana and Grapefruit Smoothie | BourbonandHoney.com](https://www.bourbonandhoney.com/wp-content/uploads/2015/01/Mango-Grapefruit-and-Banana-Smoothie-_-BourbonandHoney.com3_.jpg)\n\n###\n\nLike what you see – or have a question, feedback, or recipe idea to share? Join the convo by commenting below and be sure to [subscribe](http://eepurl.com/baQ2Xr) to B&H emails so you don’t miss a thing! If you make this, share it! Tag your photo with #BourbonandHoney on [Instagram](https://instagram.com/BourbonandHoney).\n\n_Please note that some of the links on this page are affiliate links. I only link to products I trust and recommend. Thank you for your support._\n\nReader Interactions\n-------------------"
  },
  {
    "url": "https://choosingchia.com/matcha-latte-chia-pudding/",
    "markdown": "# Matcha latte chia pudding - Choosing Chia\n_This Matcha Latte Chia Pudding is light, creamy and loaded with matcha tea flavour! You’ll love this quick and easy healthy breakfast!_\n\n![matcha latte chia pudding](https://choosingchia.com/jessh-jessh/uploads/2018/12/matcha-latte-chia-pudding-3-1-of-1.jpg)\n\nToday I’ve got a quick and easy breakfast recipe for you. Matcha latte chia pudding.\n\nBecause I’ve totally hopped on the matcha bandwagon and now love with drinking matcha tea and using matcha in my recipes, like in [these brownies](https://choosingchia.com/almond-flour-brownies-with-matcha-mint-frosting/) and [this oatmeal](https://choosingchia.com/creamy-vanilla-matcha-oatmeal/)!\n\nMatcha is SO versatile and can be used in so many ways. You can drink it as a traditional hot tea, make it into a delicious latte, or use it in baking & cooking to add some flavour to your recipes.\n\nIf you’re not familiar with using matcha before, let’s explore a bit more about it!\n\n![matcha latte chia pudding](https://choosingchia.com/jessh-jessh/uploads/2018/12/matcha-latte-chia-pudding-2-1-of-1.jpg)\n\nWhat is Matcha?\n---------------\n\nMatcha is a powdered green tea, where rather than brewing the dried leaves in hot water, you are actually drinking the ground up tea leaves. Matcha powder has a ton of health benefits and antioxidants in it. It does have caffeine, and can offer you a little caffeine boost, without the traditional crash that many people get from drinking coffee\n\nThere are many different types/qualities of matcha for a wide variety of prices. Typically, you will want to choose a higher quality matcha if you’ll be using it for just drinking, and can use a slightly lower quality matcha in baking.\n\nOne important thing to look out for when choosing matcha is the colour. The matcha tea should have a nice bright green colour. I found [this guide](https://thedailytea.com/taste/high-quality-matcha-know-difference/) helpful for selecting a high-quality matcha tea!\n\n![matcha latte chia pudding](https://choosingchia.com/jessh-jessh/uploads/2018/12/matcha-latte-chia-pudding-1-1-of-1.jpg)\n\nA few notes on the recipe:\n--------------------------\n\nThe base of the recipe starts with (of course) chia seeds and plant-based milk. I like to use a mix of homemade almond milk and coconut milk for this recipe to really give it a rich and creamy consistency. Since coconut milk has a higher fat content, it gives the chia pudding a rich texture. If you prefer, you can use all almond milk in the recipe instead.\n\nThis matcha latte chia pudding can be prepared a night in advance before you want to enjoy it, or at least an hour before. You’ll want to make sure to whisk up the chia pudding really well before letting it sit to gel. If the chia pudding mixture becomes too thick if you let it sit overnight, simply add a bit more almond milk.\n\n![matcha latte chia pudding](https://choosingchia.com/jessh-jessh/uploads/2018/12/matcha-latte-chia-pudding-5-1-of-1.jpg)\n\nHere are some great topping options to eat with this chia pudding:\n\n*   Whipped coconut cream (or coconut yogurt)\n*   Matcha powder\n*   Blueberries\n*   Bananas\n*   Toasted slivered almonds\n*   Granola\n\n![matcha latte chia pudding](https://choosingchia.com/jessh-jessh/uploads/2018/12/matcha-latte-chia-pudding-4-1-of-1.jpg)\n\nMore chia pudding recipes to try\n--------------------------------\n\n*   [Key Lime Pie Chia Pudding](https://choosingchia.com/key-lime-pie-chia-pudding/)\n*   [Golden Milk Latte Chia Pudding](https://choosingchia.com/golden-milk-latte-chia-pudding/)\n*   [Chocolate Raspberry Chia Pudding](https://choosingchia.com/chocolate-raspberry-chia-pudding/)\n\n[Print](https://choosingchia.com/matcha-latte-chia-pudding/print/7774/)\n\n* * *\n\n### Description\n\nEnjoy all the flavours you love in a matcha latte now in an easy & healthy chia pudding! Yum! \n\n* * *\n\n* * *\n\n1.  [Whisk](https://www.amazon.com/gp/product/B08KWN6BL2/ref=as_li_qf_asin_il_tl?ie=UTF8&tag=choosingchia-20&creative=9325&linkCode=as2&creativeASIN=B08KWN6BL2&linkId=6eec609e2175b6f95dfa7bb9d4008989) all the ingredients together in a bowl until well combined. \n2.  Place in the fridge for at least an hour before serving or if you have time, overnight. \n3.  Optionally top these chia puddings with some non-dairy yogurt and a sprinkle of matcha powder\n\n* * *\n\n### Notes\n\nChia pudding is best when it sits in the fridge overnight to really absorb the liquid, but it will still be delicious even if you let it sit for just an hour. \n\nIf your chia pudding seems really thick, add an extra couple tablespoons of almond milk and mix. The longer it sits, the more liquid the chia will absorb. \n\nStore this chia pudding in an airtight container in the fridge for up to a week.\n\n* * *\n\n### Nutrition\n\n*   **Serving Size:** 1/2 recipe\n*   **Calories:** 300\n*   **Sugar:** 16g\n*   **Fat:** 13g\n*   **Saturated Fat:** 4g\n*   **Carbohydrates:** 30g\n*   **Fiber:** 10g\n*   **Protein:** 6g\n\nIf you tried this **Matcha Latte Chia Pudding** or any other recipe on the blog let me know how you liked it by leaving a comment/rating below! Be sure to follow along on [Pinterest](https://www.pinterest.ca/choosingchia/), [Instagram](https://www.instagram.com/choosingchia/) and [Facebook](https://www.facebook.com/choosingchia) for even more deliciousness!\n\nThis post contains affiliate links which means I will make a small commission if you purchase through those links. I only recommend products that I know, trust and love!\n\n_posted by_ Jessica Hoffman _on_ January 23, 2019 _(updated April 27, 2022)_\n\n[27 _Comments_](https://choosingchia.com/matcha-latte-chia-pudding/#comments) [Leave a Comment »](#respond)"
  },
  {
    "url": "https://plantbasedrdblog.com/2020/02/matcha-latte-oatmeal/",
    "markdown": "# Matcha Latte Oatmeal - Plant Based RD\n![Matcha Latte Oatmeal](https://plantbasedrdblog.com/wp-content/uploads/2020/02/MLO_1.jpg)\n\nOne of the most random things I adore and look forward to is a matcha latte with soy milk from Starbucks. I know! It’s not the be all, end all of matcha beverages. However, in an area where there aren’t many options for matcha lattes, I make due. This warm beverage is a special one. I adore the creaminess, the slight sweet, and the earthiness created by the matcha. And these simple elements made me realize how desperately I wanted to recreate this in oat form. This **Matcha Latte Oatmeal** combines all of these amazing latte attributes in a bowl of deliciousness you can enjoy for breakfast.\n\n*   [Why is matcha a good idea to add to your oats?](#Why_is_matcha_a_good_idea_to_add_to_your_oats \"Why is matcha a good idea to add to your oats?\")\n*   [Ideas for using matcha powder](#Ideas_for_using_matcha_powder \"Ideas for using matcha powder\")\n*   [How do I make matcha latte oatmeal?](#How_do_I_make_matcha_latte_oatmeal \"How do I make matcha latte oatmeal?\")\n    *   [Some extra oatmeal inspiration](#Some_extra_oatmeal_inspiration \"Some extra oatmeal inspiration\")\n*   [Recipe: Matcha Latte Oatmeal](#Matcha_Latte_Oatmeal \"Recipe: Matcha Latte Oatmeal\")\n    *   [Description](#Description \"Description\")\n    *   [Ingredients](#Ingredients \"Ingredients\")\n    *   [Instructions](#Instructions \"Instructions\")\n        *   [Matcha Instructions](#Matcha_Instructions \"Matcha Instructions\")\n        *   [Oatmeal](#Oatmeal \"Oatmeal\")\n    *   [Notes](#Notes \"Notes\")\n    *   [Did you try this recipe?](#Did_you_try_this_recipe \"Did you try this recipe?\")\n\n**Why is matcha a good idea to add to your oats?**\n--------------------------------------------------\n\nIf you aren’t familiar with matcha, it is a powdered form of green tea leaves. The thing that is different about matcha compared to regular green tea, is that you drink the whole tea leaf, where as with regular tea you steep and remove the leaves from the water. Consuming the whole leaf provides an extra boost in nutrition.\n\nYou may be slightly familiar with matcha now, as it has found its way into the mainstream. You can now find matcha not only served as a warm tea, but also in desserts, breads, and even savory dishes. Or, in my case it’s a good thing to add to my morning oatmeal.\n\nThere are numerous potential benefits for drinking matcha powder. Some of the most prominent benefits include:\n\n*   A boost in antioxidants, specifically catechins such as EGCG, which may **_help prevent cellular damage_**\n*   [Improved cognition and concentration](https://www.ncbi.nlm.nih.gov/pubmed/28056735)\n*   [Stress relief](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6213777/) and improved mood\n\n![](https://plantbasedrdblog.com/wp-content/uploads/2020/02/MLO_3.jpg)\n\nUsing good quality matcha does matter. When I first started using matcha, I had no idea there were various forms sold. You can get lower quality matcha powders just about everywhere, but often times you get what you pay for. Even if it’s super cheap, the taste and consistency is off and can be super bitter.\n\nWhen making beverages or adding to things like my oats, I often will make sure I’m using better quality matcha. With this oatmeal, I used ceremonial grade matcha. Ceremonial grade matcha is the luxury sports car of the matcha world. It sports its brilliant green color and taste tends to be a much smoother taste. For this, I have been using ceremonial grade matcha from [My Encha](https://amzn.to/3bkKmsV). When it comes to baking purposes, you can go a step down and use culinary grade matcha. If a matcha powder doesn’t have the grade added to it, it’s likely a low tier matcha that will most likely taste bad. So be cautious!\n\n**Ideas for using matcha powder**\n---------------------------------\n\n*   Mix into oatmeal or sprinkle a little bit over top\n*   Mixed with chia seeds for a chia pudding\n*   Add to a green smoothie (I love the combo of matcha, mango and spinach)\n*   Sprinkled over some toast spread with nut butter of choice\n*   Add into baked goods\n*   As a beverage on it’s own\n\n**How do I make matcha latte oatmeal?**\n---------------------------------------\n\nFor the matcha, I use a ceremonial grade variety (the best quality and you can definitely notice a difference in flavor). The color is so gorgeous and brilliant green. So, I take my matcha powder and mix it well with a small amount of water separately. I set this aside to use at the end of cooking my oats.\n\nYou can make this recipe as basic as you want, but I find that a combo of unsweetened almond milk and coconut cream blend so well and keep the latte oats super creamy.\n\nInstead of sugar, I sweeten my oats with some ripe banana. I’ll either slice it into coins or mash it and mix it in while the oats cook.\n\nLastly, some pinches of goodness to balance flavor. A pinch of cinnamon is so lovely to help enhance the sweetness. I also love to add some salt at the end for two reasons. It does help to bring out a little more of the sweetness, but it also happens to reduce a bit of the bitterness that you might get from matcha.\n\nOnce your oats are finished cooking, I fold in the matcha. And from there, it’s all magic and gorgeous green swirls.\n\n### **Some extra oatmeal inspiration**\n\n*   [Pumpkin Pie Oatmeal](https://plantbasedrdblog.com/2019/11/23/pumpkin-pie-oatmeal/)\n*   [Zucchini Oatmeal](https://plantbasedrdblog.com/2018/07/07/ginger-zoats/)\n\nHoping all this talk about matcha has made you excited for enhancing your next bowl.\n\n![Matcha Latte Oatmeal](https://plantbasedrdblog.com/wp-content/uploads/2020/02/MLO_2.jpg)\n\n[Print](https://plantbasedrdblog.com/2020/02/matcha-latte-oatmeal/print/3171/)\n\n* * *\n\n### Description\n\nThe ultimate bowl of oatmeal that reminds me of enjoying a delicious matcha latte. Creamy, delicious and no added sugar needed.\n\n* * *\n\n*   1/2 cup rolled oats\n*   1 cup unsweetened soy milk\n*   t tsp chia seeds\n*   2 tbsp coconut cream\n*   1/2 banana, sliced into coins\n*   Pinch of salt\n*   Pinch of cinnamon\n*   1/2 tsp matcha powder\n*   2 tbsp hot water\n\nCook Mode Prevent your screen from going dark\n\n* * *\n\n#### Matcha Instructions\n\n1.  In a small bowl add matcha powder. With a spoon or a matcha whisk, gently break up any clumps in the powder.\n2.  Add 1 tbsp of hot water first and gently whisk/mix together making sure no lumps remain.  Add an additional tbsp of water, stir and set aside.\n\n#### Oatmeal\n\n1.  Add oats, chia, milk and cream to a sauce pan and bring to a low simmer.\n2.  Allow to cook and thicken while stirring occasionally for about 5 minutes. \n3.  Remove oats from heat and add in matcha mixture to oats and fold into oats until matcha is fully incorporated. \n\n* * *\n\n### Notes\n\n*   If you don’t have access to matcha powder, you can transform your oats using other colorful spices and ingredients. For example, ingredients like turmeric can add a beautiful yellow to your oats and still add a boost antioxidants. \n*   I love to top my oats with berries, banana slices, pepitas, and hemp hearts. Sometimes if I don’t feel like doing all the matcha oats prep work, I’ll just sprinkle a bit of the match powder over top. A little still goes a long way. \n*   The coconut cream helps with creaminess, but more importantly makes these oats more decadent. \n*   If you are looking for good quality ceremonial grade matcha powder, I highly recommend [My Encha](https://amzn.to/3bkKmsV). \n\n**Did You Try This Recipe?**  \nThen let me know what you thought! Share your creations by tagging me on [Instagram](https://www.instagram.com/plantbasedrd/) with the hashtag #plantbasedrdeats\n\n**★** Catherine"
  },
  {
    "url": "https://www.ohhowcivilized.com/step-by-step-recipe-matchamisu-matcha-green-tea-tiramisu/?utm_medium=social&utm_source=pinterest&utm_campaign=tailwind_smartloop&utm_content=smartloop&utm_term=6118024",
    "markdown": "# Matchamisu = Matcha (Green Tea) Tiramisu - Oh, How Civilized\nWhat’s Matchamisu? It’s a matcha green tea tiramisu! **This matcha tiramisu recipe is THE original and the best.**\n\n![Matchamisu Matcha Tiramisu photo](https://www.ohhowcivilized.com/wp-content/uploads/2013/06/0613_matcha_green_tea_tiramisu_matchamisu_1.jpg)\n\nMy baking guru, Queenie, came up with the name Matchamisu and the recipe. It’s utterly brilliant.\n\nShe took a classic Italian dessert, the tiramisu, and gave it a green tea spin by replacing espresspo with matcha green tea. Even better, they’re adorable since each one is a mini portion.\n\nLayer upon layer of matcha! It’s super fluffy and rich with alternating layers of matcha cream and matcha sponge cake.\n\nBeware, if you’re sensitive to caffeine, you may want to limit yourself to just one of these decadent tiny treats.\n\n![Matchamisu Matcha Tiramisu ingredients photo](https://www.ohhowcivilized.com/wp-content/uploads/2013/06/0613_matcha_green_tea_tiramisu_matchamisu_2.jpg)\n\n_This post contains affiliate links._ \n\nTable of Contents\n-----------------\n\n*   [What We Used to Make This Matchamisu Recipe](#h-what-we-used-to-make-this-matchamisu-recipe)\n*   [How to Make Matchamisu](#h-how-to-make-matchamisu)\n*   [Matchamisu = Matcha (Green Tea) Tiramisu Recipe](#wprm-recipe-container-10357)\n\nWhat We Used to Make This Matchamisu Recipe\n-------------------------------------------\n\n**INGREDIENTS**\n\n*   **[Matcha](https://www.harney.com/products/matcha-thick-grade?rfsn=2043596.3c5a0d&utm_source=refersion&utm_medium=affiliate&utm_campaign=2043596.3c5a0d)**  \n    The brighter green the matcha is, the better. Look to spend around $15 – $30 regardless of whether it says ceremonial grade or cooking grade.\n*   **Sugar, eggs, all-purpose flour, confectioner’s sugar, rum, mascarpone cheese,** and **heavy cream.**\n\n**TOOLS & EQUIPMENT**\n\n*   **[Stand mixer](https://bit.ly/2ufnF7W)**\n*   **[13″x18′ jelly roll pan](https://bit.ly/2G5OE7o)**\n*   **Parchment paper**\n*   **[Small pan](https://bit.ly/2GgGpc0)**\n*   **[Whisk](https://bit.ly/2owixai)**\n*   **[Dough scraper](https://amzn.to/2pwo4OC)**\n*   **[Mesh strainer](https://bit.ly/2IKOgNx)**\n*   **[Spatula](https://bit.ly/2HWGcrB)**\n*   **[Round cookie cutters](https://bit.ly/2G68sYt)**\n*   **[Mini glass cups](https://bit.ly/2ILzLsW)**\n*   **[Stainless steel bowl](https://bit.ly/2GjN7Oo)** and a **[saucepan](https://bit.ly/2GbRBH5)**  \n    To make the matcha cream, we used this for as a double boiler.\n\n![Matcha syrup how to photo](https://www.ohhowcivilized.com/wp-content/uploads/2013/06/0613_matcha_green_tea_tiramisu_matchamisu_3.jpg)\n\nOk, let’s get started!\n\nHow to Make Matchamisu\n----------------------\n\n**Matcha Simple Syrup**\n\nMaking the matcha syrup first by bringing water (3/4 cup) and sugar (1/2 cup) to a boil in a pan. Simmer for 3 minutes and remove from heat.\n\n![Matcha syrup photo](https://www.ohhowcivilized.com/wp-content/uploads/2013/06/0613_matcha_green_tea_tiramisu_matchamisu_4.jpg)\n\nLet simple syrup cool, then sift in the matcha (1 tablespoon). Whisk well. This can be made up to a day before.\n\n[**RELATED: What is Matcha?**](https://www.ohhowcivilized.com/what-is-matcha-green-tea/)\n\n![Mini tiramisu recipe photo](https://www.ohhowcivilized.com/wp-content/uploads/2013/06/0613_matcha_green_tea_tiramisu_matchamisu_5.jpg)\n\n**Matcha Sponge Cake**\n\nTurn oven on to 350°F. Lay parchment paper on a 13″x18″ sheet tray/jelly roll pan. If the parchment paper rolls up, put a little butter or oil under each corner.\n\nDust the parchment paper with confectioner’s sugar. Set aside.\n\n![Matcha tiramisu photo](https://www.ohhowcivilized.com/wp-content/uploads/2013/06/0613_matcha_green_tea_tiramisu_matchamisu_6.jpg)\n\nSeparate eggs (4). In a mixing bowl, whisk on low speed, then the egg whites for 1 minute. Turn up the speed to medium and slowly add the sugar (7 tablespoons).\n\nAfter the sugar, turn speed to high. Mix until the stiff peaks form and the egg whites look shiny.\n\n![Green tea tiramisu photo](https://www.ohhowcivilized.com/wp-content/uploads/2013/06/0613_matcha_green_tea_tiramisu_matchamisu_7.jpg)\n\nAdd the egg yolks (4) and fold to mix.\n\n![Matchamisu recipe photo](https://www.ohhowcivilized.com/wp-content/uploads/2013/06/0613_matcha_green_tea_tiramisu_matchamisu_8.jpg)\n\nMix well.\n\n[**RELATED: Step-by-Step Recipe: Matcha Mille Crepe Cake**](https://www.ohhowcivilized.com/step-by-step-recipe-gluten-free-mini-matcha-mille-crepe-cake/)\n\n![Green tea tiramisu recipe photo](https://www.ohhowcivilized.com/wp-content/uploads/2013/06/0613_matcha_green_tea_tiramisu_matchamisu_9.jpg)\n\nSift in matcha (1 1/2 tablespoon) and flour (3/4 cup) to the egg mixture and fold.\n\n![Green tea tiramisu photo](https://www.ohhowcivilized.com/wp-content/uploads/2013/06/0613_matcha_green_tea_tiramisu_matchamisu_10.jpg)\n\nPour the mixture onto the sheet tray and spread evenly using a dough scraper.\n\n![Matcha recipe](https://www.ohhowcivilized.com/wp-content/uploads/2013/06/0613_matcha_green_tea_tiramisu_matchamisu_11.jpg)\n\nDust confectioner’s sugar on top using a mesh strainer to get an even coat.\n\n[**RELATED: Easy Matcha Milkshake**](https://www.ohhowcivilized.com/super-easy-matcha-green-tea-milkshake/)\n\n![Best green tea tiramisu recipe](https://www.ohhowcivilized.com/wp-content/uploads/2013/06/0613_matcha_green_tea_tiramisu_matchamisu_12.jpg)\n\nBake for 10 minutes. Let cool then use a cookie cutter (we used the 3″) to cut out circles.\n\n![Matcha tiramisu recipe photo](https://www.ohhowcivilized.com/wp-content/uploads/2013/06/0613_matcha_green_tea_tiramisu_matchamisu_13.jpg)\n\n**Matcha Cream**\n\nBring a small pot of water to a simmer. Put the egg yolks (2), sugar (1 tablespoon), and rum (1 tablespoon) in a stainless steel bowl that will sit on top of the pot.\n\n![Matcha tiramisu recipe photo](https://www.ohhowcivilized.com/wp-content/uploads/2013/06/0613_matcha_green_tea_tiramisu_matchamisu_14.jpg)\n\nContinuously whisk all three ingredients together until it thickens to the ribbon stage (about 5 minutes). Cool for 5 minutes.\n\n![Green tea tiramisu recipe photo](https://www.ohhowcivilized.com/wp-content/uploads/2013/06/0613_matcha_green_tea_tiramisu_matchamisu_15.jpg)\n\nIn another bowl, whip the heavy cream (1/2 cup) until soft peaks form.\n\n[**RELATED: Matcha Latte**](https://www.ohhowcivilized.com/matcha-latte/)\n\n![MIni tiramisu photo](https://www.ohhowcivilized.com/wp-content/uploads/2013/06/0613_matcha_green_tea_tiramisu_matchamisu_16-1.jpg)\n\nFold together the lightly whipped heavy cream and the egg mixture.\n\n![Best green tea tiramisu recipe photo](https://www.ohhowcivilized.com/wp-content/uploads/2013/06/0613_matcha_green_tea_tiramisu_matchamisu_17.jpg)\n\nSift in matcha (1 tablespoon) and mix well. Finally, fold in the mascarpone cheese (2/3 cup).\n\n![Matcha green tea tiramisu photo](https://www.ohhowcivilized.com/wp-content/uploads/2013/06/0613_matcha_green_tea_tiramisu_matchamisu_18.jpg)\n\n**Assembling the Matchamisu**\n\nIn a small glass (we used these [mini cups](https://bit.ly/2ILzLsW)), put in a cut piece of the sponge cake. (We cut a smaller piece of cake to fit the tapered bottom of the cup.)\n\n![Matcha tiramisu image](https://www.ohhowcivilized.com/wp-content/uploads/2013/06/0613_matcha_green_tea_tiramisu_matchamisu_19.jpg)\n\nSpoon on the matcha syrup over the sponge cake, making sure the sponge cake gets soaked with the syrup. Dollop the matcha cream on top.\n\nLayer on another piece of sponge cake. Pour on matcha syrup to the top level sponge cake. Add the final layer of matcha cream and dust with matcha.\n\n![Matcha tiramisu photo](https://www.ohhowcivilized.com/wp-content/uploads/2013/06/0613_matcha_green_tea_tiramisu_matchamisu_20.jpg)\n\n#### Matcha Syrup\n\n*   ▢ 3/4 cup water\n*   ▢ 1/2 cup sugar\n*   ▢ 1 tablespoon [matcha](https://www.harney.com/products/matcha-thick-grade?rfsn=2043596.3c5a0d&utm_source=refersion&utm_medium=affiliate&utm_campaign=2043596.3c5a0d)\n\n#### Matcha Sponge Cake\n\n*   ▢ 4 eggs\n*   ▢ 7 tablespoons sugar\n*   ▢ 3/4 cup all-purpose flour\n*   ▢ 1.5 tablespoons [matcha](https://amzn.to/2SXIInR)\n*   ▢ Confectioner's sugar, for dusting\n\n#### Matcha Cream\n\n*   ▢ 2 egg yolks\n*   ▢ 1 tablespoon sugar\n*   ▢ 1 tablespoon rum\n*   ▢ 2/3 cup mascarpone cheese\n*   ▢ 1/2 cup heavy cream\n*   ▢ 1 tablespoon matcha, \\+ more for dusting\n\n#### Matcha Syrup\n\n*   Make the matcha syrup first by bring water (3/4 cup) and sugar (1/2 cup) to a boil. Simmer for 3 minutes and remove from heat.\n    \n*   Let cool, then sift in the matcha (1 tablespoon). Whisk well. (This can be made up to a day before.)\n    \n\n#### Matcha Sponge Cake\n\n*   Turn oven on to 350°F. Lay parchment paper on a 13″x18″ sheet tray. If the parchment paper rolls up, put a little butter or oil under each corner. Dust the parchment paper with confectioner’s sugar. Set aside.\n    \n*   Separate eggs (4). In a mixing bowl, whisk on low speed, the egg whites for 1 minute. Turn up the speed to medium and slowly add the sugar (7 tablespoons).\n    \n*   After adding the sugar, turn speed to high. Mix until the stiff peaks form and the egg whites look shiny. Add the egg yolks (4) and fold to mix. Sift in matcha (1/2 tablespoon) and flour (3/4 cup) to the egg mixture and fold to incorporate.\n    \n*   Pour the mixture onto the sheet tray and spread evenly. Dust confectioner’s sugar on top.\n    \n*   Bake for 10 minutes. Use a cookie cutter (we used the 3″) to cut out circles.\n    \n\n#### Matcha Cream\n\n*   Bring a small pot of water to a simmer. Put the egg yolks (2), sugar (1 tablespoon), and rum (1 tablespoon) in a stainless steel bowl that will sit on top of the pot.\n    \n*   Continuously whisk all three ingredients together until it thickens to the “ribbon stage” (about 5 minutes). Cool for 5 minutes.\n    \n*   In another bowl, whip the heavy cream (1/2 cup) until soft peaks form. Combine the lightly whipped heavy cream and the egg mixture. Fold together.\n    \n*   Sift in the matcha (1 tablespoon) and mix well. Finally, fold in the mascarpone cheese (2/3 cup).\n    \n\n#### Assembling the Matchamisu\n\n*   In a small glass (we used mini cups), put in a cut out round piece of the sponge cake. (We cut a smaller piece of cake to fit the tapered bottom of the cup.)\n    \n*   Spoon on the matcha syrup over the sponge cake, making sure the sponge cake gets soaked with the syrup. Dollop the matcha cream on top.\n    \n*   Layer on another piece of sponge cake. Pour on matcha syrup to the top level sponge cake. Add the final layer of matcha cream and dust with matcha.\n    \n\nCalories: 273Carbohydrates: 28gProtein: 8gFat: 14gSaturated Fat: 8gCholesterol: 137mgSodium: 42mgPotassium: 52mgFiber: 1gSugar: 20gVitamin A: 794IUCalcium: 45mgIron: 2mg\n\nNutrition information is automatically calculated, so should only be used as an approximation.\n\nThe Latest\n----------\n\nStarbucks Copycat Recipes\n\n### [Iced Shaken Espresso](https://www.ohhowcivilized.com/starbucks-iced-shaken-espresso/)\n\nStarbucks Copycat Recipes\n\n### [Pumpkin Spice Frappuccino](https://www.ohhowcivilized.com/starbucks-pumpkin-spice-frappuccino-copycat/)"
  },
  {
    "url": "https://coupleeatsfood.com/white-chocolate-matcha-green-tea-brownies-recipe/",
    "markdown": "# White Chocolate Matcha Brownies - Couple Eats Food\nThese soft and fudgy white chocolate matcha brownies are our latest dessert obsession! The slight bitter matcha flavor balances the sweetness of the white chocolate perfectly, which makes this sweet treat just so addictive!\n\n![Hand holding a white chocolate matcha brownie.](https://coupleeatsfood.com/wp-content/uploads/2017/07/White-Chocolate-Matcha-Brownies-3-683x1024.jpg)\n\nSoft, fudgy and moist, our favorite kind of brownie!\n\nA few years ago, we became obsessed with Matcha. That's when we developed this white chocolate matcha brownies recipe, and many other desserts. This recipe will forever reminds us of the first year of blogging when we had just started our adult life, bitter sweet, just like this brownie.\n\nWhy this White Chocolate Matcha Brownies recipe works\n-----------------------------------------------------\n\nThis white chocolate matcha brownie is very similar to the classic chocolate brownie. Except instead of chocolate chips and cocoa powder, we're using white chocolate chips and matcha powder! We absolutely love how the sweet, smooth white chocolate flavour pairs with the earthy, bitter flavour of the matcha. It just makes this dessert not to sweet and perfectly balanced! This recipe is as easy as making a regular brownie, but with an Asian twist.\n\nCheck out other matcha recipes we love!\n---------------------------------------\n\n*   [No-Bake Matcha (Green Tea) Cheesecake](https://coupleeatsfood.com/no-bake-matcha-green-tea-cheesecake/)\n*   [Matcha and Milk Japanese Fluffy Bread](https://coupleeatsfood.com/matcha-and-milk-japanese-fluffy-bread/)\n*   [Matcha (Green Tea) Panna Cotta](https://coupleeatsfood.com/matcha-green-tea-panna-cotta-recipe/)\n*   [Chewy White Chocolate Matcha Cookies](https://coupleeatsfood.com/chewy-white-chocolate-matcha-cookie/)\n*   [Green Tea (Matcha) Cake with White Chocolate Frosting](https://coupleeatsfood.com/green-tea-matcha-cake-with-white-chocolate-frosting-recipe/)\n\nTips to make the best batch\n---------------------------\n\n![Tower of 3 white chocolate matcha brownies on top of each other.](https://coupleeatsfood.com/wp-content/uploads/2017/07/White-Chocolate-Matcha-Brownies-683x1024.jpg)\n\nWhite Chocolate paired with matcha is a match made in heaven!\n\n*   Use the **best matcha** that you have on available. Some people would use culinary grade, but ceremonial grade will always end up with better taste and color. Don't forget to sift your matcha powder to avoid clumps in your batter. [This one](https://www.amazon.com/Miya-Matcha-30g-Ceremonial-Radiation/dp/B095XH6BZT?crid=WMGKTNA8L1DS&keywords=matcha+ceremonial&qid=1648046136&sprefix=matcha+ceremonial%2Caps%2C98&sr=8-4&linkCode=ll1&tag=coupleeatsfoo-20&linkId=79535668b8c154f06afe4a67e0c82a79&language=en_US&ref_=as_li_ss_tl) is great.\n*   **Beat sugar, eggs and butter** until it forms a thick and creamy consistency. This step will make your batter lighter and create fudgy, moist brownies.\n*   **Adding white chocolate** will definitely make your brownies extra fudgy and moist, so keep that in mind if you're omitting this step, or replacing with another toppings.\n*   **Do not overbake!!** Matcha has a tendency to dry out batters, and don't forget that as your brownie will rest out of the oven, it will continue to bake for a little while.\n*   **Chill your brownies** before slicing. I know it's hard and we've definitely sometimes skipped this step (patience is not my thing), but this will ensure to have clean cut brownie pieces that are so much pleasing to the eyes when serving.\n\nFAQ's\n-----\n\n**How long do these last?**\n\nYou can keep them up to 3 days in an airtight container. I would reheat them in the microwave before eating to melt the white chocolate!\n\n**Can I replace the white chocolate?**\n\nTotally! Replace it by milk chocolate, nuts or dry fruits. However, white chocolate is our favorite pairing with matcha.\n\n**Does matcha have caffeine?**\n\nYes! Less than coffee, but more than regular green tea.\n\n![Close up of 3 white chocolate matcha brownies slices on top of each other. ](https://coupleeatsfood.com/wp-content/uploads/2017/07/White-Chocolate-Matcha-Brownies-2-683x1024.jpg)\n\nMake sure to chill matcha brownies before slicing!\n\nIngredients\n-----------\n\n*   **All-purpose flour**: This ingredient is the base of our brownie!\n*   **Salted butter**: Yes, you read it right. SALTED butter. Some people would be outraged by that sentence, but yes we did. And you know what? It turned out perfect! We believed that if we did use non-salted butter, the brownies would have definitely been too sweet, or we would’ve to put in a lot of salt anyways. However, you can definitely use unsalted butter, just don't forget to add salt to balance out the sweetness.\n*   **Eggs**: For baking, we always use room temperature eggs. This ingredient is essential as it is the binding factor and adds moisture to the recipe.\n*   **Matcha Powder**: As this is the star of the recipe, use the best matcha you have on hand.\n*   **Brown sugar**: We used light brown sugar, but you can definitely use dark brown sugar. However, make sure to adjust the quantity as the latter is sweeter.\n*   **Baking powder**: For a light and soft brownie.\n*   **White chocolate chips**: We used chips, but chunks can also be used.\n\nInstructions\n------------\n\n1.  **Preheat** oven to 325 degrees Fahreinheit. **Melt the butter** in the microwave and let cool to room temperature.\n2.  In a bowl, **beat the sugar, butter and eggs together**. In another bowl, sift together flour, baking powder and matcha powder. Sifiting is key here to avoid clumps!\n3.  **Mix the dry and wet ingredient together**. Fold in the white chocolate chips and adjust quantity to taste. We love a LOT of chocolate!\n4.  Put the mixture in a square baking pan lined with parchment paper. **Bake** the brownies for 27 minutes, or until fully cooked. Do not overbake and keep in mind that as your brownie will cool it will continue baking!\n5.  **Let brownie cool**. This will make it easier to slice nice clean pieces.\n\n![Tower of white chocolate matcha brownies.](https://coupleeatsfood.com/wp-content/uploads/2022/04/White-Chocolate-Matcha-Brownies-300x300.jpg)\n\n*   1 1/2 cup all-purpose flour\n*   2/3 cup salted butter melted\n*   2 eggs\n*   1 1/2 tbsp Matcha Powder\n*   1 cup brown sugar\n*   1 tsp baking powder\n*   1 cup white chocolate chips\n\n*   Preheat oven to 325 degrees Fahreinheit. Melt the butter in the microwave and let cool to room temperature.\n    \n*   In a bowl, beat the sugar, butter and eggs together. In another bowl, sift together flour, baking powder and matcha powder.\n    \n*   Mix the dry and wet ingredient together. Mix in the white chocolate chips and adjust quantity to taste.\n    \n*   Put the mixture in a square baking pan lined with parchment paper. Bake the brownies for 27 minutes, or until fully cooked. Using a toothpick, check if the brownies are cooked thoroughly by sticking the toothpick at the center. If toothpick comes out clean, it's ready!\n    \n*   Let brownie cool for about 20 minutes before serving.  \n    \n\nCalories: 419kcal | Carbohydrates: 52g | Protein: 6g | Fat: 21g | Saturated Fat: 13g | Polyunsaturated Fat: 1g | Monounsaturated Fat: 6g | Trans Fat: 1g | Cholesterol: 77mg | Sodium: 194mg | Potassium: 130mg | Fiber: 1g | Sugar: 36g | Vitamin A: 604IU | Vitamin C: 0.1mg | Calcium: 99mg | Iron: 2mg\n\nReader Interactions\n-------------------"
  },
  {
    "url": "https://choosingchia.com/creamy-vanilla-matcha-oatmeal/",
    "markdown": "# Creamy Matcha Oatmeal - Choosing Chia\n Step up your breakfast game with this Creamy Matcha Oatmeal! Made with rolled oats or quick oats, it’s a filling and nourishing breakfast you’ll love!\n\n![matcha oatmeal in a bowl topped with bananas and matcha powder](https://choosingchia.com/jessh-jessh/uploads/2023/01/matcha-oatmeal-5-680x1020.jpg)\n\nVegan matcha oatmeal\n--------------------\n\nToday I’ve got a warm and cozy breakfast recipe for you. Creamy Matcha Oatmeal made with oats and matcha powder.\n\nI love adding matcha powder to recipes like [Matcha Energy Balls](https://choosingchia.com/matcha-energy-balls/) and [Matcha Pancakes](https://choosingchia.com/matcha-pancakes/) because it’s packed with so many incredible [health benefits](https://www.womenshealthmag.com/food/a27127259/matcha-powder-benefits/). If you love drinking a [matcha latte](https://choosingchia.com/homemade-matcha-latte/) in the morning, then you’re going to love this cozy bowl of oatmeal packed with matcha flavour.\n\nFor this oatmeal, **you can use culinary-grade matcha powder or ceremonial-grade matcha powder**. (Ceremonial grade matcha is typically more expensive and is used to make matcha tea, but if this is what you have on hand it will work too in this oatmeal.)\n\nWhy you’ll love this recipe\n---------------------------\n\n*   **Packed with matcha flavour**. If you’re someone who loves the taste of matcha then this is the breakfast for you!\n*   **Vegan and gluten-free**. This matcha oatmeal is vegan, and gluten-free (make sure to use gluten-free oats) and is packed with 5 grams of fibre and 7.5 grams of protein per serving.\n*   **Easy breakfast**. If you want a quick and easy breakfast ready in under 10 minutes this is the perfect recipe for you.\n\nMatcha Oatmeal key ingredients\n------------------------------\n\n*   **Oats**: for this recipe, you can use quick oats or rolled oats, whichever you prefer. You could also use steel-cut oats, however, just keep in mind if you do the recipe will take about 25 minutes to make.\n*   **Oat milk**: I like to use oat milk because it makes very creamy oatmeal, but you can use any type of plant-based milk.\n*   **Matcha powder**: if you have culinary-grade matcha on hand, that would be perfect to use in this recipe.\n*   **Maple syrup**: to sweeten. You can use any other type of sweetener you like.\n*   **Vanilla extract**: just a dash to flavour the oatmeal.\n\nHow to make Creamy Matcha Oatmeal\n---------------------------------\n\n### Step 1\n\nAdd the oats and matcha powder to a small pot.\n\n![oats and matcha powder in a white pot](https://choosingchia.com/jessh-jessh/uploads/2023/01/matcha-oatmeal-1-680x1020.jpg)\n\n### Step 2\n\nNext add the oat milk, maple syrup and vanilla extract and bring to a light boil on medium heat.\n\n![oat, matcha and oat milk in a white pot](https://choosingchia.com/jessh-jessh/uploads/2023/01/matcha-oatmeal-2-680x1020.jpg)\n\n### Step 3\n\nLet the oatmeal cook for 3-4 minutes on medium heat until the oatmeal has thickened to your desired texture.\n\n![matcha oatmeal in a white pot](https://choosingchia.com/jessh-jessh/uploads/2023/01/matcha-oatmeal-3-680x1020.jpg)\n\nExpert tips for making this recipe\n----------------------------------\n\n*   **Quick oats will cook in the least amount of time**, while rolled oats may take a few minutes longer to cook.\n*   **If you prefer a runnier oatmeal**, add some more water or oat milk as you cook the oats.\n*   **Top this matcha oatmeal with your favourite toppings**. I like to eat this oatmeal with bananas, coconut flakes, quinoa puffs, almond butter and a sprinkle of matcha powder.\n*   **If you’d like to make this recipe with steel-cut oats**, follow the directions of the container of oats for cooking instructions. Steel cut oats will take much longer to cook.\n\nMore oatmeal recipes to try\n---------------------------\n\n*   [Peanut Butter Oatmeal](https://choosingchia.com/peanut-butter-oatmeal/)\n*   [Protein Overnight Oats](https://choosingchia.com/protein-overnight-oats/)\n*   [Chocolate Oatmeal](https://choosingchia.com/chocolate-oatmeal/)\n*   [Banana Bread Baked Oatmeal](https://choosingchia.com/banana-bread-baked-oatmeal/)\n\n![a bowl of matcha oatmeal with tahini and bananas](https://choosingchia.com/jessh-jessh/uploads/2023/01/matcha-oatmeal-4-680x1020.jpg)\n\nIf you tried these **Creamy Matcha Oatmeal** or any other recipe on the blog let me know how you liked it by leaving a comment/rating below! Be sure to follow along on [Pinterest](https://www.pinterest.ca/choosingchia/), [Instagram](https://www.instagram.com/choosingchia/) and [Facebook](https://www.facebook.com/choosingchia) for even more deliciousness!\n\n[Print](https://choosingchia.com/creamy-vanilla-matcha-oatmeal/print/4551/)\n\n* * *\n\n### Description\n\nA delicious fluffy and creamy oatmeal packed with matcha flavour\n\n* * *\n\n*   1/2 cup oats (quick or rolled, gluten-free if needed)\n*   pinch of salt\n*   1/2 cup water\n*   1/2 cup oat milk\n*   1 tsp matcha powder\n*   1 tbsp [maple syrup](https://www.amazon.com/gp/product/B00A2N74T0/ref=as_li_qf_asin_il_tl?ie=UTF8&tag=choosingchia-20&creative=9325&linkCode=as2&creativeASIN=B00A2N74T0&linkId=48f22e7314552baaea69cdc238ceed62)\n*   1/2 tsp [vanilla extract](http://l.thrv.me/cc-simply-org-vanilla-extract)\n\nCook Mode Prevent your screen from going dark\n\n* * *\n\n1.  Add all the ingredients to a small pot on medium heat and bring to a light boil.\n2.  Cook for 3-4 minutes on medium heat until the oatmeal has reached your desired consistency. \n3.  Serve in a bowl with your favourite toppings. \n\n* * *\n\n### Notes\n\nQuick oats will give the oatmeal a fluffier texture, and rolled oats will give it a chewier texture. \n\n* * *\n\n### Nutrition\n\n*   **Serving Size:** 1 bowl\n*   **Calories:** 270\n*   **Sugar:** 14g\n*   **Fat:** 4g\n*   **Saturated Fat:** 7g\n*   **Carbohydrates:** 51g\n*   **Fiber:** 5g\n*   **Protein:** 7.5g\n\nThis post contains affiliate links which means I will make a small commission if you purchase through those links. I only recommend products that I know, trust and love!"
  },
  {
    "url": "https://flavorthemoments.com/matcha-coconut-chia-overnight-oats/",
    "markdown": "# Matcha Coconut Chia Overnight Oats - Flavor the Moments\n_by_ [Marcie](https://flavorthemoments.com/about/) // May 20, 2019 _(updated 3/27/23)_\n\nThis post may contain affiliate links. I receive a small commission at no cost to you when you make a purchase using our links. Please see my [privacy policy](https://flavorthemoments.com/about/privacy-policy/) for more details.\n\n**Matcha overnight oats** are an easy meal prep breakfast recipe with matcha green tea, coconut and chia seeds.  They’re a delicious vegan and gluten free breakfast!\n\n![jar of matcha overnight oats with coconut on top a spoon with green tea](https://flavorthemoments.com/wp-content/uploads/2019/05/matcha-coconut-chia-overnight-oats-2-600x857.jpg)\n\nI’ve always enjoyed green tea, but in the past several months I just can’t seem to get enough of it.  What are your feelings about matcha?\n\nAs most of you know, I’m a huge coffee lover, but I love matcha green tea. Iced coconut matcha lattes have become one of my favorite summer sippers!\n\nI prep overnight oats for breakfast often. One day I decided to change up my [blueberry overnight oats](https://flavorthemoments.com/blueberry-chia-overnight-oats/) and add matcha powder to them. \n\nNeedless to say, it was a hit!\n\nTable of contents\n-----------------\n\n*   [What are overnight oats?](#h-what-are-overnight-oats)\n*   [How to make this recipe](#h-how-to-make-this-recipe)\n*   [Do you eat overnight oats warm or cold?](#h-do-you-eat-overnight-oats-warm-or-cold)\n*   [Recipe notes](#h-recipe-notes)\n*   [More overnight oats recipes:](#h-more-overnight-oats-recipes)\n\n![matcha overnight oats in a jar with coconut on top](https://flavorthemoments.com/wp-content/uploads/2019/05/matcha-coconut-chia-overnight-oats-1-600x829.jpg)\n\nI went live on Instagram a few weeks ago after I made my second batch of these matcha overnight oats, and took a poll asking if people wanted the recipe.  70% said yes, so here ya go!\n\nThese oats are creamy and satisfying, and green tea and coconut milk are truly a **matcha** made in heaven. 🙂\n\nMatcha green tea powder has a bitter flavor on its own, but it works perfectly in this recipe with the richness of coconut milk and just enough maple syrup to balance the flavors.\n\nI love preparing my overnight oats with coconut milk because of the richness that it adds. Coconut milk makes for the creamiest overnight oats!  I’ve also added unsweetened shredded coconut in this recipe for even more coconut flavor and added texture.\n\nI always prepare my overnight oats with chia seeds because they help thicken the oats, and they add even more nutrition.\n\n![overhead shot of matcha overnight oats with coconut flakes](https://flavorthemoments.com/wp-content/uploads/2019/05/matcha-coconut-chia-overnight-oats-4-2-600x899.jpg)\n\nWhat are overnight oats?\n------------------------\n\nOvernight oats are old fashioned rolled oats soaked in liquid overnight.  The oats absorb the liquid, which results in a soft, creamy texture.\n\n**Steel cut oats may also be used — check out my [overnight steel cut oats](https://flavorthemoments.com/banana-cream-pie-chia-overnight-steel-cut-oats/).**\n\nHow to make this recipe\n-----------------------\n\nThe glory of overnight oats recipes is that there’s no cooking involved.  It literally takes **5 minutes** to prep this recipe!\n\n*   Place the oats, chia seeds, matcha powder, shredded coconut, coconut milk and maple syrup in a medium bowl and stir until combined.  \n*   Cover and chill overnight until the oats are soft and creamy.\n*   Stir the overnight oats before serving, and top with coconut flakes, sliced almonds, or your favorite fresh fruit.\n\n![matcha overnight oats collage](https://flavorthemoments.com/wp-content/uploads/2019/05/matcha-coconut-chia-overnight-oats-process-collage-600x400.jpg)\n\nDo you eat overnight oats warm or cold?\n---------------------------------------\n\nOvernight oats may be eaten warm or cold.  I normally eat mine cold, but my boys prefer them warm. \n\nIf you enjoy yours warm, simply microwave for 30-45 seconds, stir and enjoy!\n\nRecipe notes\n------------\n\n*   Use coconut milk and gluten free oats to make these overnight oats vegan and gluten-free.\n*   I used refrigerated coconut milk such as So Delicious, but you may also used full fat or light canned coconut milk.\n*   If you wish to omit the chia seeds, decrease the amount of coconut milk by 1/2 cup (2 cups total).\n*   Oats are a great meal prep breakfast!  Portion into jars and enjoy your overnight oats for up to 4 days.\n\n![matcha overnight oats in a jar with coconut on top and spoon](https://flavorthemoments.com/wp-content/uploads/2019/05/matcha-coconut-chia-overnight-oats-3-600x852.jpg)\n\nMore overnight oats recipes:\n----------------------------\n\n*   [Best overnight oats – 8 ways](https://lifemadesweeter.com/overnight-oats-8-ways/) by Life Made Sweeter\n*   [Blueberry overnight oats](https://flavorthemoments.com/blueberry-chia-overnight-oats/)\n*   [Chai spiced overnight oats](https://flavorthemoments.com/chai-spiced-chia-overnight-oats/)\n*   [Cherry overnight oats](https://flavorthemoments.com/cherry-pie-chia-overnight-oats/)\n*   [Coconut overnight oats](https://flavorthemoments.com/coconut-cream-pie-chia-overnight-oats/)\n*   [Peanut butter banana overnight oats](https://flavorthemoments.com/peanut-butter-banana-chocolate-chip-chia-overnight-oats/)\n*   [Pumpkin overnight oats](https://flavorthemoments.com/pumpkin-chia-overnight-oats/)\n\n**Did you try this recipe?**  If so, be sure to [leave a review below](#respond) and tag me **@flavorthemoments** on Facebook and Instagram\n\nMatcha Coconut Chia Overnight Oats\n----------------------------------\n\nServings: 6 servings\n\nPrep Time: 10 minutes\n\nCook Time: 0 minutes\n\nAdditional Time: 4 hours\n\nTotal Time: 4 hours 10 minutes\n\nMatcha overnight oats are creamy, no cook oats with the goodness of matcha green tea, coconut and chia seeds.  They’re a delicious, gluten-free and vegan meal prep breakfast!\n\n*   2 cups old fashioned rolled oats\n*   1/3 cup unsweetened shredded coconut\n*   2 tablespoons [chia seeds](https://www.amazon.com/Navitas-Organics-Chia-Seeds-oz/dp/B004IWYB0Q?crid=1HVMLJS0Y34GA&keywords=chia+seeds&qid=1644427563&rdc=1&sprefix=chia+seeds%2Caps%2C153&sr=8-3-spons&psc=1&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUExVDQ2RTYwUkRDT0pJJmVuY3J5cHRlZElkPUEwMjc4ODc3MjI4R0RWQURLSE1IWiZlbmNyeXB0ZWRBZElkPUEwNTY5OTI5WDA1RVdaUU9NSEZaJndpZGdldE5hbWU9c3BfYXRmJmFjdGlvbj1jbGlja1JlZGlyZWN0JmRvTm90TG9nQ2xpY2s9dHJ1ZQ%3D%3D&linkCode=ll1&tag=marciebidoufl-20&linkId=5a5c26f7f81b19655d2f79c47be57a8f&language=en_US&ref_=as_li_ss_tl)\n*   1 1/2 teaspoons matcha green tea powder\n*   2 1/2 cups unsweetened coconut milk I use refrigerated coconut milk such as So Delicious or Silk\n*   3 tablespoons pure maple syrup\n*   optional garnishes: unsweetened raw coconut flakes fresh fruit or nuts\n\n*   Place the oats, coconut, chia seeds and matcha in a medium bowl. Add the coconut milk and maple syrup, and stir well to combine.\n    \n*   Cover and chill up to 6 hours or overnight.\n    \n*   In the morning, stir well and serve with additional unsweetened raw coconut flakes, nuts or fresh fruit. Enjoy!\n    \n\n*   Use coconut milk and gluten free oats to make these overnight oats vegan and gluten-free.\n*   I used refrigerated coconut milk such as So Delicious, but you may also used full fat or light canned coconut milk.\n*   If you wish to omit the chia seeds, decrease the amount of coconut milk by 1/2 cup (2 cups total).\n*   Oats are a great meal prep breakfast! Portion into jars and enjoy your overnight oats for up to 4 days.\n*   I prefer my oats cold, but they may be heated for 30-40 seconds in the microwave before you enjoy them if you prefer them warm.\n\nServing: 1g, Calories: 272kcal, Carbohydrates: 29g, Protein: 5g, Fat: 16g, Saturated Fat: 12g, Polyunsaturated Fat: 3g, Sodium: 15mg, Fiber: 5g, Sugar: 7g\n\nNutrition is estimated using a food database and is only intended to be used as a guideline for informational purposes.\n\nCourse: Breakfast\n\nCuisine: American\n\nAll recipes and images © Flavor the Moments.\n\nGet _new recipes_ in your inbox each week!"
  },
  {
    "url": "https://realfoodcamping.com/iced-pineapple-coconut-matcha-tea/",
    "markdown": "# Iced Pineapple Coconut Matcha Tea - Real Food Camping\n![Iced Pineapple Coconut Matcha Tea drink](https://i0.wp.com/realfoodcamping.com/wp-content/uploads/2020/03/Pinterest_Matcha-Tea_3.jpg?resize=342%2C512&ssl=1)\n\nGood morning friends! I hope you all are staying healthy! The official start of spring is just a few days away and I for one could not be more excited. With all the craziness going on right now I think we all could use something to look forward too.\n\nAs the weather (hopefully) gets warmer, I’m often looking for something refreshing and healthy to drink. While a lot of restaurants have new spring drinks, I don’t always want to go out and buy something, especially if I’m hanging out at the campground. That’s where this homemade Iced Pineapple Coconut Matcha Tea became my mission. This spring drink only has a few grams of sugar from pure pineapple juice and is something I can enjoy at home while we are stuck inside over the next few weeks.\n\n_A quick note, this post contains affiliate links. I receive a small commission when you make a purchase through these links which enables me to keep making delicious recipes to share with you! Thank you for supporting me!_\n\n![Two mason jar glasses of iced coconut pineapple matcha drink ](https://i0.wp.com/realfoodcamping.com/wp-content/uploads/2020/03/Matcha-Latte_edit.jpg?resize=342%2C512&ssl=1)\n\nThis is a refreshing and delicious spring drink\n\nFor Iced Coconut Pineapple Matcha Tea You’ll Need\n-------------------------------------------------\n\nThese iced coconut pineapple matcha drinks are so easy to make. I mixed mine in a blender to make it simple but you can easily just shake it with a protein shaker. The matcha doesn’t mix in as easily if shaken but it does dissolve so don’t get discouraged.\n\nYou’ll need:\n\n*   [Jade Leaf Matcha](https://www.amazon.com/gp/product/B00PFDH0K0/ref=as_li_tl?ie=UTF8&tag=realfoodcampi-20&camp=1789&creative=9325&linkCode=as2&creativeASIN=B00PFDH0K0&linkId=4e1437cd838183c7c3eaadeb9fc1a24f) Powder\n*   Unsweetened Coconut Milk\n*   100% Pure Pineapple Juice\n*   Ground Ginger\n*   [Pyure Organic](https://www.amazon.com/gp/product/B078WFLVQ2/ref=as_li_tl?ie=UTF8&tag=realfoodcampi-20&camp=1789&creative=9325&linkCode=as2&creativeASIN=B078WFLVQ2&linkId=4c233a5d8487afa34c05da2eb7bcbd9f) or your favorite sweetener (optional)\n\nIt’s so easy!\n-------------\n\nTo make, just pour coconut milk, pineapple juice, matcha powder and ginger into your blender cup. If you prefer it a little sweeter, feel free to add your choice of sweetener, but I don’t think you will need much.\n\nMix until fully combined.\n\nPour over ice and enjoy! I loved how perfectly it fit in these [pint size Ball](https://www.amazon.com/gp/product/B00RNFSYVC/ref=as_li_tl?ie=UTF8&tag=realfoodcampi-20&camp=1789&creative=9325&linkCode=as2&creativeASIN=B00RNFSYVC&linkId=04615cb4522b77d5bef3c1ee18f97354) jars with these [Ball lids and straws](https://www.amazon.com/gp/product/B01MYTSOAK/ref=as_li_tl?ie=UTF8&tag=realfoodcampi-20&camp=1789&creative=9325&linkCode=as2&creativeASIN=B01MYTSOAK&linkId=9a5c466624ad8e5bdc26fec8b6d52848)!\n\nSee how easy that was? I love how simple this recipe is and so refreshing. It also doesn’t leave me with a sugar crash after I drink it. The coconut and pineapple really work well together to create a refreshing and tropical base for the matcha in this drink.\n\n![Mason jar glass of pineapple matcha tea drink on ice](https://i0.wp.com/realfoodcamping.com/wp-content/uploads/2020/03/Matcha-Latte_edit-4.jpg?resize=342%2C512&ssl=1)\n\nHappy Camping,\n\n\\-Jess\n\n![](https://i0.wp.com/realfoodcamping.com/wp-content/uploads/2020/03/Matcha-Latte_edit-4.jpg?fit=167%2C250&ssl=1)\n\nIced Pineapple Coconut Matcha Tea\n---------------------------------\n\nPrep Time 5 minutes\n\nCook Time 0 minutes\n\nTotal Time 5 minutes\n\n*   ½ tsp Jade Leaf Matcha Powder\n*   8 ounces Unsweetened Coconut Milk\n*   ⅛ tsp Ground Ginger\n*   3 Tbsp 100% Pineapple Juice\n*   ½ – 1 tsp Pyure Organic Stevia Blend or Your Favorite Sweetener (optional)\n\n*   Put all ingredients into a blender cup or protein shaker and mix until fully combined\n    \n*   Pour over ice and enjoy!\n    \n\nKeyword Beverage, Dairy Free, Drinks, Keto, Low Carb, Paleo, Spring Recipes\n\nIf you loved this recipe check out some of these others:\n\n*   [Tropical Coconut Pineapple Fizz](https://realfoodcamping.com/tropical-coconut-pineapple-fizz/)\n    \n    Today is the first day of Summer and to celebrate I’m sharing one of my favorite refreshing drinks. This blended Tropical Coconut Pineapple Fizz recipe will be a hit with adults and kids alike! I love to make up a big batch of these while \\[…\\]\n    \n*   [Creamy Dill Veggie Dip](https://realfoodcamping.com/creamy-dill-veggie-dip/)\n    \n    What You’ll Need To make this Creamy Dill Veggie Dip you just need a few ingredients: Sour Cream Mayonnaise Tabasco Sauce Worcestershire Sauce Dried Dill Onion Powder Salt How to Make Creamy Dill Veggie Dip Add all of the ingredients to a medium sized bowl. \\[…\\]\n    \n*   [Bacon Wrapped Asparagus](https://realfoodcamping.com/bacon-wrapped-asparagus/)\n    \n    I love grilled veggies. All summer long I throw random vegetables on the grill to see how they turn out. What’s better than grilled veggies you might ask? Grilled veggies wrapped in bacon! Because bacon just makes all things better (IMO)! These bacon wrapped asparagus \\[…\\]"
  },
  {
    "url": "https://sassmagazine.com/iced-lavender-mint-matcha-latte-recipe/",
    "markdown": "Failed to convert"
  },
  {
    "url": "https://www.darngoodveggies.com/lavender-matcha-latte-dairy-free-paleo/",
    "markdown": "# Lavender Matcha Latte (Dairy-free + Paleo) - Darn Good Veggies\nThis Lavender Matcha Latte is infused with lavender for spring flavor! This 10 minute drink couldn't be any easier to make and you'll love that it's naturally sweetened with honey and is also dairy-free.\n\n![This Lavender Matcha Latte is infused with lavender for spring flavor! This 10 minute drink couldn't be any easier to make and you'll love that it's naturally sweetened with honey and is also dairy-free. | CatchingSeeds.com](https://www.darngoodveggies.com/wp-content/uploads/2018/06/IMG_2701.jpg)\n\nMy parents had an espresso machine when I was growing up. I used to make myself a latte every morning in high school. I had a stash of paper cups, would jump for joy when I pulled the perfect espresso shot, and turned the top of our fridge into a syrup gallery worthy of a coffee house.\n\nMy name is Laurel and I was coffees biggest fan.\n\nThen this green powder called [matcha](https://www.darngoodveggies.com/?s=matcha) walked into my life. It was bitter. It was earthy. I was verrrry skeptical, but after learning about the mega health benefits and how to brew the perfect cup at home, I was _full on_ hooked.\n\nI loved the flavor. Loved the color. And I loved the way it made me feel. Matcha gave me less of a caffeine spike and more steady energy. It was jitters and more focus. I have been drinking a cup of matcha almost daily for years.\n\n![This Lavender Matcha Latte is infused with lavender for spring flavor! This 10 minute drink couldn't be any easier to make and you'll love that it's naturally sweetened with honey and is also dairy-free. | CatchingSeeds.com](https://www.darngoodveggies.com/wp-content/uploads/2018/06/IMG_2756-683x1024.jpg)\n\nMy usual morning matcha is closer to [this recipe](https://www.darngoodveggies.com/honey-coconut-matcha-latte/), but with spring in the air, I had the itch to switch up my normal cup in favor of this Lavender Matcha Latte version.\n\nNow, if you think lavender is only for soap, I will be so bold as to say that this Lavender Matcha Latte will change your mind. The lavender adds a soft floral kiss to the earthy matcha in a way that makes tastebuds jump for joy!\n\nThink more hibiscus, rose, or camomile tea (all flowers!) and less like the bar of soap on your counter.\n\n\\[one-half-first\\]![This Lavender Matcha Latte is infused with lavender for spring flavor! This 10 minute drink couldn't be any easier to make and you'll love that it's naturally sweetened with honey and is also dairy-free. | CatchingSeeds.com](https://www.darngoodveggies.com/wp-content/uploads/2018/06/IMG_2630-683x1024.jpg)\\[/one-half-first\\]  \n\\[one-half\\]![This Lavender Matcha Latte is infused with lavender for spring flavor! This 10 minute drink couldn't be any easier to make and you'll love that it's naturally sweetened with honey and is also dairy-free. | CatchingSeeds.com](https://www.darngoodveggies.com/wp-content/uploads/2018/06/IMG_2598-683x1024.jpg)\\[/one-half\\]\n\nAlso! Try this iced! I think there are two people in this world, those who like their drinks hot even in the heat of summer and those who like their drinks iced, even in the cold of winter.\n\nI fall in the hot group all year round, but even this hot drink lover can vouch that this Lavender Matcha Latte makes one mean iced drink.\n\nIf you're new to matcha, you may even want to try this Lavender Matcha Latte iced first. The iced version is a bit more mild in flavor and tames some of the matcha bitter/earthy flavors that can take some getting used to.\n\n![This Lavender Matcha Latte is infused with lavender for spring flavor! This 10 minute drink couldn't be any easier to make and you'll love that it's naturally sweetened with honey and is also dairy-free. | CatchingSeeds.com](https://www.darngoodveggies.com/wp-content/uploads/2018/06/IMG_2745.jpg)\n\n[Print](https://www.darngoodveggies.com/lavender-matcha-latte-dairy-free-paleo/print/7198/)\n\n* * *\n\n*   2 teaspoons dried lavender\n*   ¼ cup boiling water\n*   2\\-3 tablespoons honey (more for a sweeter latte)\n*   2 rounded teaspoons matcha\n*   2 cups coconut or almond milk\n\nCook Mode Prevent your screen from going dark\n\n* * *\n\n1.  Add the dried lavender and boiling water into a bowl and let it steep for 5 minutes. Strain out the lavender and add the honey and matcha to the water and whisk with a bamboo whisk until the matcha is smooth and clump free.\n2.  Heat the milk in a saucepan on the stove until it begins to steam. Remove from the heat and pour into the matcha mixture. Mix well and divide between two cups. Serve topped with extra lavender, if desired.\n\n* * *\n\n* * *\n\n### Nutrition\n\n*   **Serving Size:** 0\n*   **Sugar:** 0\n*   **Sodium:** 0\n*   **Fat:** 0\n*   **Saturated Fat:** 0\n*   **Trans Fat:** 0\n*   **Carbohydrates:** 0\n*   **Fiber:** 0\n*   **Protein:** 0\n*   **Cholesterol:** 0\n\n![This Lavender Matcha Latte is infused with lavender for spring flavor! This 10 minute drink couldn't be any easier to make and you'll love that it's naturally sweetened with honey and is also dairy-free. | CatchingSeeds.com](https://www.darngoodveggies.com/wp-content/uploads/2018/06/Lavender-Matcha-Latte-01-01-410x1024.png)\n\nReader Interactions\n-------------------"
  },
  {
    "url": "https://teakandthyme.com/strawberry-matcha-latte/",
    "markdown": "# Strawberry Matcha Latte - Teak & Thyme\n_Iced matcha oat milk latte topped with blended strawberry sweet cream makes for a fruity twist on your favourite matcha latte_\n\nThis strawberry matcha latte might be the prettiest matcha drink I've ever made with its two-tone green and pink layers. I could never say no to a pink matcha latte. So. Cute.\n\nI've seen this drink being ordered at Starbucks (if you're interested, order an \"iced matcha latte with sweet cream and strawberry puree blended into the sweet cream\") and it looks simply beautiful. If you love any kind of matcha drink, this is how to make something similar at home.\n\n![Strawberry matcha latte with green and pink layers in a glass](https://teakandthyme.com/wp-content/uploads/2021/04/strawberry-matcha-latte-DSC_7098-2048.jpg)\n\nIngredients and substitutions\n-----------------------------\n\n*   **Matcha** - I always, always suggest using ceremonial grade matcha powder in _drinks_. You _can_ use culinary grade matcha powder but it is less concentrated and the flavour and colour is completely different. Ceremonial grade matcha is deep, vivid green in colour and much more aromatic and naturally fresher and sweeter in taste.\n*   **Milk** - You can use dairy milk, plant-based milks, or nut milks. My personal preference is oat milk because it's slightly thicker and slightly naturally sweet which makes a creamy latte and the flavour goes so well with matcha.\n*   **Sweetener** - Liquid sweeteners like agave nectar, honey, and simple syrup work best with matcha because they mix together easily. You can definitely also use granulated sugar but just make sure it dissolves thoroughly. Adjust the sweetness level to your tastes.\n*   **Strawberries** - You can use fresh or frozen strawberries - both work perfectly. If using frozen, let them thaw in the fridge overnight or at room temperature for 30 mins to 1 hour before blending.\n*   **Heavy cream** - The heavy cream in the strawberry sweet cream really makes a difference in the consistency of the cream. The addition of the extra bit of regular milk prevents it from turning into whipped cream when blended. For a plant-based alternative, you can use canned coconut milk or regular plant-based milk and froth it well in the blender.\n\nHow to make a strawberry matcha latte\n-------------------------------------\n\nIn a small bowl, sift in matcha powder. Pour in hot water and whisk vigorously with a bamboo whisk or milk frother until slightly foamy on top. Stir in your sweetener while it's still warm.\n\n![pouring hot water in bowl of matcha powder](https://teakandthyme.com/wp-content/uploads/2021/04/strawberry-matcha-latte-process-1.jpg)\n\nFill a glass about ¾ full with ice. Pour in milk and matcha. Stir to combine.\n\n![Pouring matcha into oat milk and stirring together](https://teakandthyme.com/wp-content/uploads/2021/04/strawberry-matcha-latte-process-2.jpg)\n\nIn a small bullet blender, blend together strawberries, heavy cream, milk, and sweetener for 5-10 seconds until the consistency resembles melted ice cream.\n\n![strawberries in a blender cup with heavy cream and milk](https://teakandthyme.com/wp-content/uploads/2021/04/strawberry-matcha-latte-process-3.jpg)\n\nPour on top of the matcha latte and give it a gentle stir to blend the layers into a gradient.\n\n![Pouring strawberry sweet cream on top of matcha latte](https://teakandthyme.com/wp-content/uploads/2021/04/strawberry-matcha-latte-process-4.jpg)\n\nOther matcha recipes to try\n---------------------------\n\n*   [Whipped Matcha Latte](https://teakandthyme.com/whipped-matcha-latte/)\n*   [Matcha Cream Puffs](https://teakandthyme.com/matcha-cream-puffs/)\n*   [Matcha Mille Crepe Cake](https://teakandthyme.com/matcha-mille-crepe-cake/)\n*   [Matcha White Chocolate Cookies](https://teakandthyme.com/matcha-white-chocolate-cookies/)\n*   [No-Bake Matcha Cheesecake](https://teakandthyme.com/no-bake-matcha-cheesecake/)\n*   [Matcha Strawberry Cake](https://teakandthyme.com/matcha-strawberry-cake/)\n\nRecipe\n------\n\n![Strawberry matcha latte with green and pink layers in a glass](https://teakandthyme.com/wp-content/uploads/2022/08/strawberry-matcha-latte-DSC_7098-1x1-1200-180x180.jpg)\n\nIced matcha latte topped with blended strawberry sweet cream\n\nPrep Time 5 minutes\n\nTotal Time 5 minutes\n\nYield 1 16oz glass\n\nCategory Drinks\n\nCuisine Japanese\n\n#### Matcha Latte\n\n*   ▢ 1 teaspoon matcha powder, ceremonial grade\n*   ▢ 2 oz hot water\n*   ▢ 1 teaspoon liquid sweetener, e.g. agave nectar\n*   ▢ 5 oz milk, dairy or plant-based (I prefer oat milk)\n*   ▢ ice\n\n#### Strawberry Sweet Cream\n\n*   ▢ 2-3 medium strawberries\n*   ▢ 2 oz heavy cream\n*   ▢ 1 oz milk\n*   ▢ 1 teaspoon sweetener\n\n#### Matcha Latte\n\n*   In a small bowl, sift in matcha powder. Pour in hot water and whisk vigorously with a bamboo whisk or milk frother until dissolved and slightly foamy on top. Stir in your sweetener while it's still warm.\n    \n*   Fill a glass about ¾ full with ice. Pour in milk and matcha. Stir to combine.\n    \n\n#### Strawberry Sweet Cream\n\n*   In a small bullet blender, blend together strawberries, heavy cream, milk, and sweetener for 5-10 seconds until the consistency resembles melted ice cream.\n    \n*   Pour on top of the matcha latte and give it a gentle stir to blend the layers into a gradient.\n    \n\nCalories: 367kcal | Carbohydrates: 26g | Protein: 10g | Fat: 28g | Saturated Fat: 17g | Polyunsaturated Fat: 1g | Monounsaturated Fat: 8g | Cholesterol: 98mg | Sodium: 110mg | Potassium: 342mg | Fiber: 1g | Sugar: 18g | Vitamin A: 1358IU | Vitamin C: 14mg | Calcium: 267mg | Iron: 1mg\n\nKeywords pink matcha latte, strawberry matcha drink, strawberry matcha latte, strawberry matcha latte recipe\n\n[Leave a rating & comment](#comment) to let us know how it was and tag your Instagram posts with @teakandthyme!\n\nReader Interactions\n-------------------"
  },
  {
    "url": "https://www.proportionalplate.com/dalgona-matcha-latte/",
    "markdown": "# Dalgona Matcha Latte - Proportional Plate\nThis Dalgona Matcha Latte recipe is a sweet latte topped with whipped matcha foam – it’s delicious and it looks gorgeous! While a matcha latte is a sweet, creamy, comforting drink, sometimes though, you want to step it up a little. Give it some flair. That’s where this incredible Dalgona Matcha Latte comes in.\n\n![A glass mug filled half way with coconut milk and topped with matcha foam.](https://www.proportionalplate.com/wp-content/uploads/2020/04/Dalgona-Whipped-Matcha-1-683x1024.jpg)\n\nDalgona coffee recipes have taken the internet by storm and inspired people to get creative with their at-home beverages. The name Dalgona is the South Korean word for a type of honeycomb candy.\n\nDalgona coffee is a whipped coffee drink made by combining instant coffee granules, sugar, and water. You whip them together until it has a whipped cream or meringue-type consistency. Then, serve hot or cold with warm milk and you’ll have a barista-style coffee drink.\n\nMy take on the Dalgona trend is a beautiful Dalgona Matcha Latte, which is made the same way but with some different ingredients. You create the matcha froth by combining egg white (or aquafaba if you like), sugar, and matcha powder.\n\n**Note:** You don’t need the extra froth to assist from the egg white (or aquafaba) when making Dalgona coffee since there is gluten in instant coffee.\n\nHow to Make a Dalgona Matcha Latte\n----------------------------------\n\nTo make this frothy matcha treat, you will need the following:\n\n![Egg whites, matcha, and sugar in small bowls on a marble countertop.](https://www.proportionalplate.com/wp-content/uploads/2020/04/Dalgona-Whipped-Matcha-Ingredients-683x1024.jpg)\n\nTake your egg white (or aquafaba) in a bowl and whip the egg white until it is frothy and has mostly a stiff, white texture. You can use a [whisk](https://amzn.to/2RbUZ97), a [hand mixer](https://amzn.to/2RcGEJA), or a [handheld frother](https://amzn.to/2wfsbFq). A whisk may take a little longer to get the egg white to the right consistency!\n\n![Hands whisking egg whites in a white bowl.](https://www.proportionalplate.com/wp-content/uploads/2020/04/Step-by-Step-3-Egg-Whites.jpg)\n\nAdd in the sugar and continue to whip until stiff peaks form and it sticks to your whisk. See the image for a good example of stiff peak consistency.\n\n![A hand whisking egg whites and sugar to a cream in a bowl.](https://www.proportionalplate.com/wp-content/uploads/2020/04/Step-by-Step-Egg-Whites-Soft-Peaks.jpg)\n\nSift in the [matcha powder](https://amzn.to/3IhIEdA) (culinary grade), and thoroughly whisk it into the mixture until fully incorporated.\n\n![Sifting matcha and then whipping matcha and egg whites in a bowl.](https://www.proportionalplate.com/wp-content/uploads/2020/04/Step-by-Step-Whipped-Matcha.jpg)\n\nAdd your chosen milk, dairy or non-dairy, to a cup. Top the milk with the whipped Dalgona Matcha. Sip, savor and enjoy!\n\nWhat Can I Add to Customize My Dalgona Latte?\n---------------------------------------------\n\nCustomize and invent your version of this latte with things like:\n\n*   a pinch of cinnamon or nutmeg powder\n*   edible essential oils like rose or lavender\n*   a slice of citrus fruit like orange\n\nHow Long Does it Take to Make Whipped Matcha?\n---------------------------------------------\n\nIt only takes 10 minutes to whip up a frothy matcha cream. It’s quick, easy, and well worth the extra little bit of time to elevate your matcha.\n\nWhat is Aquafaba?\n-----------------\n\nA very popular ingredient in vegan cuisine, aquafaba is the thick liquid that is produced after soaking legumes (like chickpeas, beans, lentils, etc.) It’s a great substitute for egg whites in many recipes.\n\nIs it Safe to Eat Uncooked Egg White?\n-------------------------------------\n\nEating any part of an egg raw can present a health and safety problem, as raw eggs do carry bacteria. If you’d rather not take the risk, buying eggs that have been pasteurized (look out for that on the label) or liquid egg whites in a carton, as these are always pasteurized, is a good compromise.\n\nMore Matcha Recipes\n-------------------\n\nLooking for more matcha? Check out [ALL my favorite matcha desserts](https://www.proportionalplate.com/best-matcha-dessert-recipes/) here or try these amazing recipes.\n\nOr if you’re looking for something refreshing, you can find [my favorite drinks here](https://www.proportionalplate.com/category/recipes/beverages/).\n\n![A creamy green whipped topping on a metal whisk.](https://www.proportionalplate.com/wp-content/uploads/2020/04/Dalgona-Whipped-Matcha-0-683x1024.jpg)\n\n![](https://www.proportionalplate.com/wp-content/uploads/2020/04/Dalgona-Whipped-Matcha-1-200x300.jpg)\n\nDalgona Matcha Latte\n--------------------\n\n[Print Recipe](https://www.proportionalplate.com/wprm_print/dalgona-matcha-latte) [Save](https://app.grow.me/)\n\nThis Dalgona Matcha Latte recipe is a sweet latte topped with whipped matcha foam – it's delicious and it looks gorgeous!\n\nPrep Time10 minutes\n\nCook Time0 minutes\n\n0 minutes\n\nTotal Time10 minutes\n\nCourse: Drinks\n\nCuisine: Japanese, Korean\n\nServings: 1\n\nCalories: 269kcal\n\n*   ▢\n\n*   ▢ 1 egg white or 2 tbsp aquafaba (aka chickpea liquid)\n*   ▢ 1 tbsp sugar granulated white, turbinado, or cane\n*   ▢ 1 tsp [matcha powder](https://www.amazon.com/dp/B09CFSVW32?ref=t_ac_view_request_product_image&campaignId=amzn1.campaign.2FDRI11ANER2B&linkCode=tr1&tag=proportionalp-20&linkId=amzn1.campaign.2FDRI11ANER2B_1701904638265) culinary grade\n*   ▢ 1 cup milk I used coconut milk, but any kind works\n\n*   Whip the egg white (or aquafaba) until it is frothy and mostly stiff with a whisk, hand mixer, or handheld frother. Add the sugar and whip until stiff peaks form and it sticks to your whisk.\n    \n*   Sift in the matcha powder. Whisk it in until incorporated.\n    \n*   Add the milk to a cup. Top with the whipped matcha and enjoy!\n    \n\nDo not add the matcha powder until instructed or the egg whites will not properly whip. The tea leaves will weigh the mixture down too much to froth properly.\n\nSugar: this recipe works best with fine, granulated sugar. But it also works with many other sugars. Make sure the egg white/aquafaba is stiff before adding the sugar, especially if using a heavy sugar like coconut sugar.\n\nAquafaba is the liquid left when you strain chickpeas from a can. \n\nEating any part of an egg raw can present a health and safety problem, as raw eggs do carry bacteria. If you’d rather not take the risk, buying eggs that have been pasteurized (look out for that on the label) or liquid egg whites in a carton, as these are always pasteurized, is a good compromise.\n\nYou don’t need the extra froth assist from the egg white (or aquafaba) when making Dalgona coffee since there is gluten in instant coffee.\n\nWhen using aquafaba, adding 1/4 tsp cream of tartar will get you firmer peaks in your mixture. It works great with and without, but if you prefer stiffer peaks, add the cream of tartar.\n\nCalories: 269kcal | Carbohydrates: 36g | Protein: 13g | Fat: 8g | Saturated Fat: 5g | Cholesterol: 24mg | Sodium: 155mg | Potassium: 371mg | Sugar: 36g | Vitamin A: 595IU | Calcium: 276mg | Iron: 1mg\n\nI’d love to hear what you think! [Leave a Review](#) to let us know how it came out, if you have a successful substitution or variation, or anything else."
  },
  {
    "url": "https://www.howsweeteats.com/2017/01/matcha-honey-hot-chocolate-toasted-marshmallows/",
    "markdown": "# Matcha Honey Hot Chocolate with Toasted Marshmallows. - How Sweet Eats\nThis might get me on the right track to consuming more green.\n\n![matcha honey hot chocolate with toasted marshmallows I howsweeteats.com ](https://www.howsweeteats.com/wp-content/uploads/2017/01/matcha-hot-chocolate-I-howsweeteats.com-6.jpg)\n\nI feel like it’s inappropriate for me to even share a recipe containing matcha since I barely know how to pronounce it. I mean, I KNOW how to pronounce it. But I always want to pronounce it as “maaaaahtcha,” like “I need to light a match” instead of “m-awe-tcha,” like “oh this is so AWEsome.”\n\nSort of also like how I say keee-no-waah when I offer Eddie quinoa for dinner. It’s become such an annoying staple that I often forget the correct pronunciation.\n\nOr! Or. I can’t help but say that I’m having an “ah-kai” bowl instead of “awe-sigh-eeee” bowl. When I’m making an acai bowl.\n\nSo really, should I even be allowed to share a matcha re?!\n\n![matcha honey hot chocolate with toasted marshmallows I howsweeteats.com ](http://www.howsweeteats.com/wp-content/uploads/2017/01/matcha-hot-chocolate-I-howsweeteats.com-2.jpg)\n\nHere’s the thing. It took me awhile to get on the matcha bandwagon because I think that tea tastes like dirty water. Coffee also sort of tastes like dirty water, but if you add sugar and cream to coffee, it tastes like ice cream. If you add sugar and cream to tea, it tastes like sugary dirty water.\n\nFact.\n\n![matcha honey hot chocolate with toasted marshmallows I howsweeteats.com ](http://www.howsweeteats.com/wp-content/uploads/2017/01/matcha-hot-chocolate-I-howsweeteats.com-3.jpg)\n\nThe first time I had matcha, it was very much a combination of dirty water and green grass. I’m not sure if this green grass added something wonderful or terrible, but when I added sugar… I LIKED IT.\n\nI actually liked it.\n\n![matcha honey hot chocolate with toasted marshmallows I howsweeteats.com ](http://www.howsweeteats.com/wp-content/uploads/2017/01/matcha-hot-chocolate-I-howsweeteats.com-4.jpg)\n\nI’ve tried my hand at a few matcha desserts and while I never love it alone, I really enjoy it when it’s combined with chocolate, especially dark chocolate. I figured that whole thing might work with white chocolate too and this is where it took me.\n\nAnd guess what?\n\nThe white chocolate is the BEST combination.\n\n![matcha honey hot chocolate with toasted marshmallows I howsweeteats.com ](http://www.howsweeteats.com/wp-content/uploads/2017/01/matcha-hot-chocolate-I-howsweeteats.com-5.jpg)\n\nWhite chocolate isn’t even my favorite chocolate but it’s my favorite when combined with matcha. So creamy and sweet and herby in a good way.\n\n![matcha honey hot chocolate with toasted marshmallows I howsweeteats.com ](http://www.howsweeteats.com/wp-content/uploads/2017/01/matcha-hot-chocolate-I-howsweeteats.com-7.jpg)\n\nAnd! This hot chocolate is made with coconut milk too. You could use all coconut milk if you’d like, but I used a mix of coconut and cow’s milk. It has that light hint of coconut and is just so flavorful that I can hardly stand it.\n\n![matcha honey hot chocolate with toasted marshmallows I howsweeteats.com ](http://www.howsweeteats.com/wp-content/uploads/2017/01/matcha-hot-chocolate-I-howsweeteats.com-8.jpg)\n\nWant to know a secret? I am craving a big snow. I want a huge blizzard if only so we can cuddle on the couch and watch movies after playing in the snow and sled riding. I can’t believe that it’s the end of January and we haven’t really had one good snow yet, so I’m willing it to happen with multiple mugs of hot chocolate.\n\nEven if most of the time my brain is thinking BEACH.\n\n![matcha honey hot chocolate with toasted marshmallows I howsweeteats.com ](https://www.howsweeteats.com/wp-content/uploads/2017/01/matcha-hot-chocolate-I-howsweeteats.com-6.jpg)\n\n![](https://www.howsweeteats.com/wp-content/uploads/2017/01/matcha-hot-chocolate-I-howsweeteats.com-7-250x250.jpg)\n\nMatcha Honey Hot Chocolate\n--------------------------\n\n*   1 14-ounce can coconut milk\n*   1 cup [milk](https://www.target.com/p/2-reduced-fat-milk-1gal-good-38-gather-8482/-/A-13276204?aflt=plt#lnk=sametab)\n*   2  tablespoons [honey](https://www.target.com/p/pure-clover-honey-12oz-good-38-gather-8482/-/A-54436198?aflt=plt)\n*   16  ounces white chocolate chopped\n*   2 teaspoons ground matcha tea\n*   1 teaspoon [vanilla extract](https://www.target.com/p/mccormick-pure-vanilla-extract-1oz/-/A-13353205?aflt=plt#lnk=sametab)\n*   1/4 teaspoon [salt](https://www.target.com/p/iodized-salt-26oz-good-38-gather-8482/-/A-78140513?aflt=plt#lnk=sametab)\n*   mini marshmallows for serving toasted if desired\n\n*   Combine the milks, honey, chocolate, matcha and salt together in a large saucepan and stir constantly until the chocolate is melted and the mixture is heated through. Turn off the heat and stir in the vanilla extract.\n    \n*   Serve immediately with toasted marshmallows.\n    \n\nCourse: Drinks\n\nCuisine: American\n\n![matcha honey hot chocolate with toasted marshmallows I howsweeteats.com ](http://www.howsweeteats.com/wp-content/uploads/2017/01/matcha-hot-chocolate-I-howsweeteats.com-13.jpg)\n\nWould an extra chocolate drizzle be too much?"
  },
  {
    "url": "https://wowitsveggie.com/dalgona-matcha/",
    "markdown": "# 4-Ingredient Whipped Dalgona Matcha (Step-By-Step) - Wow, It's Veggie?!\n[Jump to Recipe](#mv-creation-37-jtr)\n\nIf you are looking for a fresh spin on whipped coffee, dalgona matcha is the place for you! In case you didn’t know, **[Dalgona Whipped Coffee](http://wowitsveggie.com/dalgona-whipped-coffee-recipe/)** is all the rage! You can make it using just 4-ingredients and it is satisfying to watch the transformation.\n\nIf you already tried Dalgona coffee, you may love a [Greek Frappe](http://wowitsveggie.com/greek-frappe-recipe/) next which I personally love even more than whipped coffee! Either way, you are coming here to learn how to make Dalgona Matcha.\n\nThe process for dalgona matcha coffee is easy, but VERY DIFFERENT than from normal whipped coffee. If you made dalgona whipped coffee using the recipe above or one similar, get rid of everything you know. Of course, you have to still whip the coffee, but that is about it!\n\n![dalgona matcha whipped latte being poured into a cup](http://wowitsveggie.com/wp-content/uploads/2020/04/dalgona-matcha-header.jpg)\n\nWhat To Use When Making Dalgona Matcha\n--------------------------------------\n\nWhen making this dalgona matcha coffee recipe, I 100% recommend having a hand mixer. It makes your life so much easier and is so much faster! You **[can buy a hand mixer for about $30 on Amazon](https://amzn.to/2XAmT2i)** so please save your arms and go this route!\n\nIf you do not have a hand mixer and you don’t want to buy one, you CAN use a good old-fashioned whisk. My friend in London did this and said it took her about 20 minutes of hard mixing. She went out the next day and bought a hand mixer from the local store.\n\nI also heard that it takes anywhere from 450-500 whisks in order to make the dalgona matcha coffee recipe successful! If you are looking to up your arm strength, then maybe you want to go this route. As for me, I used my mom’s hand mixer that is older than I am and it was well worth it!\n\n![Easy Dalgona Matcha Recipe](http://wowitsveggie.com/wp-content/uploads/2020/04/dalgona-matcha-create.jpg)\n\nIngredients For Dalgona Matcha\n------------------------------\n\nWhat makes dalgona matcha different from regular whipped coffee is the ingredients.\n\nFirst, you will need **matcha powder** of course. You can by this online or from your local grocery store. Even stores like Walmart or chains usually have matcha powder. It is on the more expensive side, unlike the instant coffee.\n\nNext, matcha poweder will NOT whip up like icing on its own like the instant coffee will. I have no idea why and after many failed attempts with cocoa poweder, I decided to go the route of making the matcha like icing.\n\n![dalgona matcha in pretty cups with matcha poweder](http://wowitsveggie.com/wp-content/uploads/2020/04/dalgona-matcha-pretty-cups.jpg)\n\nEnter **coconut cream!** This is what is going to make your mixture “whip up” to get the dalgona matcha look you are looking for. Coconut cream is a vegan staple to use when whipping up foods that I have used for years.\n\nYou can **also use an egg white** if you don’t care about a vegan dalgona matcha drink, but coconut cream lends for a lovely flavor and I do recommend it. It also whips up very well! Raw eggs do present possible food safety issues, so know that before choosing an egg white to make your dalgona matcha.\n\nIf you cannot find a can of coconut cream, you can make it yourself. To make coconut cream, just get a can of coconut milk in the fridge and use the hardned mixture in order to ensure you get a good whip.\n\nYou can ALSO use **aquafaba** which is the liquid left over from draining a can of chickpeas. Weird, I know, but it works and is the key ingredient in recipes such as my **[Vegan Chocolate Mousse](http://wowitsveggie.com/vegan-chocolate-mousse-recipe/)** or when making [**Vegan Biscotti!**](http://wowitsveggie.com/vegan-biscotti-recipe/) It whips up quite well too and doesn’t have a coconut flavor.\n\nOf course, you will need the **sugar** of your choice! This can be anything, I usually just use plain white sugar!\n\nFinally, you will need **milk and ice cubes** if you want your dalgona matcha to be cold!\n\n![dalgona matcha being poured into a cup](http://wowitsveggie.com/wp-content/uploads/2020/04/dalgona-matcha-vertical.jpg)\n\nHow To Choose The Milk For Your Dalgona Matcha\n----------------------------------------------\n\nYour choice of milk 100% does not matter for the base of your dalgona matcha recipe. That being said, I do recommend a plant-milk instead of regular cow’s milk for a thick and creamy texture!\n\nI used a combination of almond milk and cashew milk, and I also used flax milk. If you want an added kick of flavor to your dalgona matcha recipe, I recommend trying vanilla almond milk or the vanilla non-dairy milk of your choice.\n\nOnce again, vegan milks are the popular choice for dalgona matcha due to the fact that they are a bit thicker than regular cow’s milk so they hold up better and mix with the whipped coffee better!\n\nYou can also choose to **make your milk hot or cold!** If you prefer a warm drink, simply warm your milk up on the stove beforehand! It is the perfect cozy drink, but I prefer the iced version because I will drink iced matcha no matter how cold it is!\n\n![dalgona matcha and dalgona whipped coffee](http://wowitsveggie.com/wp-content/uploads/2020/04/dalgona-matcha-and-coffee.jpg)\n\nHow To Make Dalgona Matcha\n--------------------------\n\nThe key to making dalgona matcha is to add ingredients in layers, unlike how you make regular whipped coffee. I learned this the hard way after spending 2 hours in the kitchen trying to work on chocolate whipped coffee.\n\nFirst, you are going to want to use a whisk or an electric mixer and whip the egg white/aquafaba/coconut cream until it starts looking like whipped cream.\n\nThis usually takes between 2-5 minutes of constant whipping with a hand mixer, but it will take even longer if you are working with a hand whisk. Keep this in mind!\n\n![matcha poweder on spoon with drink](http://wowitsveggie.com/wp-content/uploads/2020/04/dalgona-matcha-landscape-matcha-1024x870.jpg)\n\nOnce your base acheives the consistency that you want, go ahead and sprinkle your sugar over the creamy texture while you keep whipping. If you add the sugar and matcha at the beginning with the aquafaba/egg/coconut cream, this will not come out coffectly.\n\nIt must be added in steps!\n\nWhip the sugar a little longer and then sprinkle the matcha poweder over the whipped base to combine. You want to add the matcha poweder last. If you add it first, the recipe won’t whip up and you won’t acheive the dalgona matcha texture you are looking for.\n\nOnce you add the matcha, whip a little bit longer and then pour over a glass of iced or hot milk. That is it! You just made dalgona matcha!\n\nMaking dalgona matcha is just as easy as making dalgona coffee, you just need to do it slightly differently by using a different base.\n\nAs I said above, you can choose between egg whites, aquafaba, or coconut cream. Whichever one you have on had is fine as all three work well. Then whip it up and add the sugar and then finally sift the matcha in! Enjoy!\n\n![close up photo of dalgona matcha](http://wowitsveggie.com/wp-content/uploads/2020/04/dalgona-matcha-close-finished.jpg)\n\n**Prep Time** 5 minutes\n\n**Total Time** 5 minutes\n\n### Ingredients\n\n*   Choose one: 1/3 Cup Coconut Cream OR 1 Egg White OR 3 Tablespoons aquafaba \\[liquid from chickpeas\\]\n*   1 Tbsp Sugar OR 1 scoop of stevia\n*   1 tsp matcha powder\n*   Milk of your choice\n\n### Instructions\n\n1.  Whip your \"base\" of either aquafaba, coconut cream, or egg whites in a bowl and whip on high until it begins to look like whipped cream. About 2-5 minutes. If you use a whisk, it may take up to 10 minutes.\n2.  When peaks begin to form, sift in sugar and whip to combine.\n3.  Once sugar is combined, sift matcha powder over the whipped mixture and whip to combine.\n4.  Add milk or creamer to a cup and taste your milk \"base\" and add sugar to taste. Top with whipped dalgona matcha. If you want to serve this hot, warm your milk ahead of time!"
  },
  {
    "url": "https://choosingchia.com/matcha-green-tea-smoothie/",
    "markdown": "# Matcha Powder Green Tea Smoothie Recipe - Choosing Chia\nThis Matcha Green Tea Smoothie recipe is perfect for a light breakfast or a healthy snack! It’s made with matcha and hemp seeds for some added protein so this smoothie will keep you feeling full and satisfied!\n\n![two glasses of matcha smoothie](https://choosingchia.com/jessh-jessh/uploads/2022/06/Matcha-green-tea-smoothie-4-680x1020.jpg)\n\n**Matcha is not only great for drinking as a tea or [latte](https://choosingchia.com/vanilla-macadamia-matcha-latte/), but it’s an amazing ingredient that can be used in a variety of recipes**. Since matcha is a powder, it’s easier to add to recipes to give them a hint of matcha flavour and an extra nutritional boost.\n\nMatcha makes a great addition to your breakfast and can easily be added to [oatmeal](https://choosingchia.com/creamy-vanilla-matcha-oatmeal/), [chia pudding](https://choosingchia.com/matcha-latte-chia-pudding/) and smoothies.\n\n**Matcha does have caffeine in it, so I recommend enjoying this smoothie earlier in the day** and to avoid it as a late afternoon or evening snack if caffeine tends to keep you up.\n\nWhat is matcha?\n---------------\n\n**Matcha is a premium green tea powder** sourced from Japan that is made by grinding the actual tea leaves into a fine powder. This powder can then be mixed with hot water to make a traditional matcha tea or can be used directly in other recipes.\n\nBecause Matcha is made from the entire leaves, it has a higher amount of caffeine and antioxidants than regular green tea.\n\nMatcha comes in many different qualities that you can buy, from ceremonial grade (the highest quality), premium grade (high quality), and culinary grade (lowest quality).\n\nWhy You’ll Love This Matcha Smoothie Recipe\n-------------------------------------------\n\n*   **Healthy breakfast**. This smoothie makes a great light and healthy breakfast with 6 grams of fibre and 5 grams of protein per serving.\n*   **Energizing**. The matcha in the smoothie will give you a steady caffeine boost and will make you feel energized to take on the day.\n*   **Quick and easy**. This recipe comes together in just 5 minutes and can be modified with any of your favourite fruits.\n\nCeremonial vs. culinary grade matcha\n------------------------------------\n\nMatcha comes in a couple of different varieties or “grades.” Put simply, some matcha powders are better quality than others. Let’s review the two primary grades of matcha here. **You can use whichever type of matcha you prefer in your smoothies.**\n\n### Ceremonial grade matcha\n\nCeremonial grade matcha is made for drinking and is considered the highest quality matcha. This grade of matcha is made with the youngest tea leaves and has a very smooth, sweet and creamy taste. Ceremonial grade matcha also usually has a much more vibrant green colour compared to culinary grade matcha.\n\n### Culinary grade matcha\n\nCulinary grade matcha is still good quality but is made differently than ceremonial matcha. This type of matcha tends to have a slightly more bitter and robust flavour. As the name suggests culinary grade matcha is the type of matcha often used in cooking, smoothies and lattes.\n\nWhat fruit goes well with matcha powder?\n----------------------------------------\n\n**I find that tropical fruits go best with matcha and really compliment the flavour.**\n\nThis Matcha Green Tea Smoothie uses a mix of banana and mango, but some other great options you can try are pineapple, passionfruit and papaya.\n\n**If you want to keep the smoothie a rich green colour, make sure to use light-coloured fruits as opposed to darker fruits like blueberries.** If you don’t mind a darker-coloured smoothie, you can use a mix of berries like blueberries, raspberries and blackberries for a smoothie that is high in [antioxidants](https://www.hsph.harvard.edu/nutritionsource/antioxidants/).\n\nMatcha Smoothie Ingredients\n---------------------------\n\n![ingredients to make a matcha smoothie](https://choosingchia.com/jessh-jessh/uploads/2022/06/Matcha-Smoothie-680x1020.jpg)\n\n*   **Frozen bananas**: It’s best to use frozen bananas as opposed to fresh bananas in this recipe. Frozen bananas will give the smoothie a thick and creamy texture. To freeze your bananas, simply wait until they are your preferred ripeness, then peel them, cut them into pieces and place them in a freezer bag in the freezer overnight.\n*   **Mango**: The mango in this recipe can be used fresh since the bananas are already frozen. Mango gives a tropical sweetness to the smoothie. If you prefer pineapple, you could use that too.\n*   **Spinach:** An optional ingredient, but gives the smoothie some added “hidden” veggies and an extra nutritional boost!\n*   **Matcha powder:** The star ingredient! Matcha is high in antioxidants and is perfect to enjoy in the morning. If you find the taste of matcha quite strong, start with just 1-2 tsp of matcha powder. If you prefer a stronger tasting matcha smoothie, simply add another 1-2 tsp.\n*   **Hemp seeds:** One tablespoon of hemp seeds has approx. 4 grams of protein! The hemp seeds blend up nicely into the smoothie and don’t add any taste, but they are great for adding protein and fibre to this smoothie!\n*   **Almond milk**: You can use any type of milk you like in this recipe.\n*   **Sweetener of choice:** Another optional ingredient. If your fruit isn’t quite sweet enough, you may want to add a touch of maple syrup or agave to the smoothie. If you’re using sweet bananas and mangos, you probably won’t need any additional sweetener.\n\nHow to make this Matcha Green Tea Smoothie Recipe\n-------------------------------------------------\n\n### Step 1\n\nAdd the mango, banana, spinach, matcha, hemp seeds and almond milk to a blender.\n\n![Spinach, matcha, banana and hemp seeds in a blender](https://choosingchia.com/jessh-jessh/uploads/2022/06/Matcha-green-tea-smoothie-2-680x1020.jpg)\n\n### Step 2\n\nBlend on high until everything is well combined and smooth. Then pour into a glass and enjoy!\n\n![matcha smoothie in a blender](https://choosingchia.com/jessh-jessh/uploads/2022/06/Matcha-green-tea-smoothie-3-680x1020.jpg)\n\nTips for Making This Matcha Green Tea Smoothie Perfectly\n--------------------------------------------------------\n\n*   **Use a good quality matcha powder**. The matcha should have a rich green colour. This will make a big difference in both the taste and the benefits the matcha will have.\n*   **Use some frozen fruit**. If you use all fresh fruit, the smoothie won’t become thick and creamy. It’s best to use at least half if not all frozen fruit.\n*   **Cut your bananas into pieces** before freezing them. This will make the bananas easier to blend up.\n*   Depending on the size of your fruit and your preferred smoothie texture, you may need more or less almond milk in the recipe. Start with less and add more as you blend if needed.\n\nMatcha Smoothie FAQ\n-------------------\n\n**Can I make this matcha smoothie ahead of time?**\n\nAny smoothie is best enjoyed fresh for the best taste, but if needed you can prepare this smoothie 1-2 hours ahead of time and store it in the fridge. Just make sure to shake it up before serving.\n\n**How much caffeine is in this matcha smoothie?**\n\nThis will depend on how much matcha powder you add to the smoothie. Each teaspoon of matcha has approximately 68 milligrams of caffeine. An average cup of coffee has approximately 100 milligrams of caffeine.\n\n**Is powdered matcha good for you?**\n\nYes! Matcha powder is packed with antioxidants and is very healthy for you. For the best quality matcha use ceremonial grade matcha. It should be a vibrant green colour.\n\n**Is matcha effective in smoothies?**\n\nMatcha powder can be enjoyed hot or cold and added directly to drinks or food since it’s a powder that will easily dissolve. This makes it a great option to add to your morning smoothie. Remember that matcha does contain caffeine, so if you’re sensitive to caffeine it’s best to drink this smoothie in the morning.\n\n**What are the benefits of matcha powder in smoothies?**\n\n\\* High in antioxidants  \n\\* Can boost brain functioning  \n\\* Improves focus  \n\\* Can promote weight loss  \n\\* Give you energy\n\n![two matcha smoothies on a marble counter](https://choosingchia.com/jessh-jessh/uploads/2022/06/Matcha-green-tea-smoothie-6-680x1020.jpg)\n\nMore smoothie recipes to try\n----------------------------\n\n*   [How To Make An Acai Bowl](https://choosingchia.com/blueberry-acai-bowls/)\n*   [Blueberry Avocado Smoothie](https://choosingchia.com/blueberry-avocado-smoothie/)\n*   [Coffee Smoothie](https://choosingchia.com/coffee-smoothie/)\n*   [Inner Glow Mango Smoothie](https://choosingchia.com/inner-glow-mango-smoothie/)\n\nIf you tried this **Matcha Green Tea Smoothie** or any other recipe on the blog let me know how you liked it by leaving a comment/rating below! Be sure to follow along on [Pinterest](https://www.pinterest.ca/choosingchia/), [Instagram](https://www.instagram.com/choosingchia/) and [Facebook](https://www.facebook.com/choosingchia) for even more deliciousness!\n\n[Print](https://choosingchia.com/matcha-green-tea-smoothie/print/13392/)\n\n* * *\n\n### Description\n\nThis Matcha Green Tea Smoothie is perfect for a light and healthy breakfast!\n\n* * *\n\n*   2 bananas, frozen\n*   1 mango, cut into cubes\n*   1 handful spinach (optional)\n*   2–4 tsp [matcha powder](https://www.amazon.com/gp/product/B014LT0712/ref=as_li_qf_asin_il_tl?ie=UTF8&tag=choosingchia-20&creative=9325&linkCode=as2&creativeASIN=B014LT0712&linkId=ff18f0be79fecb952af7f3e9c02242ff)\n*   2 tbsp [hemp seeds](http://l.thrv.me/cc-manitoba-hrvst-raw-hemp-seeds)\n*   1 cup [almond milk](https://www.amazon.com/gp/product/B016LBCIEC/ref=as_li_qf_asin_il_tl?ie=UTF8&tag=choosingchia-20&creative=9325&linkCode=as2&creativeASIN=B016LBCIEC&linkId=ef4e7c305b9aca313a4163b650146fa0)\n*   Sweetener of choice if needed (honey, [maple syrup](https://www.amazon.com/gp/product/B00A2N74T0/ref=as_li_qf_asin_il_tl?ie=UTF8&tag=choosingchia-20&creative=9325&linkCode=as2&creativeASIN=B00A2N74T0&linkId=48f22e7314552baaea69cdc238ceed62)…etc if your fruit isn’t sweet enough)\n\nCook Mode Prevent your screen from going dark\n\n* * *\n\n1.  Add all the ingredients to a high-speed [blender](https://www.amazon.com/gp/product/B077L3F2SG/ref=as_li_qf_asin_il_tl?ie=UTF8&tag=choosingchia-20&creative=9325&linkCode=as2&creativeASIN=B077L3F2SG&linkId=09da9e0db7bf96a6f7aee354ae95bd8a) and blend until smooth and creamy. \n2.  If the smoothie is too thick, add a bit more almond milk. \n3.  Optionally top off this smoothie with a dusting of matcha powder and some [hemp seeds](http://l.thrv.me/cc-manitoba-hrvst-raw-hemp-seeds). \n\n* * *\n\n### Notes\n\nUse a good quality matcha powder. The matcha should have a rich green colour. This will make a big difference in both the taste and the benefits the matcha will have.\n\nCut your bananas into pieces before freezing them. This will make the bananas easier to blend up.\n\nDepending on the size of your fruit and your preferred smoothie texture, you may need more or less almond milk in the recipe. Start with less and add more as you blend if needed.\n\n* * *\n\n### Nutrition\n\n*   **Serving Size:** 1 smoothie\n*   **Calories:** 200\n*   **Sugar:** 24g\n*   **Fat:** 4g\n*   **Trans Fat:** \\`\n*   **Carbohydrates:** 40g\n*   **Fiber:** 6g\n*   **Protein:** 5g\n\nThis post contains affiliate links which means I will make a small commission if you purchase through those links. I only recommend products that I know, trust and love!\n\n_posted by_ Jessica Hoffman _on_ June 20, 2022 _(updated May 23, 2024)_\n\n[7 _Comments_](https://choosingchia.com/matcha-green-tea-smoothie/#comments) [Leave a Comment »](#respond)"
  },
  {
    "url": "https://dishingouthealth.com/matcha-tahini-white-chocolate-bark/",
    "markdown": "Failed to convert"
  },
  {
    "url": "https://www.emmaivane.com/",
    "markdown": "Failed to convert"
  },
  {
    "url": "https://choosingchia.com/matcha-coconut-muffins/",
    "markdown": "Failed to convert"
  },
  {
    "url": "https://www.foodgal.com/2020/03/iced-matcha-lemon-loaf-cake/",
    "markdown": "Failed to convert"
  },
  {
    "url": "https://www.emmaivane.com/reseptit/matcha-marenki-joulukuuset/",
    "markdown": "Failed to convert"
  },
  {
    "url": "https://www.theconsciousplantkitchen.com/matcha-avocado-smoothie/",
    "markdown": "Failed to convert"
  },
  {
    "url": "http://www.thekitchykitchen.com/?recipes=/white-chocolate-matcha-latte/#_a5y_p=4557246",
    "markdown": "Failed to convert"
  },
  {
    "url": "https://www.jadeleafmatcha.com/blogs/matcha-recipes/85651076-white-chocolate-matcha-green-tea-cookies",
    "markdown": "Failed to convert"
  },
  {
    "url": "https://teakandthyme.com/no-bake-matcha-cheesecake/",
    "markdown": "Failed to convert"
  },
  {
    "url": "https://kumikomatcha.fr/blogs/recettes/matcha-latte",
    "markdown": "# Recette de matcha latte bio : le guide ultime\n– Kumiko Matcha\n\nParmi les boissons qu’il est possible de préparer avec du thé vert matcha, une des plus onctueuses est le **matcha latte**. Véritable gourmandise, le matcha latte se décline en différentes recettes, aussi crémeuses et savoureuses les unes que les autres.\n\nDécouvre de quoi est composé un véritable matcha latte et ensuite, laisse-toi tenter.\n\nQu'est-ce qu'un matcha latte ?\n------------------------------\n\n![préparation matcha latte](https://cdn.shopify.com/s/files/1/1331/3585/files/matcha_latte_2_2048x2048.jpg?v=1590570012)\n\n### La recette de base d'un matcha latte\n\nLa préparation de départ d’un thé matcha latte bio est assez simple. Voici les ingrédients principaux :\n\n*   des feuilles de thé vert finement moulue en poudre, c'est à dire du thé [matcha](https://kumikomatcha.fr/blogs/essais-et-videos/quels-sont-les-bienfaits-du-matcha \"qu'est-ce que le matcha ?\") bio\n*   de l'eau (chaude ou froide selon la recette)\n*   du lait bio (végétal ou non)\n\nOn prépare d'abord un thé matcha de manière traditionnelle, en versant de l'eau chaude sur la poudre de thé dans un bol à matcha et en fouettant à l'aide d'un fouet en bambou. Une fois le matcha prêt, on le verse dans un verre contenant le lait bio de son choix (de préférence végétal). On peut y ajouter des glaçons et le sucrant de son choix pour terminer la préparation.\n\nQuel est le goût du matcha latte ?\n----------------------------------\n\nGrâce à l'ajout de lait au matcha, le **matcha latte** gagne en douceur et offre une saveur sucrée. Les notes lactées ajoutent une rondeur et un bel équilibre aux notes herbacées du matcha bio. \n\nEn utilisant un matcha de qualité, comme le [matcha premium bio](https://kumikomatcha.fr/products/the-vert-matcha-bio), l'umami reste présent en bouche, et cela sans amertume ou astringence.\n\nPour gagner en complexité aromatique, il est intéressant d'ajouter des ingrédients aux notes florales, comme un sirop de rose, ou du miel de fleurs.\n\nC'est pourquoi Sabine nous propose aujourd'hui une recette gourmande de matcha latte au lait d'amande et au miel de lavande, qui mélange élégamment notes végétales, fleuries et confisées !\n\nLe Matcha latte au lait d’amande et miel de lavande\n---------------------------------------------------\n\n![ingrédients matcha latte au lait d'amande](https://cdn.shopify.com/s/files/1/1331/3585/files/matcha_ingredient_1_2048x2048.jpg?v=1590569919)\n\n[obtenir le pdf de la recette](https://cdn.shopify.com/s/files/1/1331/3585/files/Matcha_latte_au_lait_d_amende_et_miel_de_lavande.pdf?v=1612365034)\n\n#### Les ingrédients (pour 2 tasses) :\n\n\\- 2 cuillères à café de [thé matcha de cuisine bio](https://kumikomatcha.fr/products/matcha-cuisine \"matcha de cuisine bio\")\n\n\\- 25 ml d’eau chaude\n\n\\- 350 ml de lait d’amande bio à température ambiante\n\n\\- du miel de lavande bio (ou du miel classique)\n\n![Deux matchas latte](https://cdn.shopify.com/s/files/1/1331/3585/files/matcha_latte_1_2048x2048.jpg?v=1590569976)\n\nLa recette du matcha latte au lait d'amande\n-------------------------------------------\n\n*   Dans un bol assez large, dépose la poudre de matcha.\n*   Verse doucement l’eau chaude par-dessus.\n*   Fouette le tout à l’aide d’un fouet traditionnel en bambou jusqu'à obtenir une mousse onctueuse.\n*   Verse ensuite la préparation dans 2 tasses, puis ajoutez le lait d’amande.\n*   Termine par une cuillère de miel de lavande pour sucrer la boisson.\n\nC'est prêt, tu peux déguster ta tasse de thé.\n\nCe matcha latte mousseux et gourmand se consomme à température ambiante.\n\n ![matcha de cuisine et latte](https://cdn.shopify.com/s/files/1/1331/3585/files/matcha_latte_3_2048x2048.jpg?v=1590570070)\n\n### Comment préparer du matcha latte glacé ?\n\nPréparer un matcha latte en version glacée, c'est très simple ! \n\nPour cela, verse les deux cuillères à café de matcha dans un shaker, puis ajoute des glaçons et un peu d'eau pour atteindre 2/3 du shaker, puis mélange plusieurs fois jusqu'à ce que la poudre se mélange parfaitement à l'eau !\n\nEnsuite, il suffit de mélanger le tout au lait d'amande, et ajouter le miel, et c'est prêt !\n\n*   Pour plus de conseils, je te recommande mon [article dédié au matcha glacé.](https://kumikomatcha.fr/blogs/recettes/matcha-latte-glace)\n\nMes astuces pour réussir son matcha latte à tous les coups\n----------------------------------------------------------\n\nPour te permettre de réussir à coup sûr ta préparation, je te partage quelques unes de mes astuces pour obtenir le matcha latte parfait :\n\n*   Pour éviter la formation de grumeaux en préparant le matcha, essayer de verser un fond d'eau froide et de mélanger la poudre à l'eau avec un fouet chasen, puis ajouter l'eau chaude. \n*   Si la poudre de matcha n'est pas suffisamment fine, je te recommande de la tamiser, de cette façon tu ne devrais plus retrouver de grumeaux au fond de ta tasse.\n*   Pour obtenir une belle mousse de lait, tu peux utiliser un mousseur à lait, pour une texture encore plus crémeuse.\n*   Pour obtenir le meilleur goût possible, évite d'utiliser de l'eau du robinet. Une eau filtrée ou de source donnera un meilleur goût au thé !\n\n### Les recettes de la communauté Kumiko Matcha\n\nEn plus de la recette ci-dessus, Sabine nous a concocté trois autres délicieuses recettes, que tu peux décliner selon tes envies du moment. Plutôt cocooning au coin du feu ou adepte des boissons aux bienfaits antioxydants et énergisants ? Tu trouveras forcément ta recette de matcha latte chaud ou froid préférée.\n\n*   Matcha rose latte\n*   Matcha latte à la pêche\n*   Pumpkin spice latte\n\n[![matcha-rose-latte](https://cdn.shopify.com/s/files/1/1331/3585/files/2_480x480.png?v=1591971477)](https://kumikomatcha.fr/blogs/recettes/recettes-matcha-latte#matcharoselatte) [![matcha-peche](https://cdn.shopify.com/s/files/1/1331/3585/files/Matcha_latte_a_la_peche_480x480.jpg?v=1596215336)](https://kumikomatcha.fr/blogs/recettes/recettes-matcha-latte#matchapeche) [![pumpkinmatchalatte](https://cdn.shopify.com/s/files/1/1331/3585/files/pumpkin_spice_matcha_latte_480x480.png?v=1602339406)](https://kumikomatcha.fr/blogs/recettes/recettes-matcha-latte#pumpkinmatcha)[](https://kumikomatcha.fr/articles/recettes/606092755280#pumpkinmatcha)\n\n (clique pour découvrir la recette de ton choix)\n\nTu as aimé la recette du matcha latte ? Partage ton expérience en commentaire.\n\nSi tu veux inspirer d’autres amateurs de thé matcha, tu peux contribuer à enrichir cet article. En proposant tes propres recettes à la communauté Kumiko Matcha, tu participes à faire découvrir les bienfaits du thé au plus grand nombre. Merci à toi !\n\n![begirltravel](https://cdn.shopify.com/s/files/1/1331/3585/files/photo_Sabine_compresse_medium.jpg?v=1583013944)\n\nCes recettes ont été réalisées par Sabine qui crée des recettes mariant les différentes cultures qu'elle rencontre au gré de ses voyages."
  },
  {
    "url": "https://www.proportionalplate.com/dalgona-matcha-latte/",
    "markdown": "# Dalgona Matcha Latte - Proportional Plate\nThis Dalgona Matcha Latte recipe is a sweet latte topped with whipped matcha foam – it’s delicious and it looks gorgeous! While a matcha latte is a sweet, creamy, comforting drink, sometimes though, you want to step it up a little. Give it some flair. That’s where this incredible Dalgona Matcha Latte comes in.\n\n![A glass mug filled half way with coconut milk and topped with matcha foam.](https://www.proportionalplate.com/wp-content/uploads/2020/04/Dalgona-Whipped-Matcha-1-683x1024.jpg)\n\nDalgona coffee recipes have taken the internet by storm and inspired people to get creative with their at-home beverages. The name Dalgona is the South Korean word for a type of honeycomb candy.\n\nDalgona coffee is a whipped coffee drink made by combining instant coffee granules, sugar, and water. You whip them together until it has a whipped cream or meringue-type consistency. Then, serve hot or cold with warm milk and you’ll have a barista-style coffee drink.\n\nMy take on the Dalgona trend is a beautiful Dalgona Matcha Latte, which is made the same way but with some different ingredients. You create the matcha froth by combining egg white (or aquafaba if you like), sugar, and matcha powder.\n\n**Note:** You don’t need the extra froth to assist from the egg white (or aquafaba) when making Dalgona coffee since there is gluten in instant coffee.\n\nHow to Make a Dalgona Matcha Latte\n----------------------------------\n\nTo make this frothy matcha treat, you will need the following:\n\n![Egg whites, matcha, and sugar in small bowls on a marble countertop.](https://www.proportionalplate.com/wp-content/uploads/2020/04/Dalgona-Whipped-Matcha-Ingredients-683x1024.jpg)\n\nTake your egg white (or aquafaba) in a bowl and whip the egg white until it is frothy and has mostly a stiff, white texture. You can use a [whisk](https://amzn.to/2RbUZ97), a [hand mixer](https://amzn.to/2RcGEJA), or a [handheld frother](https://amzn.to/2wfsbFq). A whisk may take a little longer to get the egg white to the right consistency!\n\n![Hands whisking egg whites in a white bowl.](https://www.proportionalplate.com/wp-content/uploads/2020/04/Step-by-Step-3-Egg-Whites.jpg)\n\nAdd in the sugar and continue to whip until stiff peaks form and it sticks to your whisk. See the image for a good example of stiff peak consistency.\n\n![A hand whisking egg whites and sugar to a cream in a bowl.](https://www.proportionalplate.com/wp-content/uploads/2020/04/Step-by-Step-Egg-Whites-Soft-Peaks.jpg)\n\nSift in the [matcha powder](https://amzn.to/3IhIEdA) (culinary grade), and thoroughly whisk it into the mixture until fully incorporated.\n\n![Sifting matcha and then whipping matcha and egg whites in a bowl.](https://www.proportionalplate.com/wp-content/uploads/2020/04/Step-by-Step-Whipped-Matcha.jpg)\n\nAdd your chosen milk, dairy or non-dairy, to a cup. Top the milk with the whipped Dalgona Matcha. Sip, savor and enjoy!\n\nWhat Can I Add to Customize My Dalgona Latte?\n---------------------------------------------\n\nCustomize and invent your version of this latte with things like:\n\n*   a pinch of cinnamon or nutmeg powder\n*   edible essential oils like rose or lavender\n*   a slice of citrus fruit like orange\n\nHow Long Does it Take to Make Whipped Matcha?\n---------------------------------------------\n\nIt only takes 10 minutes to whip up a frothy matcha cream. It’s quick, easy, and well worth the extra little bit of time to elevate your matcha.\n\nWhat is Aquafaba?\n-----------------\n\nA very popular ingredient in vegan cuisine, aquafaba is the thick liquid that is produced after soaking legumes (like chickpeas, beans, lentils, etc.) It’s a great substitute for egg whites in many recipes.\n\nIs it Safe to Eat Uncooked Egg White?\n-------------------------------------\n\nEating any part of an egg raw can present a health and safety problem, as raw eggs do carry bacteria. If you’d rather not take the risk, buying eggs that have been pasteurized (look out for that on the label) or liquid egg whites in a carton, as these are always pasteurized, is a good compromise.\n\nMore Matcha Recipes\n-------------------\n\nLooking for more matcha? Check out [ALL my favorite matcha desserts](https://www.proportionalplate.com/best-matcha-dessert-recipes/) here or try these amazing recipes.\n\nOr if you’re looking for something refreshing, you can find [my favorite drinks here](https://www.proportionalplate.com/category/recipes/beverages/).\n\n![A creamy green whipped topping on a metal whisk.](https://www.proportionalplate.com/wp-content/uploads/2020/04/Dalgona-Whipped-Matcha-0-683x1024.jpg)\n\n![](https://www.proportionalplate.com/wp-content/uploads/2020/04/Dalgona-Whipped-Matcha-1-200x300.jpg)\n\nDalgona Matcha Latte\n--------------------\n\n[Print Recipe](https://www.proportionalplate.com/wprm_print/dalgona-matcha-latte) [Save](https://app.grow.me/)\n\nThis Dalgona Matcha Latte recipe is a sweet latte topped with whipped matcha foam – it's delicious and it looks gorgeous!\n\nPrep Time10 minutes\n\nCook Time0 minutes\n\n0 minutes\n\nTotal Time10 minutes\n\nCourse: Drinks\n\nCuisine: Japanese, Korean\n\nServings: 1\n\nCalories: 269kcal\n\n*   ▢\n\n*   ▢ 1 egg white or 2 tbsp aquafaba (aka chickpea liquid)\n*   ▢ 1 tbsp sugar granulated white, turbinado, or cane\n*   ▢ 1 tsp [matcha powder](https://www.amazon.com/dp/B09CFSVW32?ref=t_ac_view_request_product_image&campaignId=amzn1.campaign.2FDRI11ANER2B&linkCode=tr1&tag=proportionalp-20&linkId=amzn1.campaign.2FDRI11ANER2B_1701904638265) culinary grade\n*   ▢ 1 cup milk I used coconut milk, but any kind works\n\n*   Whip the egg white (or aquafaba) until it is frothy and mostly stiff with a whisk, hand mixer, or handheld frother. Add the sugar and whip until stiff peaks form and it sticks to your whisk.\n    \n*   Sift in the matcha powder. Whisk it in until incorporated.\n    \n*   Add the milk to a cup. Top with the whipped matcha and enjoy!\n    \n\nDo not add the matcha powder until instructed or the egg whites will not properly whip. The tea leaves will weigh the mixture down too much to froth properly.\n\nSugar: this recipe works best with fine, granulated sugar. But it also works with many other sugars. Make sure the egg white/aquafaba is stiff before adding the sugar, especially if using a heavy sugar like coconut sugar.\n\nAquafaba is the liquid left when you strain chickpeas from a can. \n\nEating any part of an egg raw can present a health and safety problem, as raw eggs do carry bacteria. If you’d rather not take the risk, buying eggs that have been pasteurized (look out for that on the label) or liquid egg whites in a carton, as these are always pasteurized, is a good compromise.\n\nYou don’t need the extra froth assist from the egg white (or aquafaba) when making Dalgona coffee since there is gluten in instant coffee.\n\nWhen using aquafaba, adding 1/4 tsp cream of tartar will get you firmer peaks in your mixture. It works great with and without, but if you prefer stiffer peaks, add the cream of tartar.\n\nCalories: 269kcal | Carbohydrates: 36g | Protein: 13g | Fat: 8g | Saturated Fat: 5g | Cholesterol: 24mg | Sodium: 155mg | Potassium: 371mg | Sugar: 36g | Vitamin A: 595IU | Calcium: 276mg | Iron: 1mg\n\nI’d love to hear what you think! [Leave a Review](#) to let us know how it came out, if you have a successful substitution or variation, or anything else."
  },
  {
    "url": "https://bromabakery.com/white-chocolate-matcha-iced-latte/",
    "markdown": "# White Chocolate Matcha Iced Latte - Broma Bakery\n_This website uses affiliate links which may earn commission for purchases made at no additional cost to you._\n\n![These insta-worthy White Chocolate Matcha Iced Lattes are the perfect afternoon pick-me-up. Power through the rest of the day with this sweet, green, caffeinated treat.](https://bromabakery.com/wp-content/uploads/2019/03/Iced-White-Chocolate-Matcha-Latte-2.webp)\n\nHalfway through the work week love bugs. Do you know what’s keeping us alert and focused (and happy)? These insta-worthy White Chocolate Matcha Iced Lattes. YUM. Power through the rest of hump day with this sweet, green, caffeinated treat.\n\n![These insta-worthy White Chocolate Matcha Iced Lattes are the perfect afternoon pick-me-up. Power through the rest of the day with this sweet, green, caffeinated treat.](https://bromabakery.com/wp-content/uploads/2019/03/Iced-White-Chocolate-Matcha-Latte.jpg)\n\nHow to make a latte without a milk frother?\n-------------------------------------------\n\nIf you don’t have any fancy kitchen tools, don’t worry–you can still make this latte. Just a regular old blender will do the trick. Simply pour your milk into your blender (or your milk and matcha if you don’t care about that swirly beautiful milk pour) and blend at the highest speed. The result?  Frothy bubbly milk you usually have to pay $5 for at a coffee shop.\n\nMatcha vs Coffee?\n-----------------\n\nListen, I am an avid coffee drinker. So don’t expect me to completely hop on the matcha band wagon any time soon. That being said, I must say this green stuff is goooood. Matcha is made from finely ground tea leaves and delivers roughly 3 times the amount of caffeine as a regular brewed cup of green tea. \n\nWhile a serving of matcha does have less caffeine than a cup of coffee, it tends to give you a less jittery and more sustained energy boost with no crash at the end. Sign me up.\n\n![These insta-worthy White Chocolate Matcha Iced Lattes are the perfect afternoon pick-me-up. Power through the rest of the day with this sweet, green, caffeinated treat.](https://bromabakery.com/wp-content/uploads/2019/03/Iced-White-Chocolate-Matcha-Latte-3.webp)\n\nHow to get matcha to dissolve completely?\n-----------------------------------------\n\nThe key to getting an iced matcha without any flecks is dissolving the matcha in hot water.  While there are lots of tools you can buy (like matcha brushes and whisks), we found that a traditional whisk worked just fine to break down the matcha when it was dissolved in a hot liquid.\n\nIf you’re still seeing flecks in your drink, you can also throw it in a high powered blender and blend on high. This will help to really break everything down.\n\nAlso. There are worse things than having tiny green dots in your latte, so if you can’t get ’em all, don’t worry.\n\nNow go stay caffeinated and crush the rest of this week!\n\nSee you on Friday with a new recipe.\n\nXX \n\n[Print](https://bromabakery.com/white-chocolate-matcha-iced-latte/print/19731/)\n\n*   Prep Time: 3 minutes\n*   Cook Time: 2 minutes\n*   Total Time: 5 minutes\n*   Yield: 2 big matcha lattes\n\nUnits:\n\n### Ingredients\n\n*   2 cups milk of your choice (we used coconut milk and it was delicious)\n*   3 ounces white chocolate, roughly chopped\n*   pinch of salt\n*   1 tablespoon high quality matcha\n*   1/4 cup hot water (almost boiling)\n\n### Instructions\n\n1.  Fill two cups with ice cubes  and set aside.\n2.  In a small [sauce pan](https://urlgeni.us/amazon/allclad2qt_blog) heat the milk over low heat. Add in the white chocolate slowly, whisking constantly until chocolate is completely dissolved into the milk. Add in a pinch of salt and stir well. Take the milk off the heat and set aside.\n3.  Dissolve the matcha by pouring a 1/4 cup of boiling water over the matcha. Whisk until it’s completely dissolved, about 2 minutes. If you still have specks in your matcha or if you just want to blend everything together add the matcha mixture to the chocolate milk now. Otherwise, divide the matcha between the two prepared cups.\n4.  Place the milk in a blender and blend on high for one minute, or until the milk starts to froth and forms bubbles at the top. Pour over your matcha and ice and stir to mix. Enjoy!"
  },
  {
    "url": "https://www.eatwellexploreoften.com/how-to-make-dalgona-matcha/",
    "markdown": "# Eat Well, Explore Often - How to Make Dalgona Matcha - Whipped Matcha Latte Recipe -\nYou guys know that I was obsessed over making [dalgona coffee,](https://www.eatwellexploreoften.com/dalgona-coffee-recipe/) but I found an EVEN better version – dalgona matcha! Perfect for you non-coffee drinkers and matcha lovers out there!\n\n[DALGONA COFFE RECIPE HERE](https://www.eatwellexploreoften.com/dalgona-coffee-recipe/)\n\nInitially, I tried making whipped dalgona matcha the same way as the original dalgona coffee, but my matcha did NOT fluff up! Apparently, you need to add other agents to help it become whipped. I’ve heard of people whipping it without, but I haven’t been able to recreate it with the matcha I have at home.\n\nWays to Make Dalgona Matcha\n---------------------------\n\n### 1\\. Egg Whites\n\nMixing the egg whites essentially is creating a meringue, which will help keep the matcha’s fluffy texture. The idea of eating raw eggs initially seemed a little odd to me, but I actually liked this a little better than the taste of whipping cream! This version gave me a _better fluffy, whipped texture_.\n\nMake sure the eggs you use are [pasteurized](https://www.medicalnewstoday.com/articles/325515#is-it-safe) as there is always a risk of eating raw eggs.\n\n### 2\\. Heavy Cream / Heavy Whipping Cream\n\nAdding matcha to heavy cream will also yield a whipped matcha texture. You can whisk **1/2 cup of heavy cream** and follow the same directions as the egg whites version. If you try the heavy cream or heavy whipping cream, I would suggest using **more matcha** to give it more flavor and color. Add in extra matcha until the desired color is achieved.\n\nThis version is definitely very _creamy_. If you over-mix the whipping cream, just add in some extra heavy whipping cream to get it to the correct consistency.\n\n### 3\\. Chickpea Liquid\n\nI’ve been seeing some recent [recipes](https://www.simplyquinoa.com/whipped-matcha-latte/) using chickpea liquid from one can to create the whipped texture. This would be a **great alternative** for a **vegan recipe** or another use of your leftover chickpea liquid!\n\n### Mixer\n\nI would highly recommend using a [hand mixer](https://www.amazon.com/dp/B07ZDX2HW7/?ref=idea_lv_dp_ov_d&tag=aiponsite-20&linkCode=ic6&ascsubtag=amzn1.ideas.1SQ0V1PVBBHZ1) in order to get the fluffy texture from the eggs. You could whisk it by hand, but it is definitely easier with a hand or stand mixer. You will mix for about 5 minutes to get the mixture to stiff peaks. Mix until you get to your desired consistency.\n\n[![](https://i1.wp.com/www.eatwellexploreoften.com/wp-content/uploads/2020/04/Eat-Well-Explore-Often-Dalgona-Matcha-Stiff-Peaks.jpg?fit=740%2C494&ssl=1)](https://www.eatwellexploreoften.com/how-to-make-dalgona-matcha/)\n\nwhisk to stiff peaks\n\n### Matcha\n\nI used from 1 teaspoon to 1 tablespoon of [matcha](https://www.amazon.com/dp/B0087ALJ3M/?ref=idea_lv_dp_ov_d&tag=aiponsite-20&linkCode=ic6&ascsubtag=amzn1.ideas.1SQ0V1PVBBHZ1). If you want a _more pronounced matcha_ taste, use **1 tablespoon of matcha**, otherwise, a good medium is **2 teaspoons**. 1 tablespoon has a lot more [matcha](http://amazon.com/dp/B0087ALJ3M/?ref=idea_lv_dp_ov_d&tag=aiponsite-20&linkCode=ic6&ascsubtag=amzn1.ideas.1SQ0V1PVBBHZ1(opens%20in%20a%20new%20tab)) flavor and color, but you can get away with less. **Add in matcha slowly** so you can check the color profile and **adjust to your own preference**.\n\n[MATCHA RECOMMENDATIONS HERE](https://www.amazon.com/ideas/amzn1.account.AEGM67QNMAMTV2I3OI26QSAZ73BQ/1TBBJXGK6QODN) \\[affiliate link\\]\n\n### Sweetness Level\n\nEveryone has differing levels of sugar preference. I personally prefer less sweet, while my husband likes more sugar. You can either whisk the simple syrup with your egg whites OR add the simple syrup **AFTER** you have made the whipped matcha. **Add a few tablespoons of the syrup** after you have mixed your whipped matcha with your milk if you choose not to mix it in with your egg whites.\n\nIf you don’t use all your simple syrup, save it for your next drink!\n\n*   ![Dalgona Matcha - Whipped Matcha Recipe](https://i2.wp.com/www.eatwellexploreoften.com/wp-content/uploads/2020/04/Eat-Well-Explore-Often-Dalgona-Matcha-2.jpg?resize=740%2C633&ssl=1)\n    \n*   ![Dalgona Whipped Matcha Recipe](https://i2.wp.com/www.eatwellexploreoften.com/wp-content/uploads/2020/04/Eat-Well-Explore-Often-Dalgona-Matcha-7.jpg?resize=682%2C1024&ssl=1)\n    \n\nThese recipes will yield enough for about two cups of dalgona matcha:\n\nDalgona Matcha using Egg Whites\n-------------------------------\n\nEasy whipped iced matcha latte\n\n*   Electric Mixer\n    \n*   Small Sauce Pan\n    \n*   Mixing bowl\n    \n*   Cup\n    \n\n*   2 egg whites\n*   1/4 cup sugar\n*   1/4 cup water\n*   2 tsp matcha powder\n*   1 cup choice of milk\n\n*   Mix two egg whites until frothy\n    \n*   Create a simple syrup: add 1/4 cup sugar and 1/4 cup water in a sauce pan. Allow sugar to melt and simmer for 1-2 minutes. Allow the sugar syrup to cool for a few minutes\n    \n*   Add 1/2 of the simple syrup to the egg whites and whisk together for several minutes. Adjust sweetness as needed – add more syrup if preferred\n    \n*   Add in matcha slowly while whisking blended egg whites\n    \n*   Whisk mixture until stiff peaks form\n    \n*   Fill the cup halfway with your choice of milk, add ice\n    \n*   Place whipped matcha on top of milk\n    \n*   Sprinkle matcha on top, mix and enjoy!\n    \n\nAdjust sugar and matcha to personal preferences. Add up to 1 tablespoon of matcha for more pronounced flavor\n\nDalgona Matcha with Heavy Cream / Heavy Whipping Cream\n------------------------------------------------------\n\n*   Electric Mixer\n    \n*   Small Sauce Pan\n    \n*   Mixing bowl\n    \n*   Cup\n    \n\n*   1/2 cup heavy cream\n*   1/4 cup sugar\n*   1/4 cup water\n*   3 tsp matcha powder\n*   1 cup milk\n\n*   Create a simple syrup: add 1/4 cup sugar and 1/4 cup water in a sauce pan. Allow sugar to melt and simmer for 1-2 minutes. Allow the sugar syrup to cool for a few minutes\n    \n*   Begin whisking 1 cup of heavy whipping cream in a mixing bowl\n    \n*   Add 1/2 of the simple syrup to the heavy whipping cream and whisk together for several minutes. Adjust sweetness as needed – add more syrup if preferred\n    \n*   Slowly add in matcha and whisk until matcha is fully blended\n    \n*   Whisk mixture until soft peaks form or desired consistency\n    \n*   Fill cup halfway with your choice of milk, add ice, and add whipped matcha on top\n    \n*   Sprinkle matcha on top, mix and enjoy!\n    \n\nYou can interchange heavy cream and heavy whipping cream. If you overwhisk your mixture, add in extra heavy cream to get to desired consistency.\n\nAdjust sugar and matcha to personal preferences. For more pronounced matcha flavor, use up to 1 tablespoon.\n\nYou can whisk the matcha with up to 1/4 cup of hot water and then add into whipped cream if you want quicker uniformity.\n\nI would love to know which dalgona matcha is your favorite or if you prefer the original dalgona coffee instead! My personal preference is the **egg whites**! If you have heavy cream, you can also make [chocolate truffles](https://aromafoods-simplerecipes.com/2-ingredients-chocolate-truffles/) to go along with your dalgona coffee.\n\nI hope you guys enjoyed this recipe! Please PIN or share this with anyone who could use the matcha version of dalgona coffee!\n\n*   ![](https://i2.wp.com/www.eatwellexploreoften.com/wp-content/uploads/2020/04/Dalgona-Matcha.png?fit=683%2C1024&ssl=1)\n    \n*   ![](https://i1.wp.com/www.eatwellexploreoften.com/wp-content/uploads/2020/04/Whipped-Matcha-Recipe-Pin.png?fit=683%2C1024&ssl=1)\n    \n\nDisclaimer:  _This post contains affiliate links. We may receive a small commission from any purchases, but at no cost for you and it helps keep our site running._"
  },
  {
    "url": "https://www.fitmittenkitchen.com/iced-matcha-latte/",
    "markdown": "# Iced Matcha Latte Recipe • Fit Mitten Kitchen\n_This post may contain affiliate links. Please read the [disclosure policy](https://www.fitmittenkitchen.com/contact/disclaimer/) for clarification._\n\nMaking the perfect iced matcha latte at home couldn’t be easier! It’s simple to make a healthy refreshing drink that tastes even better than Starbucks. You can use your favorite dairy-free milk for a delicious vegan option.\n\n[![close up view of iced matcha latte recipe in glass with metal straw](https://www.fitmittenkitchen.com/wp-content/uploads/2020/07/Iced-Matcha-Latte-6.jpg)](https://www.fitmittenkitchen.com/wp-content/uploads/2020/07/Iced-Matcha-Latte-6.jpg)\n\nTable of Contents\n\n*   [Why You’ll Love This](#why_youll_love_this \"Why You’ll Love This\")\n*   [What is Matcha?](#what_is_matcha \"What is Matcha?\")\n*   [Tips for the Perfect Matcha Latte](#tips_for_the_perfect_matcha_latte \"Tips for the Perfect Matcha Latte\")\n    *   [Pick a High Quality Matcha Powder](#pick_a_high_quality_matcha_powder \"Pick a High Quality Matcha Powder\")\n    *   [Pick Your Tool](#pick_your_tool \"Pick Your Tool\")\n*   [4 Ingredients for an Iced Matcha Latte](#4_ingredients_for_an_iced_matcha_latte \"4 Ingredients for an Iced Matcha Latte\")\n*   [Step-By-Step Directions](#step-by-step_directions \"Step-By-Step Directions\")\n    *   [Step 1 – Whisk Matcha + Hot Water](#step_1_%e2%80%93_whisk_matcha_hot_water \"Step 1 – Whisk Matcha + Hot Water\")\n    *   [Step 2 – Pour Matcha Over Ice](#step_2_%e2%80%93_pour_matcha_over_ice \"Step 2 – Pour Matcha Over Ice\")\n    *   [Step 3 – Add Milk](#step_3_%e2%80%93_add_milk \"Step 3 – Add Milk\")\n    *   [Step 4 – Taste!](#step_4_%e2%80%93_taste \"Step 4 – Taste!\")\n*   [Make a Flavored Matcha Latte](#make_a_flavored_matcha_latte \"Make a Flavored Matcha Latte\")\n*   [More Matcha Recipes to Love](#more_matcha_recipes_to_love \"More Matcha Recipes to Love\")\n*   [Iced Matcha Latte](#iced_matcha_latte \"Iced Matcha Latte\")\n\nOnce the weather starts getting warmer, iced matcha lattes are often in my drink rotation. There’s just something refreshing about drinking an iced latte on the front porch in the afternoon when it’s past coffee time.\n\n_Love matcha? Try my [Matcha Muffins](https://www.fitmittenkitchen.com/matcha-muffins/), [Matcha Scones](https://www.fitmittenkitchen.com/matcha-scones/) and my [Hot Matcha Latte recipe](https://www.fitmittenkitchen.com/spiced-matcha-latte-dairy-free-vegan-paleo/) if you’re looking for a hot latt_e _drink._\n\nWhy You’ll Love This\n--------------------\n\n*   **Easy to customize** – pick your favorite milk, sweetener, flavor additions!\n*   **Cheaper than Starbucks** – and better, too!\n*   Refreshing cold drink with **health benefits**.\n*   **Less caffeine than coffee**, if you’re looking for a little boost but can’t do coffee drinks.\n\nWhat is Matcha?\n---------------\n\nMatcha is ground green tea leaves, that have been ground into a fine powder.\n\nTips for the Perfect Matcha Latte\n---------------------------------\n\nBelow we are sharing a couple tips for how to make this easy matcha latte recipe. Mainly it comes down to the type of matcha powder and how you’re going to make it.\n\n[![overhead view of iced matcha latte with ice and metal straw](https://www.fitmittenkitchen.com/wp-content/uploads/2023/03/Iced-Matcha-Latte-Recipe-11.jpg)](https://www.fitmittenkitchen.com/wp-content/uploads/2023/03/Iced-Matcha-Latte-Recipe-11.jpg)\n\n### Pick a High Quality Matcha Powder\n\nWhen you’re making a matcha green tea latte, the hardest part is starting because you have to pick your matcha powder. There are so many options out there! What’s the difference between baking grade, ceremonial, culinary, etc.?\n\nWell, I’ve found **my favorite matcha powder** is this [**first harvest latte grade**](https://amzn.to/37W7gWi) powder.\n\nIf the brand you found doesn’t label their matcha green tea powder as “latte” grade, then be sure to select “**ceremonial grade matcha**” for the best flavor and quality. _Avoid “culinary grade” as that is meant for baking and cooking._\n\n### Pick Your Tool\n\nThe next part that can make or break having the perfect matcha latte is getting it smooth and perfectly blended.\n\nA lot of people use a bamboo matcha whisk (how matcha is traditionally made), but if you don’t have one, don’t let that stop you. You can use a [**milk frother**](https://amzn.to/37MAqZ6), [**this metal whisk**](https://amzn.to/3fNMT08) or even an [**immersion blender**](https://amzn.to/3uyrJLO).\n\n**_TIP:_** _For an iced latte, the immersion [blender](https://amzn.to/4aW5tjj) is my favorite way to get the powder completely dissolved with minimal effort._\n\n4 Ingredients for an Iced Matcha Latte\n--------------------------------------\n\nThis is an easy recipe with simple ingredients! You don’t need much:\n\n*   **matcha powder** – You want to be sure to buy a good quality matcha powder so your latte doesn’t have a bitter taste. [**This one**](https://amzn.to/37W7gWi) is my favorite. _Make sure you’re buying pure unsweetened matcha powder, and not a mix of different ingredients._\n*   **[maple syrup](https://rstyle.me/+_fDunjtLL7Et4SWZ3T_8Kw)** – For a lightly sweetened latte, [maple syrup](https://rstyle.me/+_fDunjtLL7Et4SWZ3T_8Kw) works great. You could also substitute agave nectar, honey or make a simple syrup as well.\n*   **milk** – My favorite milk for this recipe has been oat milk. But you could use almond milk, cashew milk, or coconut milk too. Hemp and soy also work! Whatever type of milk you have on hand is fine.\n*   **water** – Using boiling water helps the matcha powder to dissolve easily when being whisked.\n\nWant to Save This Recipe?\n\nEnter your email & I’ll send it right to your inbox.\n\nBy submitting this form, you consent to receive emails from Fit Mitten Kitchen.\n\n[![latte grade matcha powder on small white plate on marble board](https://www.fitmittenkitchen.com/wp-content/uploads/2023/03/Iced-Matcha-Latte-Recipe-1.jpg)](https://www.fitmittenkitchen.com/wp-content/uploads/2023/03/Iced-Matcha-Latte-Recipe-1.jpg)\n\nStep-By-Step Directions\n-----------------------\n\nMaking an iced matcha latte can be done in just a few minutes!\n\n### Step 1 – Whisk Matcha + Hot Water\n\nFirst things first, you’ll mix together the hot water and matcha green tea powder. You can do this with a handheld frother, immersion [blender](https://amzn.to/4aW5tjj), bamboo whisk in a matcha bowl or mini whisk in a cup. Just make sure there are no clumps of matcha in the water.\n\n**_TIP:_** _If you don’t have any of the above, shake it in a mason jar._\n\n[![matcha powder on plate next to ice in glasses and whisk in bowl of green matcha tea](https://www.fitmittenkitchen.com/wp-content/uploads/2023/03/Iced-Matcha-Latte-Recipe-4.jpg)](https://www.fitmittenkitchen.com/wp-content/uploads/2023/03/Iced-Matcha-Latte-Recipe-4.jpg)\n\n### Step 2 – Pour Matcha Over Ice\n\nI like to first add ice to a large cup, then pour the matcha over ice.\n\n### Step 3 – Add Milk\n\nThen finally add your milk of choice, give it a stir and taste test.\n\n_**TIP:** You could add a splash of vanilla or mint for some extra flavor_!\n\n[![milk pouring into iced matcha latte glass](https://www.fitmittenkitchen.com/wp-content/uploads/2023/03/Iced-Matcha-Latte-Recipe-6.jpg)](https://www.fitmittenkitchen.com/wp-content/uploads/2023/03/Iced-Matcha-Latte-Recipe-6.jpg)\n\n### Step 4 – Taste!\n\nIf you want a stronger latte, you can use more matcha powder or you can leave out the water. Just blend the matcha powder with an immersion [blender](https://amzn.to/4aW5tjj) for a few seconds to dissolve into the milk.\n\nLots of ways to make this and make it your own!\n\n[![up close image of iced matcha latte glass](https://www.fitmittenkitchen.com/wp-content/uploads/2023/03/Iced-Matcha-Latte-Recipe-9.jpg)](https://www.fitmittenkitchen.com/wp-content/uploads/2023/03/Iced-Matcha-Latte-Recipe-9.jpg)\n\nMake a Flavored Matcha Latte\n----------------------------\n\nThere are lots of ways to make this and make it your own.\n\nIf you’re looking to add a little more flavor to your matcha latte, try these ideas:\n\n*   add touch of **vanilla extract**\n*   blend in a **dash of cinnamon and turmeric** along with the matcha powder\n*   add some **[chai spices](https://www.fitmittenkitchen.com/chai-spice-recipe/)**_, my DIY blend linked_.\n*   make a **mint simple syrup**\n\nMore Matcha Recipes to Love\n---------------------------\n\n*   **[Matcha Coconut Butter Cups](https://www.fitmittenkitchen.com/5-ingredient-dark-chocolate-matcha-coconut-butter-cups-vegan/)**\n*   **[Matcha Overnight Oats](https://www.fitmittenkitchen.com/matcha-overnight-oats-protein/)**\n*   **[Matcha Cinnamon Rolls](https://www.fitmittenkitchen.com/matcha-cinnamon-rolls/)**\n\n**Let me know if you make this recipe by leaving a comment and rating below! It helps others learn more about the recipe too!**\n\n[Print](https://www.fitmittenkitchen.com/iced-matcha-latte/print/27751/)\n\n![milk pouring into iced matcha latte glass](https://www.fitmittenkitchen.com/wp-content/uploads/2023/03/Iced-Matcha-Latte-Recipe-6-150x150.jpg)\n\n_5 Stars_ _4 Stars_ _3 Stars_ _2 Stars_ _1 Star_\n\n5 from 1 review\n\nLearn how to make the perfect iced matcha latte recipe! Making a homemade latte couldn’t be easier and way better than Starbucks! Use your favorite non-dairy milk to make this vegan and paleo friendly.\n\n*   **Prep Time:** 5 minutes\n*   **Total Time:** 5 minutes\n*   **Yield:** 2 1x\n*   **Category:** Drinks\n*   **Method:** Iced\n*   **Cuisine:** Japenese-inspired\n*   **Diet:** Vegan\n\n*   1/4 cup **hot water**\n*   2 teaspoon **matcha powder,** to taste (latte grade or ceremonial grade)\n*   2–3 teaspoons **pure maple syrup**\n*   2 cups your favorite **non-dairy milk**  \n    \n\nCook Mode Prevent your screen from going dark\n\n1.  **Combine** hot water with matcha green tea powder; whisk until powder is dissolved. _You can also add sweetener here._\n2.  **Add** ice to 2 large cups; divide matcha mixture between two cups, pouring over ice.\n3.  **Add** 1 cup of milk to each cup; stir and enjoy! \n\n### Notes\n\nTry almond milk, cashew, hemp, soy or coconut for other vegan latte options.\n\nYou could use agave nectar or honey as well.\n\nDivide recipe in half for 1 serving.\n\n#### About Ashley\n\n\"Ashley Walterhouse is the founder of Fit Mitten Kitchen, based in the Greater Lansing Area of Michigan, AKA “the Mitten.” Ashley grew up as a picky eater but later discovered that eating healthy was actually easy and fun. She started FMK in 2015 as a way to share her newfound love of developing healthier recipes for all to enjoy.\"\n\nReader Interactions\n-------------------"
  },
  {
    "url": "https://sweetsimplevegan.com/2020/04/vegan-dalgona-matcha-latte/",
    "markdown": "Failed to convert"
  },
  {
    "url": "https://paleoglutenfree.com/recipes/whipped-dalgona-matcha-latte/",
    "markdown": "# Whipped Dalgona Matcha Latte - Paleo Gluten Free\n* * *\n\n![Whipped Dalgona Matcha Latte](https://paleoglutenfree.com/wp-content/uploads/2020/04/whipped-matcha-21-of-23-900x571.jpg)\n\nThis is my vegan version of the mesmerizing thick and fluffy Dalgona matcha latte. It’s smooth, creamy, and really fluffy! You only need a few ingredients that probably already have in the pantry!\n\n![How to make Tik Tok's viral whipped Dalgona latte without eggs! This is my vegan version of the mesmerizing thick and fluffy Dalgona matcha latte. It's smooth, creamy, and really fluffy! You only need a few ingredients that probably already have in the pantry!](https://paleoglutenfree.com/wp-content/uploads/2020/04/whipped-matcha-20-of-23-683x1024.jpg)\n\nHow to make Tik Tok’s viral whipped Dalgona latte without eggs…\n\n![How to make Tik Tok's viral whipped Dalgona latte without eggs! This is my vegan version of the mesmerizing thick and fluffy Dalgona matcha latte. It's smooth, creamy, and really fluffy! You only need a few ingredients that probably already have in the pantry!](https://paleoglutenfree.com/wp-content/uploads/2020/04/whipped-matcha-11-of-23-683x1024.jpg)\n\nYou will need:\n\n*   Canned chickpeas\n*   Sugar\n*   Matcha tea powder\n*   Almond milk\n*   A good electric mixer, like this [one](https://amzn.to/3bQcvaJ) or this [one](https://amzn.to/3bQmBIy).\n\n![How to make Tik Tok's viral whipped Dalgona latte without eggs! This is my vegan version of the mesmerizing thick and fluffy Dalgona matcha latte. It's smooth, creamy, and really fluffy! You only need a few ingredients that probably already have in the pantry!](https://paleoglutenfree.com/wp-content/uploads/2020/04/whipped-matcha-2-of-23-683x1024.jpg)\n\nThe result of mixing chickpea water, sugar, matcha, and almond milk is unexpectedly creamy, smooth, and delightful!\n\n![How to make Tik Tok's viral whipped Dalgona latte without eggs! This is my vegan version of the mesmerizing thick and fluffy Dalgona matcha latte. It's smooth, creamy, and really fluffy! You only need a few ingredients that probably already have in the pantry!](https://paleoglutenfree.com/wp-content/uploads/2020/04/whipped-matcha-14-of-23-685x1024.jpg)\n\nThe thick fluffy egg white version holds it’s form better, it’s true.\n\nEven so, I prefer the convenience, smooth texture, and over all flavor of the aquafaba latte- it’s less rich and heavy, if that makes sense.\n\n![How to make Tik Tok's viral whipped Dalgona latte without eggs! This is my vegan version of the mesmerizing thick and fluffy Dalgona matcha latte. It's smooth, creamy, and really fluffy! You only need a few ingredients that probably already have in the pantry!](https://paleoglutenfree.com/wp-content/uploads/2020/04/whipped-matcha-23-of-23-683x1024.jpg)\n\n**To make the extra fluffy version with eggs whites:**\n\n1.  Heat 1/2 cup sugar and 1/2 cup water together in a small saucepan on the stove for 3-5 minutes.\n2.  Mix 2 egg whites in an electric mixer until they form still peaks. Mixing on low, pour sugar/water mixture and matcha tea into egg whites. Mix until _just_ combined and serve over milk.\n\n![How to make Tik Tok's viral whipped Dalgona latte without eggs! This is my vegan version of the mesmerizing thick and fluffy Dalgona matcha latte. It's smooth, creamy, and really fluffy! You only need a few ingredients that probably already have in the pantry!](https://paleoglutenfree.com/wp-content/uploads/2020/04/whipped-matcha-22-of-23-683x1024.jpg)\n\n[](https://paleoglutenfree.com/recipes/whipped-dalgona-matcha-latte/print)\n\nPrint Recipe\n\nWhipped Dalgona Matcha Latte\n\nHow to make Tik Tok's viral whipped Dalgona latte without eggs! This is my vegan version of the mesmerizing thick and fluffy Dalgona matcha latte. It's smooth, creamy, and really fluffy! You only need a few ingredients that probably already have in the pantry!\n\nIngredients\n\n*   3/4 cup [aquafaba](https://paleoglutenfree.com/ingredient/aquafaba/) the liquid from canned chickpeas\n*   4-8 tablespoons [sugar](https://paleoglutenfree.com/ingredient/sugar/) to taste\n*   4 servings/teaspoons [matcha tea powder](https://paleoglutenfree.com/ingredient/matcha-tea-powder/) to taste\n*   4 cups [almond milk](http://amzn.to/2iUURXU) or other nut milk\n\nVotes: 3  \nRating: 5  \nYou:\n\nRate this recipe!\n\nRecipe Notes\n\n**To make the extra fluffy version with eggs whites:**\n\n1.  Heat 1/2 cup sugar and 1/2 cup water together in a small saucepan on the stove for 3-5 minutes.\n2.  Mix 2 egg whites in an electric mixer until they form still peaks. Mixing on low, pour sugar/water mixture and matcha tea into egg whites. Mix until _just_ combined and serve over milk.\n\n\n\nInstructions\n\n1.  Drain a can of chickpeas and put the liquid called aquafaba in a bowl and whip with an electric mixer until white and fluffy- you will know when you are done whipping when the quafaba forms stiff white peaks.\n    \n2.  Slowly add sugar and matcha tea powder and blend on low until just combined- do not over mix or the aquafaba will loose its fluffiness the longer you mix!\n    \n3.  For an iced matcha latte, fill serving glasses with ice cubes and almond milk. For a hot matcha latte, heat almond milk and put in mugs.\n    \n4.  Pour fluffy tea mixture over milk and stir well until combined- if you don't combine the tea with the milk well enough, the aquafaba and matcha taste will be too strong, so I suggest mixing it well before drinking!\n    \n\n"
  },
  {
    "url": "https://craftteafox.co/",
    "markdown": "# \n    Crafti | Feel Good Superfoods\n  \nThis store requires javascript to be enabled for some features to work correctly.\n\nGet 1 week of _free_ Matcha\n---------------------------\n\nwith every Matcha Starter Kit.\n\nA _personalised_\n----------------\n\nMatcha gift.\n------------\n\nShare the love with an engraved Matcha Whisk Set.\n\nSay goodbye to constipation. _Gently_.\n--------------------------------------\n\nPacked with prebiotics - for regular bowel movements without side effects.\n\nBest Sellers\n------------\n\nCeremonial Matcha\n-----------------\n\n[![](https://cdn.shopify.com/s/files/1/0266/0607/5958/files/Ceremonial_Uji_Matcha_100g_no_bg_-_front_web_res_2048x2048.png?v=1708325723)](https://getcrafti.co/collections/tea-tins/products/ceremonial-uji-matcha-powder-30g)\n\nKyoto Mornings\n--------------\n\n![](https://ucarecdn.com/b28fac45-9f94-4e0a-857a-e022cca4b18c/-/format/auto/-/preview/2048x2048/-/quality/lighter/Product%20Image%201.png)\n\nA full-featured Matcha gift set.\n\nMatcha Starter Kit\n------------------\n\n![](https://ucarecdn.com/43539135-4043-4db6-9f95-f10143171fe4/-/format/auto/-/preview/2048x2048/-/quality/lighter/Product%20Image%202.png)\n\nGet started making Matcha.\n\n![](https://cdn.shopify.com/s/files/1/0266/0607/5958/files/1_28.png?v=1717985991)\n\n![](https://cdn.shopify.com/s/files/1/0266/0607/5958/files/1_28.png?v=1717985991)\n\nAs Seen On\n----------\n\n\"...specialises in genuine Japanese teas.\"\n\n![](https://cdn.shopify.com/s/files/1/0266/0607/5958/files/Website_Press_Logos_3_3000x3000.png?v=1689415159)\n\n\"... passionate about craft Matcha.\"\n\n![](https://cdn.shopify.com/s/files/1/0266/0607/5958/files/2_3000x3000.png?v=1689414887)\n\n\"Crafti's \\[...\\] umami-rich and fine Matcha... stands out from the rest.\"\n\n![](https://cdn.shopify.com/s/files/1/0266/0607/5958/files/5_2_3000x3000.png?v=1689414887)\n\n\"Obsessed with Matcha or Hojicha? Get the best of both worlds.\"\n\n![](https://cdn.shopify.com/s/files/1/0266/0607/5958/files/3_7a55be20-52ec-4a1d-9ef7-099f00a2f3db_3000x3000.png?v=1689414887)\n\n\"One of the trendiest teas of our time.\"\n\n![](https://cdn.shopify.com/s/files/1/0266/0607/5958/files/4_3000x3000.png?v=1689414887)\n\n\"Recommended... a fresh and vibrant colour.\"\n\n![](https://cdn.shopify.com/s/files/1/0266/0607/5958/files/7_2_3000x3000.png?v=1689414886)\n\n\"Crafti knows their Matcha, alright.\"\n\n![](https://cdn.shopify.com/s/files/1/0266/0607/5958/files/6_3000x3000.png?v=1689414886)\n\nNew Arrivals\n------------\n\nCeremonial Reserve\n------------------\n\n![](https://cdn.shopify.com/s/files/1/0266/0607/5958/files/CR_tin_no_bg_1_2048x2048.png?v=1708598829)\n\nLuxury-grade organic matcha\n\nGentle Go Digestive Tea\n-----------------------\n\n[![](https://cdn.shopify.com/s/files/1/0266/0607/5958/files/Gentle_Go_Render_revised_web_res_2048x2048.png?v=1708598373)](https://getcrafti.co/collections/tea-tins/products/ceremonial-uji-matcha-powder-30g)\n\nCrafti Glass Mug\n----------------\n\n![](https://cdn.shopify.com/s/files/1/0266/0607/5958/files/glass_mug_no_bg_2048x2048.png?v=1708599751)\n\nCrafted by Artisans, \n---------------------\n\nfor Your Health.\n----------------\n\n![](https://cdn.shopify.com/s/files/1/0266/0607/5958/files/Crafti_Icons-16_0a26b35e-f6dc-4376-976c-b974c2b50d97_3000x3000.png?v=1708682879)\n\nTea that tastes good, so you don't add unhealthy junk. \n\n![](https://cdn.shopify.com/s/files/1/0266/0607/5958/files/Crafti_Icons-17_fd4e4900-ff3c-4af3-ae2f-bd71127fd78d_3000x3000.png?v=1708682879)\n\nWe support the craft of artisan farming communities in Japan.\n\n![](https://cdn.shopify.com/s/files/1/0266/0607/5958/files/Crafti_Icons-15_99e54f02-a0c7-4859-b5f2-684e96eb0ac8_3000x3000.png?v=1708682879)\n\nWe offer great tasting tea made with traditional techniques.\n\n![](https://cdn.shopify.com/s/files/1/0266/0607/5958/files/Crafti_Icons-16_0a26b35e-f6dc-4376-976c-b974c2b50d97_3000x3000.png?v=1708682879)\n\nTea that tastes good, so you don't add unhealthy junk.\n\n![](https://cdn.shopify.com/s/files/1/0266/0607/5958/files/Crafti_Icons-17_fd4e4900-ff3c-4af3-ae2f-bd71127fd78d_3000x3000.png?v=1708682879)\n\nWe support the craft of artisan farming communities in Japan.\n\n![](https://cdn.shopify.com/s/files/1/0266/0607/5958/files/Crafti_Icons-15_99e54f02-a0c7-4859-b5f2-684e96eb0ac8_3000x3000.png?v=1708682879)\n\nWe offer great tasting tea made with traditional techniques.\n\nUs vs The Rest\n--------------\n\n![](https://cdn.shopify.com/s/files/1/0266/0607/5958/files/TRANSPARENT_Crafti_Logo_-_1_march_2023-04_3000x3000.png?v=1689328611)\n\nBitter, tastes like grass\n\nNope, sits on shelves for ages.\n\nRefrigerated for max freshness.\n\nDepends on storage conditions.\n\n_\\*Applies to Ceremonial Organic Uji Matcha. Certified organic by Japanese Agricultural Standards._\n\nTrusted by Cafes & Baristas\n---------------------------\n\nBarista-quality Matcha. For real.\n\nLoved By Our Communiti\n----------------------\n\nOver 1,000 5-star reviews from our customers.\n\n![](https://cdn.shopify.com/s/files/1/0266/0607/5958/files/2_1_d976715a-f4ec-448b-b8af-73e3798f8986_3000x3000.jpg?v=1689418984)\n\nDrink it almost everyday. My acne is getting better!\n\n![](https://cdn.shopify.com/s/files/1/0266/0607/5958/files/1_1_bafe7985-88d1-4ec9-8aef-ca524e5abdbb_3000x3000.jpg?v=1689418983)\n\nSwitched from coffee. Love the rich taste... feel calm and relaxed.\n\n![](https://cdn.shopify.com/s/files/1/0266/0607/5958/files/6_1_3000x3000.jpg?v=1689418983https://cdn.shopify.com/s/files/1/0266/0607/5958/files/3_1_52c6e4fe-a3e5-4e11-b13f-56b4204678e8_3000x3000.jpg)\n\nI highly recommend this Matcha... this is sure to impress.\n\n![](https://cdn.shopify.com/s/files/1/0266/0607/5958/files/4_1_3000x3000.jpg?v=1689418983)\n\nMy digestion has improved a lot. Really fresh and sweet!\n\n![](https://cdn.shopify.com/s/files/1/0266/0607/5958/files/5_1_3000x3000.jpg?v=1689418983)\n\nLike that my skin is smoother and slowly clearing up my acne!\n\n![](https://cdn.shopify.com/s/files/1/0266/0607/5958/files/3_1_52c6e4fe-a3e5-4e11-b13f-56b4204678e8_3000x3000.jpg?v=1689418983)\n\nWanted alternate days. Ended up drinking everyday! Love it!\n\nOur Mission\n-----------\n\nHelping you feel good and live fully through better health, with the power of feel good superfoods.\n\n![](https://cdn.shopify.com/s/files/1/0266/0607/5958/files/Crafti_Cup_among_leaves-3_small_web_res_3000x3000.jpg?v=1689417229)\n\n![](https://ucarecdn.com/ebba41f7-138f-4a4b-a12e-e1d8499ed70e/-/format/auto/-/preview/3000x3000/-/quality/lighter/reflection.jpg)\n\nOur Feel Good Guarantee\n-----------------------\n\nWe're so confident you'll love our products, we offer a 30-Day Feel Good Guarantee. \n\nIf you're unsatisfied with our products in any way, we’ll give you a refund immediately - no return necessary. \n\n![](https://ucarecdn.com/85c76fb0-95e5-4c37-a1b1-dad01dd3d065/-/format/auto/-/preview/3000x3000/-/quality/lighter/reflection.jpg)\n\n![](https://ucarecdn.com/2f2341f9-02ef-47ad-8558-e10bc5fbc214/-/format/auto/-/preview/3000x3000/-/quality/lighter/package-box.png)\n\n### Free Shipping\n\nEasy, free shipping in Singapore for orders above $20.\n\n![](https://ucarecdn.com/3db3d19c-d698-4c0e-9bfd-5b0dc67a4db5/-/format/auto/-/preview/3000x3000/-/quality/lighter/guarantee.png)\n\n### 30-Day Feel Good Guarantee\n\nNot happy with our products for any reason? Get a full refund within 30 days.\n\n![](https://ucarecdn.com/f179b321-11d8-4e4b-87b9-914ca8429b5c/-/format/auto/-/preview/3000x3000/-/quality/lighter/headphones.png)\n\n### Award-Winning Support\n\nGet after-sales support from our Matcha Experience Team via live chat or email.\n\n![](https://cdn.shopify.com/s/files/1/0266/0607/5958/files/Open_Tin_16-9_Web_Res_3000x3000.png?v=1689422200)"
  },
  {
    "url": "https://www.darngoodveggies.com/matcha-basil-lemonade/",
    "markdown": "# Matcha Basil Lemonade - Darn Good Veggies\n10 minute Matcha Basil Lemonade is a refreshing summer drink sweetened with honey! This healthy beverage is paleo and full of antioxidants.\n\n![10 minute Matcha Basil Lemonade is a refreshing summer drink sweetened with honey! This healthy beverage is paleo and full of antioxidants. | CatchingSeeds.com](https://www.darngoodveggies.com/wp-content/uploads/2018/07/IMG_3092.jpg)\n\nNothing quite reminds me of summer like a long hot day on the water and a refreshing glass of lemonade. Since I can't head to the water each  day this summer - though I am tempted to abandon my job and pitch a tent by the lake with a jug of lemonade for the next two months - I am sipping this refreshing summer sipper all day long to bring the sunshine inside.\n\nMatcha Basil Lemonade is fresh, its fun, its healthy, and it's summer in a glass.\n\n![10 minute Matcha Basil Lemonade is a refreshing summer drink sweetened with honey! This healthy beverage is paleo and full of antioxidants. | CatchingSeeds.com](https://www.darngoodveggies.com/wp-content/uploads/2018/07/IMG_3010.jpg)\n\nMatcha Basil Lemonade might sound fancy, and boy does it taste fancy (in the good way), but I am happy to report that it is much easier than pie.\n\nAll you have to do is soak your whole basil leaves (no chopping, dicing, or pureeing FTW!) in hot water to unlock their subtle flavors. You'll also add the honey in with this step so there's no perpetual stirring of the Matcha Basil Lemonade to get it to dissolve.\n\nThe hardest part? Squeezing fresh lemons. But even that is made 100% easier with one of these handy dandy [lemon squeezers](https://www.amazon.com/Rated-Zulay-Premium-Quality-Squeezer/dp/B00YBP918M/ref=sr_1_1_sspa?s=kitchen&ie=UTF8&qid=1531339025&sr=1-1-spons&keywords=lemon+squeezer&psc=1&_encoding=UTF8&tag=catchingsee00-20&linkCode=ur2&linkId=43b795e1e990ddb00f1e4c4afc6cac8e&camp=1789&creative=9325)![](https://ir-na.amazon-adsystem.com/e/ir?t=catchingsee00-20&l=ur2&o=1). Fresh lemon juice in 60 seconds, here we come!\n\n![10 minute Matcha Basil Lemonade is a refreshing summer drink sweetened with honey! This healthy beverage is paleo and full of antioxidants. | CatchingSeeds.com](https://www.darngoodveggies.com/wp-content/uploads/2018/07/IMG_2860.jpg)\n\nLet me just end this post by saying that I may have added a shot of vodka to this Matcha Basil Lemonade once or twice. Or three times. And the verdict, delicious.\n\n[Print](https://www.darngoodveggies.com/matcha-basil-lemonade/print/7206/)\n\n* * *\n\n### Description\n\n10 minute Matcha Basil Lemonade is a refreshing summer drink sweetened with honey! This healthy beverage is paleo and full of antioxidants.\n\n* * *\n\n*   10 basil leaves\n*   2 cups boiling water\n*   ¼ cup honey\n*   ½ cup fresh squeezed lemon juice\n*   1 teaspoon matcha\n\nCook Mode Prevent your screen from going dark\n\n* * *\n\n1.  Place the basil and boiling water in a bowl and steep for 10 minutes. Strain out the basil and stir in the honey. Place the matcha in a small bowl. Add in ¼ cup of the basil water and mix with a bamboo whisk until the matcha is smooth and clump free.\n2.  Add the matcha back into the basil water along with the lemon juice and 2 cups of cold water. Stir to combine, pour over ice, and serve.\n\n* * *\n\n* * *\n\n### Nutrition\n\n*   **Serving Size:** 0\n*   **Sugar:** 0\n*   **Sodium:** 0\n*   **Fat:** 0\n*   **Saturated Fat:** 0\n*   **Trans Fat:** 0\n*   **Carbohydrates:** 0\n*   **Fiber:** 0\n*   **Protein:** 0\n*   **Cholesterol:** 0\n\n![10 minute Matcha Basil Lemonade is a refreshing summer drink sweetened with honey! This healthy beverage is paleo and full of antioxidants. | CatchingSeeds.com](https://www.darngoodveggies.com/wp-content/uploads/2018/07/Matcha-Basil-Lemonade-01-01.png)\n\nReader Interactions\n-------------------"
  }
]