[
  {
    "url": "https://juliasalbum.com/shrimp-avocado-salad/",
    "ingredients": [
      "I love making salads that include protein. This shrimp avocado salad is **healthy, filling, satisfying, and light**. It's a well-balanced meal that combines veggies (avocado and arugula), protein (shrimp), a small amount of your favorite fruit (I used mango), and nuts (I used pine nuts). It's **super-versatile and flexible**, and you can use a wide variety of ingredients and substitutions (see more on that below the recipe card). I've made it so many times this Summer because it definitely became one of my family's most requested salads! This recipe is a great way to dress up and give so much flavor to **the store-bought pre-cooked shrimp**. Or cook raw shrimp from scratch using one of my recipes: [shrimp scampi with capers](https://juliasalbum.com/shrimp-scampi/) or [cilantro-lime shrimp](https://juliasalbum.com/cilantro-lime-shrimp/)",
      "This light and refreshing salad takes under 20 minutes to make, which is great for busy weeknights. You only need **6 main ingredients** - shrimp, avocado, spinach, mango, pine nuts, and red onions.  The salad dressing is made with only 3 ingredients (honey, lime juice, and olive oil). Shrimp avocado salad also makes a stunning presentation - perfect for sharing with the crowd! **Bring this Summer salad to picnics, potlucks, barbecue parties, and other outdoor Summer festivities.** Or, serve it indoors for those special occasions when you want to impress your guests without spending too much time in the kitchen.",
      "*   **Packed with nutrients.** Shrimp avocado salad combines so many good-for-you ingredients. It's highly nutritious, packed with fiber and protein, and low in calories. It's gluten-free and dairy-free. It's also pescatarian - perfect for vegetarians who incorporate seafood into their diets.  It will make a delicious healthy addition to the list of your family's favorites.",
      "*   **Salad dressing.** The simple salad dressing is made with only 3 ingredients (honey, lime juice, and olive oil). You can also use maple syrup and lemon juice."
    ]
  },
  {
    "url": "https://somethingnutritiousblog.com/arugula-citrus-salad/",
    "ingredients": [
      "Now that the weather is starting to get warmer, I’m all about light and fresh salads during the week. This arugula citrus salad is filled with so many feel-good ingredients, and is the perfect lunch to serve as is or with a grilled piece of protein.",
      "*   Add the quinoa and vegetable broth to a sauce pan and bring it to a boil. Once boiling, cover the pot and reduce the heat to let it simmer for 15-20 minutes, until all the liquid is absorbed. Remove the pot from the heat and it let sit for 10 minutes while you prepare your salad ingredients. After 10 minutes, fluff with a fork and season with a little salt.",
      "*   Prepare your salad dressing by combining all of the ingredients together."
    ]
  },
  {
    "url": "https://pretenditsadonut.com/2018/09/04/roasted-delicata-squash-with-chipotle-aioli/",
    "ingredients": []
  },
  {
    "url": "https://evseats.com/cuban-chicken-black-bean-rice-bowls/",
    "ingredients": [
      "This recipe is special for me as it is near and dear to my heart. One of the reasons I fell in love with cooking was because I always had strong, positive female role models who always took such care and pride in preparing meals for their loved ones. From my grandma, to my mom, down to my aunties they showed me how to put love in food, and how it was the most important ingredient. Recently I lost one of my aunties, and I want to dedicate this post and recipe to her.",
      "1.  To a blender, combine the ingredients for the chicken marinade. Add the cumin, chili powder, dried oregano, salt and pepper, 4 cloves garlic, zest and juice of 1 orange, and the zest and juice of 1 lime to the blender. Blend together until everything is finely chopped and smooth."
    ]
  },
  {
    "url": "https://www.walderwellness.com/grilled-zucchini-goat-cheese-basil-honey/",
    "ingredients": [
      "It’s SO easy to cook, uses only 5 ingredients _(plus salt + pepper)_, and adds such a fun punch of flavour to zucchini. I think you’re gonna love this one!",
      "As a [dietitian](https://www.walderwellness.com/about/), I create recipes with whole food ingredients that provide the nutrients needed for optimal health. My nutrition philosophy does not focus on numbers; however, I understand that this information can be helpful."
    ]
  },
  {
    "url": "https://jz-eats.com/quinoa-apple-salad/",
    "ingredients": []
  },
  {
    "url": "https://dishingouthealth.com/chicken-cashew-salad/",
    "ingredients": []
  },
  {
    "url": "https://www.closetcooking.com/zucchini-enchilada-roll-ups/",
    "ingredients": []
  },
  {
    "url": "https://ncyclopaedia.com/category/health/delicious-recipes/",
    "ingredients": []
  },
  {
    "url": "http://thestayathomechef.com/blackberry-basil-ricotta-pizza/",
    "ingredients": []
  },
  {
    "url": "https://www.chelseasmessyapron.com/peanut-chicken-lettuce-wraps/",
    "ingredients": []
  },
  {
    "url": "http://www.halfbakedharvest.com/blueberry-vanilla-greek-yogurt-granola-bars/",
    "ingredients": []
  },
  {
    "url": "https://www.ambitiouskitchen.com/grilled-corn-salad/?utm_medium=social&utm_source=pinterest&utm_campaign=tailwind_smartloop&utm_content=smartloop&utm_term=71085285",
    "ingredients": []
  },
  {
    "url": "http://www.lordbyronskitchen.com/homemade-mediterranean-flatbread/",
    "ingredients": [
      "This recipe will work perfectly with focaccia, even though it’s a very thick type of flatbread. Naan works very well! Roti will work well too, especially if you’re looking for unleavened bread. (Unleavened is a term that applies to breads that do not include an ingredient such as yeast which makes the bread rise and proof. Most flat types of bread and unleavened breads.)",
      "I refuse to eat black olives, but John.e loves them. To date, there are over 500 recipes here at Lord Byron’s Kitchen, and this is only the second recipe that features black olives. My [**_Warm Farro Salad_**](https://www.lordbyronskitchen.com/warm-farro-salad/) has black olives in it too. I can’t make _all_ of the recipes for myself. I have to be nice and make a recipe or two with ingredients that I don’t really care for, right?",
      "Now, just because this particular flatbread is modelled after common Mediterranean ingredients, that doesn’t mean you are stuck making your version the exact same way. You can add any toppings you like to your flatbread. You can even make one very large flatbread or two smaller ones like I made.",
      "The following is a list of the ingredients needed to prepare this recipe. For exact amounts and measurements, refer to the printable recipe card located near the bottom of this post.",
      "*   **_Active Dry Yeast_** – Do not confuse this with Instant Yeast. Active dry yeast needs to be dissolved in water before using, while instant yeast can be mixed right into dry ingredients.",
      "Active Dry Yeast and Instant Yeast are essentially the same thing and both of them will give you the same result in the end. The difference is that active dry yeast works more slowly than instant yeast and is often used in recipes where water is mixed with the yeast to activate it before the dry ingredients are added to prepare the dough. In contrast, instant yeast works much faster and does not need to be activated by water. It is almost always mixed right into the dry ingredients.",
      "_**Unlike the popular popper which is usually stuffed and fried, Jalapeno Popper Flatbread has many of the same ingredients, and is baked to perfection. All of the flavour you’d expect from a jalapeno popper, but without the hassle of deep-frying! Who’s ready to get their spice on!?**_"
    ]
  },
  {
    "url": "http://www.kitschencat.com/lemon-balsamic-summer-pasta-salad/",
    "ingredients": []
  },
  {
    "url": "https://juliasalbum.com/butternut-squash-pasta-with-sausage-and-spinach/",
    "ingredients": [
      "This roasted butternut squash pasta is one of those rare pasta recipes that combine both comfort food deliciousness and healthy ingredients. This pasta is surely comforting yet it's packed with fiber and nutrients.  A perfect family weeknight dinner!",
      "![ingredients for Creamy Butternut Squash Pasta with Sausage and Spinach and Parmesan Cream Sauce in a stainless steel pan](https://juliasalbum.com/wp-content/uploads/2020/11/butternut-squash-pasta-with-sausage-and-spinach-10.jpg \"Creamy Butternut Squash Pasta with Sausage and Spinach\")",
      "![ingredients for Creamy Butternut Squash Pasta with Sausage and Spinach in a stainless steel pan](https://juliasalbum.com/wp-content/uploads/2020/11/butternut-squash-pasta-with-sausage-and-spinach-4.jpg \"Creamy Butternut Squash Pasta with Sausage and Spinach\")"
    ]
  },
  {
    "url": "https://peasandcrayons.com/2019/03/mediterranean-pasta-salad.html",
    "ingredients": [
      "Being a food blogger means I’m often playing a never-ending game of Chopped in which I have to use up all the random ingredients I buy for one recipe up by creating other recipes with the leftovers.",
      "This peppery leafy green was the \\*perfect\\* not-so-secret ingredient for this tasty Mediterranean pasta salad!",
      "I’m a big fan of homemade salad dressing because 1. They’re CRAZY quick + easy to make and 2. I pretty much always have all the ingredients I need lying around.",
      "*   First let's make the dressing! Zest 1 lemon and set aside. Juice your lemons to yield 1/4 cup of juice and add to a small/medium mason jar. Add lemon zest and remaining dressing ingredients and close lid tightly. Shake to emulsify the dressing."
    ]
  },
  {
    "url": "https://themovementmenu.com/roasted-delicata-squash-salad/",
    "ingredients": []
  },
  {
    "url": "https://www.myeclecticbites.com/30-minutes-mushroom-spinach-white-pizza/",
    "ingredients": [
      "*   **Ricotta cheese** - this is an equivalent ingredient to a white sauce",
      "*   Red pepper flakes are totally optional. If you don't like spicy food, please skip this ingredient altogether. "
    ]
  },
  {
    "url": "http://www.eatingwell.com/gallery/2057522/30-day-anti-inflammatory-dinner-plan/?utm_source=pinterest.com&utm_medium=social&utm_campaign=eatingwell_eatingwell_13103191&utm_content=mealplans_designed_&utm_term=MealPlan_202012",
    "ingredients": [
      "To make this 20-minute vegan curry even faster, buy precut veggies from the salad bar at the grocery store. To make it a full, satisfying dinner, serve over cooked brown rice. When shopping for simmer sauce, look for one with 400 mg of sodium or less and check the ingredient list for cream or fish sauce if you want to keep this vegan. If you like a spicy kick, add a few dashes of your favorite hot sauce at the end.",
      "This healthy chicken soup recipe gets bold Moroccan flavor from sweet potatoes, cumin, cinnamon, cayenne pepper and a touch of fiery harissa. To get a homemade stock flavor using store-bought broth, we simmer bone-in chicken breasts in the broth before adding the rest of the soup ingredients."
    ]
  },
  {
    "url": "https://dishingouthealth.com/quinoa-power-bowls-with-maple-chipotle-brussels-and-smoky-butternut-squash/",
    "ingredients": []
  },
  {
    "url": "https://thealmondeater.com/autumn-harvest-bowl/",
    "ingredients": []
  },
  {
    "url": "https://iamhomesteader.com/bang-bang-chicken-skewers/",
    "ingredients": []
  },
  {
    "url": "https://www.instrupix.com/homemade-cinnamon-sugar-pecans/",
    "ingredients": []
  },
  {
    "url": "https://www.eatwell101.com/roasted-potatoes-carrots-zucchini-recipe",
    "ingredients": []
  },
  {
    "url": "https://www.foxandbriar.com/autumn-harvest-salad-with-pomegranates/",
    "ingredients": []
  },
  {
    "url": "https://reciperunner.com/parmesan-pesto-roasted-cauliflower/?utm_source=pinterest&utm_medium=social&utm_campaign=grow-social-pro",
    "ingredients": [
      "_Looking for a quick and easy side dish to go with your next meal? Try this parmesan pesto roasted cauliflower! It’s got lots of flavor from the pesto and a nice salty bite from the parmesan cheese. Plus, you only need four ingredients to make it!_",
      " ![ingredients for Parmesan Pesto Roasted Cauliflower on a sheet pan](https://reciperunner.com/wp-content/uploads/2017/02/parmesan-pesto-roasted-cauliflower-ingredients-photo.jpg)"
    ]
  },
  {
    "url": "https://eatthegains.com/roasted-butternut-squash-with-goat-cheese-pomegranates-and-rosemary/",
    "ingredients": []
  },
  {
    "url": "https://www.purewow.com/food/mediterranean-diet-snacks?utm_source=pinterest&utm_medium=social",
    "ingredients": []
  },
  {
    "url": "https://www.themediterraneandish.com/stuffed-peppers-recipe/",
    "ingredients": []
  },
  {
    "url": "https://www.chelseasmessyapron.com/triple-berry-spinach-salad-candied-pecans/",
    "ingredients": [
      "*   Combine all of the dressing ingredients, except the poppy seeds, in a blender and process until combined. Taste and adjust any flavors to personal preference. If you'd like a sweeter dressing, add an additional 1-2 teaspoons white sugar. Stir in the poppy seeds. Store in an airtight container in the fridge until ready to serve. (Dressing stays good for 1 week stored in an airtight container in the fridge.)",
      "We do our best to provide accurate nutritional analysis for our recipes. Our nutritional data is calculated using a third-party algorithm and may vary, based on individual cooking styles, measurements, and ingredient sizes. Please use this information for comparison purposes and consult a health professional for nutrition guidance as needed."
    ]
  },
  {
    "url": "http://www.eatingwell.com/gallery/7527550/you-just-started-the-mediterranean-diet-here-are-the-recipes-to-make-first/?utm_source=pinterest.com&utm_medium=social&utm_campaign=eatingwell_eatingwell_10225941&utm_content=mediterranean_designed_&utm_term=Mediterranean_202001",
    "ingredients": []
  },
  {
    "url": "https://www.countrycleaver.com/2017/08/blackberry-thyme-baked-brie-en-croute.html",
    "ingredients": []
  },
  {
    "url": "http://aberdeenskitchen.com/2015/04/15/southwest-chipotle-salad-with-homemade-tortilla-strips/",
    "ingredients": [
      "Also, this recipe is a great way if you, like myself, always seem to have an over abundance of corn tortillas hanging around your pantry. The tortilla strips are SO GOOD! I find myself munching on them while I toss the rest of the ingredients together. Find a decent hiding place for them or there'll be none left to garnish this colorful, delectable salad!"
    ]
  },
  {
    "url": "https://www.halfbakedharvest.com/pesto-chicken-and-avocado-bacon-salad-wraps/",
    "ingredients": [
      "It’s simply chicken tenders, tossed with olive oil, either cajun seasoning or fajita seasoning, and black pepper. Literally just three ingredients, but this mix is a go-to for me. I gave you the recipe in the notes section, so you can use that, or as I said, use leftover chicken.",
      "Traditional pesto is a blend of fresh basil, garlic, pine nuts, extra-virgin olive oil, and Parmesan cheese (you can hold on the cheese for a vegan variety). Use a food processor to easily mix up your pesto! It was traditionally made by mixing the ingredients with a mortar and pestle.",
      "Yes! All of the ingredients in pesto have health benefits and the fat source is considered unsaturated.",
      "*   1\\. To make the dressing. Combine all ingredients in a bowl or glass jar. Taste and adjust the salt and pepper.",
      "    3\\. Place one tortilla at a time in the microwave for 20 seconds. Spread on a layer of pesto, then add the salad, chicken, bacon, and cheese. Drizzle over more dressing. Fold the tortilla over the ingredients. Fold sides and ends of tortillas over filling and roll forward. Repeat with remaining ingredients."
    ]
  },
  {
    "url": "https://inspiredbycharm.com/sausage-rice-and-cranberry-stuffed-mini-pumpkins/",
    "ingredients": []
  },
  {
    "url": "http://www.cookingwithcocktailrings.com/mains/2017/ground-turkey-brown-butter-sage-stuffing-filled-roasted-mini-pumpkins",
    "ingredients": []
  },
  {
    "url": "https://www.wellseasonedstudio.com/peach-burrata-salad/",
    "ingredients": []
  },
  {
    "url": "https://littlespicejar.com/honey-chipotle-chicken-bowls/",
    "ingredients": []
  },
  {
    "url": "https://www.modernhoney.com/boursin-cheese-baked-tiktok-pasta/",
    "ingredients": []
  },
  {
    "url": "https://www.joyousapron.com/slow-cooker-chicken-burrito-bowl/",
    "ingredients": [
      "Well, maybe a little effort. 😉 As little as combining all the ingredients into the slow cooker.",
      "These ingredients are:",
      "That is right. Made out of quality ingredients, they make amazing marinades for your favorite protein. Like mind-blowing, over-the-fence, cannot-get-enough kind of incredible.",
      "Serve the chicken with some (or all) of these yummy ingredients. Mix and match to your heart’s content. Make the Chicken Burrito Bowl of your dream.",
      "Best of all, these ingredients take little to no time to prepare:",
      "Absolutely! Store in an airtight container in either the refrigerator or freezer. If you are storing it in the refrigerator, consume within 5 days. They store really well and make great leftovers and meal prep! Store ingredients separately and tailor make your Chicken Burrito Bowl when ready to eat!",
      "#### Other ingredients for the bowl",
      "*   Add all \"Slow Cooker Mexican Chicken\" ingredients to slow cooker. Set on high and cook for 4 hours.",
      "*   Prepare the other ingredients – cook rice, heat up frozen corn and black beans in the microwave, chop cilantro, dice avocados, cut lime into wedges. (See Note 1)"
    ]
  },
  {
    "url": "http://togetherasfamily.com/2017/05/honey-cilantro-lime-grilled-chicken-rice-bowls/",
    "ingredients": []
  },
  {
    "url": "https://www.ambitiouskitchen.com/carrot-arugula-salad/",
    "ingredients": []
  },
  {
    "url": "https://www.howsweeteats.com/2021/05/strawberry-salad/",
    "ingredients": []
  },
  {
    "url": "https://fitslowcookerqueen.com/video-slow-cooker-instant-pot-chicken-fajitas-low-carb-paleo-whole30/",
    "ingredients": [
      "This **slow cooker chicken fajitas** recipe only has 5 ingredients: chicken, onions, bell peppers, diced tomatoes, and fajita seasoning. Quick and tasty, you can serve this healthy (low-carb, paleo, Whole30) fajita dish with your favorite accompaniments. Instructions to make this simple fajita recipe in the Instant Pot are also included. ",
      "There are only 5 ingredients in the easy fajita recipe! ",
      "![collage of the chicken fajita ingredients](https://fitslowcookerqueen.com/wp-content/uploads/2019/06/Slow-Cooker-Chicken-Fajitas-VIDEO-6.jpg)",
      "1.  Season the chicken with salt & pepper. Add the chicken & all the other ingredients to the slow cooker. Stir to mix well.",
      "In the recipe box you will find my go-to homemade fajita seasoning. If you use it (which I hop you do) then technically this is recipe is more than 5 ingredients.  Hopefully you already have these spices in your pantry already. My fajita spice blend makes about 1/3 cup of seasonings. Personally, I make a big batch and keep it in my pantry.",
      "1.  Season the chicken with salt & pepper. Add the chicken & all the other ingredients to the slow cooker. Stir to mix well.",
      "\\[adthrive-in-post-video-player video-id=”MSbkHu2A” upload-date=”2022-08-15T00:20:24.000Z” name=”Slow Cooker Chicken Fajitas ” description=”This slow cooker chicken fajitas recipe only has 5 ingredients! Quick and tasty, you can serve these fajitas with your favorite accompaniments. Low-carb, paleo, whole30 compliant, this easy chicken recipe can also be cooked in the Instant Pot.” player-type=”default” override-embed=”default”\\]"
    ]
  },
  {
    "url": "https://www.twopeasandtheirpod.com/grilled-chicken-blueberry-feta-salad-with-lemon-poppy-seed-dressing/#wprm-recipe-container-40510",
    "ingredients": []
  },
  {
    "url": "https://www.thesecretingredientis.com/caprese-salad-crispy-prosciutto/",
    "ingredients": []
  },
  {
    "url": "https://sweetandsavorymeals.com/slow-cooker-butter-chicken/",
    "ingredients": [
      "    *   [Ingredients:](#h-ingredients)",
      "*   **It is so easy:** Marinate the chicken the night before. Then sauté the chicken and toss it in the pot with the rest of the ingredients before enjoying your day. Then, you can come back to a delicious but easy meal.",
      "*   **Make it your way:** Although I prefer this dish just the way it is, sometimes I like to mix it up by adding or removing some of the ingredients. For example, when I have people sensitive to spicy foods, I leave out chili powder and garam masala.",
      "*   **Butter**—Because butter is the star of this dish, I only use the highest-quality butter without salt. If your butter has salt, remove it from the sauce ingredients.",
      "*   **Tomato sauce**—Another important ingredient. I prefer to use organic tomatoes to make my own, but you can use your favorite brand.",
      "*   **Heavy cream**—Do not substitute this ingredient unless you really have to because it gives your sauce the creaminess it needs to taste authentic.",
      "1.  **Marinate the chicken:** The night before (or at least 30 minutes before), mix all of the marinade ingredients in a heavy-duty zipper baggie and add chicken. Put it in the fridge to marinate.",
      "    In a bowl or large ziplock bag, combine chicken pieces with all of the MARINADE ingredients, cover with plastic wrap, and let marinate for 30 minutes or overnight in the fridge."
    ]
  },
  {
    "url": "https://www.joyousapron.com/cheesy-garlic-scalloped-potatoes/",
    "ingredients": [
      "Here is the full ingredient list to make cheesy garlic scalloped potatoes:",
      "*   chicken broth – important ingredient for another layer of flavor",
      "*   [Easy 6-Ingredient Cheesy Potato Wedges](https://www.joyousapron.com/easy-6-ingredient-cheesy-potato-wedges/)"
    ]
  },
  {
    "url": "https://www.177milkstreet.com/recipes/butternut-squash-feta-toasted-pearl-couscous",
    "ingredients": []
  },
  {
    "url": "https://www.eazypeazymealz.com/greek-chicken-bowls-meal-prep-easy/",
    "ingredients": []
  },
  {
    "url": "https://thecozycook.com/broccoli-pasta/",
    "ingredients": []
  },
  {
    "url": "http://damndelicious.net/2017/10/17/slow-cooker-creamy-garlic-chicken-and-veggies/",
    "ingredients": []
  },
  {
    "url": "https://www.themagicalslowcooker.com/seasoned-chicken-potatoes-and-green-beans/",
    "ingredients": []
  },
  {
    "url": "http://www.happilyunprocessed.com/roasted-sweet-potato-spinach-quinoa-summer-salad/",
    "ingredients": [
      "Get ready to savor a vibrant and wholesome salad packed with nutritious ingredients. With diced sweet potatoes, fluffy quinoa, fresh spinach, creamy avocado, and a delightful combination of dried cranberries and slivered almonds, this **Roasted Sweet Potato, Spinach and Quinoa Salad** offers a burst of flavors and textures.",
      "3.  Now, let’s talk about the star of the show – the Lemon Vinaigrette. This zesty dressing brings everything together, adding a tangy and refreshing element to the salad. It combines red wine vinegar, Dijon mustard, sugar, dried oregano, fresh basil, roasted garlic, organic lemon juice, olive oil, sea salt, and freshly ground black pepper. Whisking it all together creates a flavorful and emulsified dressing that perfectly complements the salad’s ingredients.",
      "4.  Next prepare the salad dressing by combining all the ingredients (including the peeled garlic) minus the olive oil.  Whisk vigorously and SLOWLY DRIZZLE in the olive oil until the dressing is emulsified."
    ]
  },
  {
    "url": "https://www.livinglou.com/slow-cooker-monster-meatballs-tomato-sauce/",
    "ingredients": []
  },
  {
    "url": "https://www.thekitchn.com/recipe-slow-cooker-chicken-burrito-bowls-207333",
    "ingredients": []
  },
  {
    "url": "https://www.thedaleyplate.com/blog/grandmas-meat-sauce-pasta-with-burrata",
    "ingredients": []
  },
  {
    "url": "https://aftannfit.com/fall-salad/",
    "ingredients": [
      "This salad recipe is flexible, so play around with the ingredients and add whatever you like. This is what you will need:",
      "**Make dressing.** Put all the ingredients in a jar and shake until combined."
    ]
  },
  {
    "url": "https://vikalinka.com/crock-pot-rustic-italian-beef-ragu/",
    "ingredients": []
  },
  {
    "url": "https://www.eatingbirdfood.com/fall-harvest-spinach-salad/",
    "ingredients": [
      "I love using quinoa as a base for salads. It’s naturally gluten-free, high in protein and one of few plant foods that contain all nine essential amino acids ([source](https://www.healthline.com/nutrition/11-proven-benefits-of-quinoa)). Not only that, but it’s also high in fiber, magnesium, B vitamins, iron, potassium, calcium, phosphorus, vitamin E and various beneficial antioxidants! Talk about a powerhouse ingredient!",
      "**Assemble salad** – While roasting the squash, toss together spinach, cooked quinoa, apple and cranberries in a large salad bowl. Add cooled pepitas (or pecans) once they’ve been toasted. Once the butternut squash is done roasting, allow it to cool and then place into the salad bowl with the other ingredients.",
      "**Make dressing** – While while butternut squash is roasting, prepare the dressing by placing all remaining ingredients in a blender and blend until smooth.",
      "You can easily swap some of the ingredients in this salad and get an entirely different meal that will be equally delicious!",
      "*   Prepare dressing by placing all remaining ingredients (tahini through maple syrup) in a blender and blend until smooth.",
      "*   Once the butternut squash is done roasting, allow it to cool and then place into the salad bowl with the other ingredients. Pour the dressing over the salad and toss to coat. Serve immediately."
    ]
  },
  {
    "url": "https://www.theroastedroot.net/summer-buddha-bowls-green-goddess-tahini-dressing/",
    "ingredients": [
      "I whipped up 4 different meals using many of the same ingredients you see in this recipe, but none were the exact thing I was looking. But _these_ bowls. These _exact_ bowls. They’re everything I want in a well-rounded, clean summer sassy meal.",
      "*   Add all of the ingredients for the dressing to a blender or food processor and blend until smooth. The dressing will be very thick - you can add more water or a splash of full-fat coconut milk to thin it out. Refrigerate until ready to use.",
      "*   Cook the rice according to package instructions. Divide it among 4 large bowls, along with the remaining ingredients. Drizzle desired amount of green goddess dressing over each bowl and serve."
    ]
  },
  {
    "url": "https://www.savoryexperiments.com/butternut-squash-risotto-with-white-cooking-wine/",
    "ingredients": []
  },
  {
    "url": "https://theforkedspoon.com/butternut-squash-risotto-instant-pot/",
    "ingredients": []
  },
  {
    "url": "https://dishingouthealth.com/butter-cauliflower-recipe/?utm_medium=social&utm_source=pinterest&utm_campaign=tailwind_tribes&utm_content=tribes&utm_term=1198455984_60523498_757066",
    "ingredients": []
  },
  {
    "url": "https://reciperunner.com/blueberry-peach-feta-salad/?utm_source=pinterest&utm_medium=social&utm_campaign=grow-social-pro",
    "ingredients": [
      " ![Ingredients used to make blueberry peach feta salad on a sheet pan.](https://reciperunner.com/wp-content/uploads/2021/07/blueberry-peach-feta-salad-ingredients-photo-680x972.jpg)"
    ]
  },
  {
    "url": "https://feelgoodfoodie.net/recipe/peach-salad/",
    "ingredients": [
      "*   **Feta:** This Greek cheese adds a nice slight saltiness to help balance out the other ingredients.",
      "Nutrition information provided is an estimate. It will vary based on cooking method and specific ingredients used."
    ]
  },
  {
    "url": "http://kirbiecravings.com/2016/01/honey-garlic-baked-cauliflower.html",
    "ingredients": []
  },
  {
    "url": "https://playswellwithbutter.com/2019/03/12/roasted-sweet-potato-cauliflower-tacos/",
    "ingredients": []
  },
  {
    "url": "https://simple-veganista.com/quinoa-chickpea-salad/",
    "ingredients": [
      "This lemon quinoa and chickpea salad happened to be one of those quinoa recipes I threw together with ingredients I had on hand, and as usual tasted amazing!",
      "*   **It’s healthy.** Full of whole-food plant-based ingredients, this quinoa chickpea salad is a [low-fat](https://simple-veganista.com/recipes/diet/low-fat/) and [oil-free recipe](https://simple-veganista.com/recipes/diet/oil-free/) loaded with protein, fiber, and vitamins! See the nutritional label below.",
      "![top down view of ingredients used to make healthy vegan lemon quinoa chickpea salad.](https://simple-veganista.com/wp-content/uploads/2014/01/lemon-quinoa-chickpea-salad-recipe-1.jpg)",
      "Here is everything you will need, including ingredient variations:",
      "*   **Lemon** – This one ingredient is what will dress the salad. If you want something a bit more intense and delicious, try using this [Zesty Garlic + Lemon Dressing](https://simple-veganista.com/chopped-vegetable-salad-with-garlic/)!"
    ]
  },
  {
    "url": "https://www.gimmesomeoven.com/feel-good-fall-salad/",
    "ingredients": []
  },
  {
    "url": "https://itsavegworldafterall.com/fajita-veggies/",
    "ingredients": []
  },
  {
    "url": "https://www.dinneratthezoo.com/chipotle-chicken-copycat-recipe/",
    "ingredients": []
  },
  {
    "url": "https://insearchofyummyness.com/spinach-salad-pears-pecans/",
    "ingredients": [
      "*   Place all ingredients in a bowl and whisk until combined. Alternatively, you can add the ingredients to a mason jar, screw the lid on tightly, and shake to combine.",
      "*   Place spinach and pecans in a large bowl. Add a few spoonfuls of dressing, then use your hands to toss the salad to combine the ingredients. Add the pear slices to the salad, and toss again, gently."
    ]
  },
  {
    "url": "https://www.ambitiouskitchen.com/sweet-potato-kale-salad/",
    "ingredients": []
  },
  {
    "url": "https://kristineskitchenblog.com/kale-superfood-salad-with-quinoa-and-blueberries/",
    "ingredients": []
  },
  {
    "url": "https://barefeetinthekitchen.com/spinach-orzo-salad/",
    "ingredients": [
      "_You’ll need the following ingredients to make this:_"
    ]
  },
  {
    "url": "https://www.iheartnaptime.net/caprese-salad/?utm_medium=social&utm_source=pinterest&utm_campaign=tailwind_tribes&utm_content=tribes&utm_term=1104140022_53488572_427478",
    "ingredients": [
      "*   [Recipe Ingredients](#toc-recipe-ingredients)",
      "A classic Caprese salad recipe is made with slices of tomatoes, sliced mozzarella and larger pieces of basil on top. While I love the original version, I find chopping the ingredients is much easier to eat and perfect for a serving a crowd. ",
      "1.  **Combine ingredients.** Place the tomatoes, mozzarella balls and fresh chopped basil in a large bowl.",
      "Fresh mozzarella is a key ingredient in this salad. You could try fresh burrata cheese but I would not use low moisture or part-skim mozzarella as it will change the texture of the salad and add additional salt.",
      "Nutrition provided is an estimate. It will vary based on specific ingredients used."
    ]
  },
  {
    "url": "https://www.twopeasandtheirpod.com/summer-farro-salad/",
    "ingredients": []
  },
  {
    "url": "https://www.flavourandsavour.com/blackberry-honeydew-salad-with-basil/",
    "ingredients": []
  },
  {
    "url": "https://plantbasedrdblog.com/2021/04/black-bean-nourish-bowl/",
    "ingredients": [
      "_This Black Bean Nourish Bowl gives you a new and fun way to flavor your black beans by using a creamy ginger and sriracha infused dressing. This bowl comes together in less than 30 minutes and uses super easy ingredients you likely have on hand._",
      "Prepare the sauce by mixing all of the dressing ingredients together. Adjust consistency by adding small amounts of water at a time until desired consistency is achieved.",
      "This Black Bean Nourish Bowl gives you a new and fun way to flavor your black beans by using a creamy ginger and sriracha infused dressing. This bowl comes together in less than 30 minutes and uses super easy ingredients you likely have on hand.",
      "4.  For the dressing, just whisk all the dressing ingredients together until smooth and adjust consistency as desired. "
    ]
  },
  {
    "url": "http://wholeandheavenlyoven.com/2017/06/12/summer-peach-balsamic-caprese-salad/",
    "ingredients": []
  },
  {
    "url": "https://www.cookingclassy.com/skillet-lemon-parmesan-chicken-zucchini-and-squash/",
    "ingredients": [
      "Of course! Lemon Parmesan chicken pairs well with almost any vegetable. I recommend using seasonal produce that cooks at roughly the same rate as the zucchini and squash (that way you’re not having to take ingredients in and out of the skillet to accommodate different cook times)."
    ]
  },
  {
    "url": "https://kristineskitchenblog.com/mashed-potatoes/",
    "ingredients": [
      "This mashed potatoes recipe is simple to make with just a few ingredients. Below you’ll find my tips for making perfect mashed potatoes that are deliciously creamy and flavorful. A few small tricks really do make a big difference!",
      "![recipe ingredients: chopped yukon gold potatoes, butter, milk and salt in bowls](https://i0.wp.com/kristineskitchenblog.com/wp-content/uploads/2021/05/mashed-potatoes-ingredients-488.jpg?resize=1800%2C1200&ssl=1 \"Mashed potatoes ingredients. The BEST Mashed Potatoes Recipe! Perfectly creamy, buttery and fluffy homemade mashed potatoes are a favorite side dish. With tips on how to make mashed potatoes with cream cheese, sour cream, bacon and more!\")",
      "_Here’s an overview of the recipe steps. Find the full recipe with ingredient amounts and instructions in the recipe card below._"
    ]
  },
  {
    "url": "https://lilluna.com/spinach-ricotta-stuffed-peppers/",
    "ingredients": [
      "This recipe is SO easy… And the peppers themselves only require a handful of ingredients!",
      "Melanie is the cook and photographer behind the blog Garnish & Glaze. When she’s not playing princesses with her two little girls, she’s experimenting in the kitchen. She takes simple ingredients and creates everything from healthy dinners to indulgent desserts."
    ]
  },
  {
    "url": "https://littlespicejar.com/greek-chicken-meatballs-in-lemon-cream-sauce/",
    "ingredients": [
      "![ingredients for the meatball ball mixture in stainless steel bowl](https://littlespicejar.com/wp-content/uploads/2020/09/Greek-Chicken-Meatballs-in-Lemon-Sauce-17-710x1065.jpg)",
      "1.  In a bowl, combine everything but the meat mixture along with a generous pinch of salt and black pepper. I use a fork to mix all the ingredients together.",
      "2.  When the ingredients are mix, add the ground chicken and mix until just combined. You don’t want to overwork the meat mixture or you’ll be left with tough and dry meatballs. Portion the meatballs using a cookie scoop into roughly 1 ½ tablespoon portions. ",
      "1.  **MEATBALLS:** In a medium bowl, using a fork, mix together all the ingredients except the ground chicken. You also want to add 1 teaspoon of salt and ½ teaspoon of pepper. When the ingredients are combined, add the ground chicken and mix until \\*just\\* combined. Just be sure you don’t overwork the meat. Roll into 24-28 meatballs using a cookie scoop or about 1 ½ tablespoon each."
    ]
  },
  {
    "url": "https://www.eatwell101.com/roasted-potatoes-carrots-zucchini-recipe",
    "ingredients": []
  },
  {
    "url": "https://therecipecritic.com/2017/07/buttery-garlic-herb-chicken-with-zucchini/",
    "ingredients": []
  },
  {
    "url": "https://www.ambitiouskitchen.com/summer-peach-fruit-salad/",
    "ingredients": []
  },
  {
    "url": "https://www.inspiredtaste.net/36077/arugula-salad-with-couscous/",
    "ingredients": []
  },
  {
    "url": "https://www.eatwell101.com/apple-cranberry-bacon-kale-salad-recipe",
    "ingredients": []
  },
  {
    "url": "https://cookingformysoul.com/grilled-peach-salad-with-berries/",
    "ingredients": []
  },
  {
    "url": "https://www.saltandlavender.com/lemon-orzo-salad/?utm_medium=social&utm_source=pinterest&utm_campaign=tailwind_tribes&utm_content=tribes&utm_term=1096861790_52881776_22361",
    "ingredients": []
  },
  {
    "url": "https://forlemonsake.com/recipes-1/spinach-salad-with-grilled-chicken-blackberries-and-peaches",
    "ingredients": []
  },
  {
    "url": "https://allthehealthythings.com/greek-meatballs-with-tzatziki-sauce/",
    "ingredients": []
  },
  {
    "url": "https://www.eatyourselfskinny.com/zucchini-noodles-with-creamy-avocado-pesto/",
    "ingredients": []
  },
  {
    "url": "https://wearenotmartha.com/basil-chicken-in-coconut-curry-sauce/?utm_medium=social&utm_source=pinterest&utm_campaign=tailwind_tribes&utm_content=tribes&utm_term=691070550_26932810_30189",
    "ingredients": []
  },
  {
    "url": "http://www.lifeloveliz.com/2017/05/15/ground-turkey-sweet-potato-skillet/#_a5y_p=6340242",
    "ingredients": [
      "It’s a simple but delicious combination of healthy ingredients that will fuel your family and have them asking you to make it again."
    ]
  },
  {
    "url": "http://www.cookingclassy.com/skillet-lemon-parmesan-chicken-zucchini-and-squash/",
    "ingredients": []
  },
  {
    "url": "http://www.platingsandpairings.com/pumpkin-risotto-with-goat-cheese-dried-cranberries/",
    "ingredients": [
      "The process takes about 20 minutes from start to finish, and it’s a full evolution. The risotto starts as hard grains of rice, then it becomes more plump, and then, through all the stirring and the feeding, it takes on the most incredible creamy texture that’s tasty on it’s own, but also totally customizable with any ingredients of your choosing."
    ]
  },
  {
    "url": "https://www.awickedwhisk.com/pumpkin-ravioli-in-apple-sage-butter-sauce-3/",
    "ingredients": []
  },
  {
    "url": "https://twokooksinthekitchen.com/spicy-honey-lime-chicken/",
    "ingredients": []
  },
  {
    "url": "https://iwashyoudry.com/chicken-zucchini-pasta-skillet/",
    "ingredients": []
  },
  {
    "url": "https://monkeyandmekitchenadventures.com/rustic-italian-vegetable-bake/",
    "ingredients": []
  },
  {
    "url": "https://juliasalbum.com/baked-italian-chicken-and-vegetables/",
    "ingredients": []
  },
  {
    "url": "https://www.closetcooking.com/spinach-and-feta-baked-chicken/",
    "ingredients": []
  },
  {
    "url": "https://tatyanaseverydayfood.com/grilled-veggies/",
    "ingredients": []
  },
  {
    "url": "http://daisiesandpie.co.uk/roast-squash-and-feta-couscous/",
    "ingredients": []
  },
  {
    "url": "https://www.krumpli.co.uk/pureed-pumpkin-risotto-with-walnuts/",
    "ingredients": []
  },
  {
    "url": "https://www.gimmesomeoven.com/feel-good-fall-salad/",
    "ingredients": []
  },
  {
    "url": "http://peasandcrayons.com/2014/11/honey-roasted-butternut-squash-cranberries-feta.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed:+blogspot/Xsbcc+(Peas+and+Crayons)",
    "ingredients": []
  },
  {
    "url": "http://acalculatedwhisk.com/summer-kale-salad/",
    "ingredients": [
      "2.  Mix all the dressing ingredients with a fork in a large bowl. Add the kale leaves, toss to coat them with the dressing, and massage them by hand until reduced in volume, darker green, and tender, 2 to 3 minutes. Transfer the kale to a platter or divide it between individual serving plates. Top with the peach slices, blueberries, crumbled goat cheese, and candied pecans."
    ]
  },
  {
    "url": "https://www.halfbakedharvest.com/greek-lemon-chicken-bowls/?utm_source=rss&utm_medium=rss&utm_campaign=greek-lemon-chicken-bowls",
    "ingredients": []
  },
  {
    "url": "https://www.chelseasmessyapron.com/cilantro-lime-chicken/",
    "ingredients": [
      "The marinade for this Cilantro-Lime Chicken is everything a good marinade should be: it’s easy to whip together, has so much flavor, and doesn’t contain any “strange” ingredients. This recipe also pairs really well with my [mango salsa-](https://www.chelseasmessyapron.com/best-mango-salsa/)\\-I always make it as a side when I make this dish. I’d recommend giving it a shot!",
      " ![All the ingredients for this recipe prepped out for easy assembly.](data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%201200%201300'%3E%3C/svg%3E)",
      "*   **MARINADE:** Whisk together all of the marinade ingredients in a medium-sized bowl. Reserve about 1/2 cup of marinade, and pour the rest into a large resealable bag.",
      "We do our best to provide accurate nutritional analysis for our recipes. Our nutritional data is calculated using a third-party algorithm and may vary, based on individual cooking styles, measurements, and ingredient sizes. Please use this information for comparison purposes and consult a health professional for nutrition guidance as needed."
    ]
  },
  {
    "url": "https://cleanfoodcrush.com/chicken-and-cauliflower-rice-bowls/",
    "ingredients": []
  },
  {
    "url": "https://saltedmint.com/spinach-ricotta-stuffed-shells/?utm_medium=social&utm_source=pinterest&utm_campaign=tailwind_tribes&utm_content=tribes&utm_term=512055484_18449686_312821",
    "ingredients": [
      "*   [🧾 Ingredient notes](#%f0%9f%a7%be-ingredient-notes)",
      "*   **Egg**: Binds the filling ingredients together.",
      "_For precise measurements and additional ingredients, refer to the recipe card at the bottom of the page._",
      "*   In a mixing bowl, combine the ricotta, mozzarella, parmesan, egg, nutmeg (if using) and the sautéed spinach mixture. Mix until all ingredients are well incorporated."
    ]
  },
  {
    "url": "https://www.thekitchn.com/cauliflower-rice-healthy-lunch-bowl-263225",
    "ingredients": []
  },
  {
    "url": "https://www.chelseasmessyapron.com/grilled-chicken-caramelized-pineapple-salsa-rice-bowl/?fbclid=IwAR0OBFEsTStOuHwvplQOGiGpOm5pLCIEctCKVC5PBMGzE3eEx7zwXS8xEnc",
    "ingredients": []
  },
  {
    "url": "https://marisamoore.com/pumpkin-pasta-toasted-walnuts-spinach/",
    "ingredients": []
  },
  {
    "url": "https://www.savoringthegood.com/swedish-meatball-recipe/",
    "ingredients": []
  },
  {
    "url": "https://www.ambitiouskitchen.com/nourishing-yellow-chickpea-pumpkin-curry/",
    "ingredients": []
  },
  {
    "url": "https://reluctantentertainer.com/roasted-chicken-with-honey-bacon-pears/",
    "ingredients": []
  },
  {
    "url": "https://dishingouthealth.com/quinoa-power-bowls-with-maple-chipotle-brussels-and-smoky-butternut-squash/",
    "ingredients": [
      "These bowls truly have it all: protein, fiber, heart-healthy fats, and a slew of micronutrients. And you can totally customize the ingredients to include any produce or grain you have on hand.",
      "As far as the sauce, I keep it simple with a honey-Dijon vinaigrette. It’s actually a staple sauce over here that requires minimal ingredients and is super versatile. However in lieu of the sauce, you can add a dollop of hummus or your favorite bottled dressing instead.![Ingredients in bowls](https://dishingouthealth.com/wp-content/uploads/2016/02/QuinaPowerBowlsIngredients.jpg)"
    ]
  },
  {
    "url": "https://therecipecritic.com/2017/11/cranberry-pecan-sweet-potato-wild-rice-pilaf/",
    "ingredients": []
  },
  {
    "url": "https://www.closetcooking.com/lemon-ricotta-zucchini-pasta/",
    "ingredients": [
      "##### ingredients"
    ]
  },
  {
    "url": "https://www.crowdedkitchen.com/blackberry-avocado-and-arugula-salad/",
    "ingredients": []
  },
  {
    "url": "https://www.platingsandpairings.com/cauliflower-salad-with-roasted-chickpeas-quinoa/",
    "ingredients": []
  },
  {
    "url": "http://wellandfull.com/2017/01/kale-detox-salad-w-pesto/",
    "ingredients": []
  },
  {
    "url": "https://cooking.nytimes.com/recipes/1020453-crisp-gnocchi-with-brussels-sprouts-and-brown-butter?smid=pin-share",
    "ingredients": [
      "Note: The information shown is Edamam’s estimate based on available ingredients and preparation. It should not be considered a substitute for a professional nutritionist’s advice.",
      "This dish had no right to be as delicious as it was! The ingredients are simple and so are the techniques you use. It doesn't all make sense on paper but it comes together wonderfully! Crunchy gnocchi and brussel sprouts. Slightly hot from the red pepper flakes, a little sweet from the honey, and with the slightest hint of lemon. And the parmesan at the end! So subtle but so good! Definitely making this again and can't wait to try with the different variations of cruciferous vegetables!"
    ]
  },
  {
    "url": "https://themodernproper.com/chicken-fajita-burrito-bowl",
    "ingredients": [
      "Bowls are all the rage right? [Rice bowls](https://themodernproper.com/chicken-teriyaki-sushi-bowl), [quinoa bowls](https://themodernproper.com/quinoa-bowl), [Buddha bowls](https://themodernproper.com/green-curry-buddha-bowl), burrito Bowls. Give us all the bowls! This chicken fajita bowl is one of our go-to weeknight meals. It’s healthy, easy, and balanced. Plus, it’s always a hit with the kids. A fajita burrito bowl might sound complicated, but they’re super simple. Season some chicken with [Homemade Taco Seasoning](https://themodernproper.com/homemade-taco-seasoning)—add some black beans, roasted bell peppers and all the fixings and serve over [Brown Rice](https://themodernproper.com/brown-rice) or [Cilantro Lime Rice](https://themodernproper.com/cilantro-lime-rice). Plus, it’s an ideal meal for all of you superhero meal-planners! Prep the ingredients a few days ahead, and you’ve got a customizable, buildable meal ready to go. And for a more classic take on fajitas, check out our [Chicken Fajitas](https://themodernproper.com/chicken-fajitas).  ",
      "Taking cues from Chipotle’s burrito bowl, we like to pile everything up high, and (also just like Chipotle) we prefer to prep the ingredients ahead of time, so that when dinner time comes, everyone can just assemble and EAT! The taco-spiced chicken breast can be easily made ahead and is an incredibly easy recipe. After that, you just need to prep all your other ingredients and store them in small containers, so they’re ready as can be!  ",
      "3.  Spread ingredients across pan and allow to bake for 15 minutes, or until meat is cooked through. If you want to add some char to meat and veggies, broil for another 3 minutes.",
      "5.  \\*Prep tip- Store all ingredients separately and build for meal prep. If making for lunch store the guacamole, sour cream, salsa and cilantro in a separate container than the rice, chicken and beans. Heat up the bowl and top with fixings!"
    ]
  },
  {
    "url": "https://afoodloverslife.com/pesto-lemon-grilled-chicken/?pp=1",
    "ingredients": []
  },
  {
    "url": "https://reciperunner.com/parmesan-pesto-roasted-potatoes/",
    "ingredients": []
  },
  {
    "url": "http://www.motherthyme.com/2016/05/roasted-stuffed-peppers.html",
    "ingredients": []
  },
  {
    "url": "https://www.shekeepsalovelyhome.com/stuffed-portobello-mushrooms/",
    "ingredients": []
  },
  {
    "url": "https://cafedelites.com/lemon-herb-mediterranean-pasta-salad/",
    "ingredients": []
  },
  {
    "url": "https://cafedelites.com/chicken-avocado-caprese-salad/",
    "ingredients": [
      "After that, the salad comes together _so FAST_. Throw all ingredients into a bowl and dress with the reserved dressing.",
      "*   Whisk marinade ingredients together to combine. Place chicken into a shallow dish; pour 4 tablespoons of the dressing / marinade onto the chicken and stir around to evenly coat chicken. Reserve the untouched marinade to use as a dressing."
    ]
  },
  {
    "url": "https://wp.me/pcrPfr-6S/?r=1303482953",
    "ingredients": []
  },
  {
    "url": "http://fakeginger.com/maple-pecan-baked-brie/",
    "ingredients": []
  },
  {
    "url": "https://pinchofyum.com/coconut-lime-grilled-chicken-and-rice",
    "ingredients": []
  },
  {
    "url": "https://www.eatwell101.com/apple-cranberry-bacon-kale-salad-recipe",
    "ingredients": []
  },
  {
    "url": "https://bakingmischief.com/baked-parmesan-zucchini/",
    "ingredients": []
  },
  {
    "url": "http://www.crunchycreamysweet.com/2018/04/30/roasted-sweet-potato-black-bean-quinoa-salad-recipe/",
    "ingredients": []
  },
  {
    "url": "https://tasty-yummies.com/grilled-potato-and-arugula-salad-with-fresh-herbs/?utm_source=Tasty+Yummies&utm_campaign=00e762a6cd-RSS_EMAIL_CAMPAIGN&utm_medium=email&utm_term=0_3e79144d6e-00e762a6cd-87886325",
    "ingredients": []
  },
  {
    "url": "http://www.twopeasandtheirpod.com/brie-apple-and-honey-crostini/",
    "ingredients": []
  },
  {
    "url": "http://www.meatloafandmelodrama.com/crock-pot-cranberry-orange-meatballs/",
    "ingredients": [
      "This recipe is inspired by our favorite [**cranberry orange ham**](https://www.meatloafandmelodrama.com/cranberry-orange-crock-pot-ham/), which we usually have for Christmas dinner. And, it only uses five ingredients. You can’t beat that!",
      "Then, you add some orange marmalade and cranberry sauce, plus the remaining ingredients, stir, and cook on high for two hours. After that, you can let the meatballs simmer on low until you’re read to serve them.",
      "*   Add meatballs, and top with remaining ingredients"
    ]
  },
  {
    "url": "https://fitfoodiefinds.com/2017/11/video-harvest-blackberry-butternut-squash-massaged-kale-salad/?utm_medium=social&utm_source=pinterest&utm_campaign=tailwind_tribes&utm_content=tribes",
    "ingredients": []
  },
  {
    "url": "https://www.awickedwhisk.com/pumpkin-ravioli-in-apple-sage-butter-sauce-3/",
    "ingredients": []
  },
  {
    "url": "https://inspiredbycharm.com/roasted-carrots-with-candied-pecans-and-goat-cheese/",
    "ingredients": []
  },
  {
    "url": "https://dishingouthealth.com/quinoa-power-bowls-with-maple-chipotle-brussels-and-smoky-butternut-squash/",
    "ingredients": []
  },
  {
    "url": "http://frommybowl.com/sweet-potato-breakfast-bowls/",
    "ingredients": []
  },
  {
    "url": "https://www.primaverakitchen.com/sausage-and-apple-stuffed-acorn-squash/?utm_medium=social&utm_source=pinterest&utm_campaign=tailwind_tribes&utm_content=tribes&utm_term=851141982_36210582_242429",
    "ingredients": []
  },
  {
    "url": "https://theforkedspoon.com/spinach-pear-and-feta-salad-with-walnuts-and-pomegranate-arils/",
    "ingredients": [
      "*   Place the spinach, walnuts, pomegranates, green onions, and crumbled feta in a large salad bowl. If preparing the salad ahead of time, dip each pear slice into a small bowl of orange juice and then add to the salad bowl; otherwise, add the pears with the other ingredients.",
      "(Nutrition information provided is an estimate and will vary based on cooking methods and specific brands of ingredients used.)"
    ]
  },
  {
    "url": "https://cafedelites.com/caprese-stuffed-avocado/",
    "ingredients": []
  },
  {
    "url": "https://www.halfbakedharvest.com/honey-apple-cheddar-and-bacon-panini/",
    "ingredients": []
  },
  {
    "url": "http://www.littlebroken.com/2015/11/06/creamy-potato-stacks-with-garlic-thyme-and-parmesan/",
    "ingredients": []
  },
  {
    "url": "http://www.cookingonthefrontburners.com/2016/11/sweet-potato-rounds-goat-cheese-honey-appetizer.html",
    "ingredients": []
  },
  {
    "url": "https://www.wellplated.com/chicken-sweet-potato-kale-skillet/",
    "ingredients": [
      "I also always make sure I add a few flavor boosters so that even though the ingredients are simple (ahem, whatever I could dig out of my fridge), the recipe tastes special, intentional, and like something that really could have come from a cookbook, instead of its actual source—my moderately sleep-deprived brain after a glass of Cabernet.",
      "The core base ingredients (the ones I found in my fridge) are:",
      "*   **Balsamic Vinegar**. When I was first cooking this dish, I tasted it at the end and felt it lacked a little pop. A splash of balsamic vinegar did the trick! It brightens up the ingredients and balances the natural sweetness of the sweet potatoes."
    ]
  },
  {
    "url": "https://asimplepalate.com/blog/apple-pomegranate-harvest-salad/",
    "ingredients": [
      "Below you’ll find the full list of ingredients needed to make this salad happen!",
      "![Ingredients for apple pomegranate salad arranged on a brown wooden cutting board.](https://asimplepalate.com/wp-content/uploads/2019/09/pomegranate-salad-ingredients.jpg)",
      "*   **Make this salad ahead:** If this salad needs to be prepped ahead of time I recommend storing all the prepped ingredients in separate ziplock bags, then assembling the salad as needed close to the time of serving. ",
      "*   **Mix the salad dressing:** in a glass jar, add all of the salad dressing ingredients. Cover it with a lid and shake it until combined, or use a spoon/fork to whisk the ingredients together.",
      "*   **Make this salad ahead:** If this salad needs to be prepped ahead of time I recommend storing all the prepped ingredients in separate ziplock bags, then assemble the salad as needed close to the time of serving. "
    ]
  },
  {
    "url": "https://paleoglutenfree.com/recipes/whole30-harvest-chicken-salad/",
    "ingredients": [
      "I have been meaning to make this salad for weeks, but every time I bought the ingredients; somehow, I devoured all the berries or arugula before I could assemble the salad.",
      "3.  In a jar or blender add ingredients for dressing and shake or blend until smooth, then set aside for later."
    ]
  },
  {
    "url": "http://www.jaroflemons.com/chili-mango-zesty-quinoa-salad/",
    "ingredients": [
      "This easy salad is made with chopped spinach, tomatoes, beans, corn, and a flavorful chili quinoa, then topped off with creamy avocado and sweet/savory chili mango. Drizzle this [Avocado Lime Dressing](https://www.jaroflemons.com/3-ingredient-creamy-avocado-lime-dressing/) or a squeeze of fresh lime juice, and this salad is so life-giving! Whether you’re looking for an easy lunch idea, a quick and refreshing summer dinner recipe, a side dish, or a salad that will impress your guests at your next get-together, this Chili Mango Zesty Quinoa Salad is anything but ordinary!",
      "Get started with these simple and easy-to-find ingredients! Here’s what you’ll need for this recipe:",
      "*   [**Avocado Lime Dressing**](https://www.jaroflemons.com/3-ingredient-creamy-avocado-lime-dressing/) (or a squeeze of lime juice)",
      "*   ▢ [Avocado Lime Dressing](https://www.jaroflemons.com/3-ingredient-creamy-avocado-lime-dressing/) (or squeeze of lime juice)"
    ]
  },
  {
    "url": "https://www.wellplated.com/italian-sausage-butternut-squash-gnocchi/",
    "ingredients": []
  },
  {
    "url": "https://www.chelseasmessyapron.com/roasted-butternut-squash/",
    "ingredients": []
  },
  {
    "url": "https://juliasalbum.com/maple-butternut-squash-roasted-brussels-sprouts-pumpkin-seeds-and-cranberries/",
    "ingredients": []
  },
  {
    "url": "https://www.cookitrealgood.com/roasted-sweet-potato-avocado-and-feta-salad/",
    "ingredients": []
  },
  {
    "url": "http://peasandcrayons.com/2017/05/cranberry-blueberry-spring-mix-salad.html",
    "ingredients": []
  },
  {
    "url": "https://www.closetcooking.com/parmesan-roasted-carrot-fries/",
    "ingredients": [
      "##### ingredients"
    ]
  },
  {
    "url": "https://www.closetcooking.com/mozzarella-baked-gnocchi-bolognese",
    "ingredients": []
  },
  {
    "url": "https://www.greensnchocolate.com/butternut-squash-chicken-sausage-kale-quinoa-skillet/",
    "ingredients": []
  },
  {
    "url": "https://therealfoodrds.com/butternut-squash-and-apple-hash-with-sausage/",
    "ingredients": []
  },
  {
    "url": "http://lifecurrents.dw2.net/three-cheese-pesto-avocado-grilled-cheese-sandwich/",
    "ingredients": []
  },
  {
    "url": "http://www.foxandbriar.com/autumn-harvest-salad-with-pomegranates/",
    "ingredients": []
  },
  {
    "url": "https://www.thekitchn.com/lemon-butter-pasta-vegetables-260357?utm_source=pinterest&utm_medium=tracking&utm_campaign=inline-img-share",
    "ingredients": []
  },
  {
    "url": "http://www.jessicagavin.com/chicken-tomatillo-quinoa-bowls/",
    "ingredients": [
      "_For a satisfying meal try these healthy chicken tomatillo quinoa bowls loaded with wholesome ingredients! Tender chicken is tossed in a spicy and creamy roasted tomatillo sauce for a flavor kick!_",
      "![side by side before and after photos of sauce ingredients from solid to puree](https://www.jessicagavin.com/wp-content/uploads/2016/10/roasted-spicy-tomatillo-sauce-before-and-after-blending-600x450.jpg)",
      "Now it’s time to bring the sauce components together! Chicken broth and fresh parsley are added to the roasted ingredients, then pureed in my Vitamix Blender until smooth."
    ]
  },
  {
    "url": "https://www.twopeasandtheirpod.com/orzo-salad-with-chickpeas-cucumbers-lemon-dill-feta/",
    "ingredients": [
      "*   In a small bowl, whisk together olive oil, lemon juice, garlic, dill, salt, and pepper. Drizzle over salad and stir until ingredients are well coated. Serve immediately or chilled."
    ]
  },
  {
    "url": "https://www.southernliving.com/syndication/lemony-cucumber-herb-pasta-salad?utm_source=pinterest.com&utm_medium=social&utm_campaign=southernliving&crlt.pid=camp.38SM5ZK6QyKo",
    "ingredients": [
      "Pasta salad, the summertime staple of the 90s, returns to today's dinner table with this fresh take. (Spoiler alert: Leave your mayo in the fridge.) Each perfect bite is made up of a short [pasta shape](https://www.realsimple.com/food-recipes/recipe-collections-favorites/popular-ingredients/types-of-pasta-noodles), vibrant fresh herbs, crisp [cucumbers](https://www.realsimple.com/cucumber-health-benefits-7371080) (famous for their good skin-to-flesh ratio), salty feta, and a mustardy garlic-lemon dressing."
    ]
  },
  {
    "url": "https://parsleythymelimoncello.com/2018/07/19/middle-eastern-kafta-kebabs/?utm_medium=social&utm_source=pinterest&utm_campaign=tailwind_tribes&utm_content=tribes&utm_term=410995654_13794182_137820",
    "ingredients": [
      "Mix all ingredients together in a medium bowl. Form into golf ball-sized meatballs. This will make it much easier to work with on your skewers.",
      "*   Mix all ingredients together in a large bowl. Form into golf ball sized meatballs."
    ]
  },
  {
    "url": "https://afoodloverskitchen.com/easy-okonomiyaki-recipe-savory-japanese-pancakes/",
    "ingredients": [
      "However, there are a few things that make it extra special. These are somewhat specialty ingredients, that you don’t likely have on hand.",
      "First off, there is a special [okonomiyaki flour](https://amzn.to/2IFTg80) that is used in Japan. They also use [dashi](https://www.justonecookbook.com/how-to-make-dashi-3-ways/) for the liquid, rather than plain water. Both of these ingredients give the pancake something extra special. However, they are not necessary ingredients to make a great Okonomiyaki.",
      "While these pancakes are best when served with all these toppings, it’s by no means a requirement. Below, we will suggested substitutions for the difficult to find ingredients.",
      "Mix up the batter, add the pre-sweated cabbage and other ingredients, and you’re ready to go. Pour the batter onto a hot griddle. An [electric griddle](https://amzn.to/2LUg1qr \"Electric Griddle\") like this one is perfect for the task, but you can just use a flat [crepe pan](https://amzn.to/30SoG41 \"Crepe pan\") as well."
    ]
  },
  {
    "url": "https://www.eatwell101.com/healthy-chicken-pasta-salad-recipe",
    "ingredients": [
      "This **chicken pasta salad recipe** is super easy to make. It’s ready in under 20 minutes from start to finish. That’s great, especially when you know you can keep this pasta salad in the refrigerator for up to 3 days! We used rotisserie chicken to make the pasta salad, but feel free to roast or grill chicken breasts on your own or use chicken leftovers in your fridge. Put all the ingredients together in a large salad bowl and make the vinaigrette-style dressing.",
      "*   The homemade dressing adds a burst of tangy and herby flavors that perfectly compliments the other ingredients, taking this chicken pasta salad to the next level. Plus, the dressing can be customized to suit individual tastes by adjusting the amount of vinegar or seasoning used. See below for more tips about the dressing!",
      "The dressing is an important part of this pasta salad recipe. Our pasta salad dressing has only five ingredients, including salt and pepper.",
      "To make the pasta salad dressing, whisk white wine vinegar, extra-virgin olive oil, Italian seasoning, and a pinch of salt and pepper. This dressing is pretty simple, but when mixed with pasta, chicken, tomato, avocado, and other ingredients, the flavor is amazing!",
      "**2.** In a jar, combine the ingredients for the dressing: vinegar, Italian seasoning, Olive oil, salt and pepper.",
      "**3.** Drizzle your chicken pasta salad with the dressing. Toss gently until all the ingredients are combined. Serve the **chicken pasta salad** immediately, or chill for later. Enjoy! ❤️",
      "*   Being a **cold chicken pasta salad** makes it perfect for summer, picnics or potlucks. You can make it up to a day in advance, leaving the avocado and tomato until you are ready to serve the chicken pasta salad to keep the ingredients as fresh as possible."
    ]
  },
  {
    "url": "https://simply-delicious-food.com/grilled-chicken-blt-salad/",
    "ingredients": [
      "1.  **Marinate the chicken:** Halve the chicken horizontally with a sharp knife then place in a medium bowl. Mix together the marinade ingredients and pour over the chicken. Toss to coat then allow to marinate for at least 20 minutes but up to 24 hours covered in the fridge.",
      "*   Combine all the marinade ingredients and mix well. Pour over the chicken and allow to marinade while you pre-heat the grill or grill pan on the stove.",
      "*   Mix together the dressing ingredients then drizzle over the salad before serving."
    ]
  },
  {
    "url": "http://www.cookingmaniac.com/creamy-goat-cheese-mushroom-gnocchi/",
    "ingredients": []
  },
  {
    "url": "https://skinnyms.com/chipotle-honey-chicken-skewers-recipe/",
    "ingredients": []
  },
  {
    "url": "https://oursaltykitchen.com/maple-bourbon-glaze-bacon-brussels-sprouts/",
    "ingredients": []
  },
  {
    "url": "https://peychoosingbalance.com/healthy-meal-prep-breakfast/",
    "ingredients": []
  },
  {
    "url": "https://www.fitmittenkitchen.com/strawberry-salad-coconut-honey-lime-poppy-seed-dressing/",
    "ingredients": [
      "*   [Salad Ingredients](#salad_ingredients \"Salad Ingredients\")",
      "[![ingredients on board, labeled, crumbled feta, olive oil, strawberries, honey, pecans, poppy seeds, limes, fresh spinach, sea salt and coconut milk](https://www.fitmittenkitchen.com/wp-content/uploads/2021/06/Strawberry-Spinach-Salad-ingredients.jpg)](https://www.fitmittenkitchen.com/wp-content/uploads/2021/06/Strawberry-Spinach-Salad-ingredients.jpg)",
      "The dressing **ingredients can be whisked together in a bowl or salad dressing cup** – super simple!",
      "2.  Make the dressing: combine all of the dressing ingredients in medium bowl and whisk until combined. If using an [immersion blender](https://amzn.to/2GPnJkT) or small food processor, a combine all except poppy seeds, then stir those in at the end. "
    ]
  },
  {
    "url": "https://www.eatwell101.com/tomato-spinach-sausage-pasta-recipe",
    "ingredients": []
  },
  {
    "url": "https://therealfoodrds.com/warm-chipotle-lime-sweet-potato-salad/",
    "ingredients": []
  },
  {
    "url": "http://thehungrywaitress.com/easy-gnocchi-with-roasted-vegetables/",
    "ingredients": []
  },
  {
    "url": "https://www.delish.com/uk/cooking/recipes/a30413128/how-to-make-fried-rice/",
    "ingredients": [
      "• **MSG:** MSG adds the perfect sweet-salty boost to fried rice. It’s a widely misunderstood ingredient—checkout this article all about [MSG](https://www.delish.com/cooking/recipe-ideas/a35119070/msg-monosodium-glutamate/) if you’re looking to learn more.  ",
      "• _Shake it up._ Don’t sleep on unconventional ingredients either—use our [kimchi fried rice](https://www.delish.com/cooking/recipe-ideas/a34964713/kimchi-fried-rice-recipe/), our [Thai fried rice](https://www.delish.com/cooking/recipe-ideas/a35035252/thai-fried-rice-recipe/), or our [pineapple fried rice](https://www.delish.com/cooking/recipe-ideas/a25102459/easy-pineapple-fried-rice-recipe/) as inspiration, then feel free to get creative."
    ]
  },
  {
    "url": "https://diethood.com/honey-garlic-butter-roasted-carrots-recipe/",
    "ingredients": []
  },
  {
    "url": "https://www.themagicalslowcooker.com/slow-cooker-garlic-butter-chicken-and-veggies/",
    "ingredients": []
  },
  {
    "url": "https://www.foodiecrush.com/blt-pasta-salad-avocado/",
    "ingredients": []
  },
  {
    "url": "http://www.twopeasandtheirpod.com/chickpea-avocado-feta-salad/",
    "ingredients": [
      "The other day, I was going to make my favorite sandwich for lunch, but I was in a rush, so I decided to throw together a quick salad using the same ingredients. My favorite sandwich turned into my new favorite salad. This **Chickpea, Avocado, and Feta Salad** is good stuff."
    ]
  },
  {
    "url": "https://www.lazycatkitchen.com/savoury-vegan-breakfast-bowl/",
    "ingredients": []
  },
  {
    "url": "http://www.foodiecrush.com/strawberry-and-avocado-spinach-salad-with-chicken/",
    "ingredients": []
  },
  {
    "url": "http://cherishedbliss.com/pesto-caprese-grilled-cheese/",
    "ingredients": []
  },
  {
    "url": "https://www.instagram.com/p/BtJoZeEljZ1/",
    "ingredients": []
  },
  {
    "url": "https://bestrecipebox.com/baked-parmesan-zucchini-fries/",
    "ingredients": []
  },
  {
    "url": "http://feelgoodfoodie.net/grilled-mozzarella-sandwich-walnut-pesto/",
    "ingredients": []
  },
  {
    "url": "http://damndelicious.net/2014/06/21/baked-parmesan-zucchini/",
    "ingredients": []
  }
]